{
  "terms": {
    "title": "服务条款",
    "lastUpdated": "最后更新：{{date}}",
    "section1": {
      "title": "§ 1. 一般条款",
      "p1": "本服务条款规定了使用 Flovers 网站服务以及 Flovers 移动应用（Android，未来将支持 iOS）的规则，以及服务提供方通过电子方式提供服务的条件。",
      "p2": "服务提供方为 Marcin Janowski Copy Paste IT Solutions，地址：ul. płk. Francesco Nullo 30/115，31-543 克拉科夫，波兰，电子邮件：info@flovers.app（以下简称“服务提供方”）。",
      "p3": "使用本服务（包括注册账户、登录、使用应用或网站功能）即表示用户接受本条款并承诺遵守其内容。",
      "p4": "凡本条款未规定的事项，特别适用以下法律：电子服务法、民法典、消费者权益法以及其他适用的波兰法律和欧盟法律。"
    },
    "section2": {
      "title": "§ 2. 定义",
      "items": [
        "“服务”——服务提供方在 Flovers 框架内通过电子方式提供的服务，包括移动应用、网站以及相关的后端基础设施。",
        "“应用”——提供给移动设备使用的 Flovers 移动应用（Android；未来将支持 iOS）。",
        "“网站”——Flovers 网站及其文档和信息。",
        "“用户”——使用本服务的个人；在注册的情况下，指创建账户的个人。",
        "“账户”——服务提供方系统中用户的个人资料，受密码保护。",
        "“设备”——用户用于使用本服务的设备（例如手机、平板），以及（如适用）向服务发送读数的测量设备（例如 Arduino）。",
        "“植物定义”——由服务提供方制定的植物卡片/记录，包含植物特征、偏好和养护建议（例如浇水、喷雾、施肥），可能包含自动生成的元素（例如 AI 内容）。",
        "“植物实例”——用户在其账户中定义的植物（其自有实例），可与植物定义相关联。",
        "“读数 / 测量数据”——来自传感器的数据（例如空气温度、空气湿度、土壤湿度、光照水平），并分配给植物实例。",
        "“提醒”——循环性活动的定义（例如浇水、喷雾、换盆、养护、施肥），据此生成任务。",
        "“任务”——根据提醒创建的待办事项列表项；用户可将其标记为已完成并添加备注。",
        "“用户内容”——用户在服务中输入或维护的数据（例如植物实例、备注、任务历史、植物日志、与设备的关联、测量数据）。",
        "“植物识别”——对用户提供的照片进行分析并由服务提供方系统返回识别结果的功能。",
        "“条款”——本 Flovers 使用条款。"
      ]
    },
    "section3": {
      "title": "§ 3. 服务范围与功能",
      "intro": "本服务可能包括以下内容：",
      "list": [
        "账户注册与管理（登录、电子邮件确认、密码重置、重新发送激活链接）",
        "植物定义库及相关指导",
        "创建植物实例并记录日志/历史（备注、任务历史）",
        "与植物养护相关的提醒和任务（例如浇水、喷雾、施肥、换盆）",
        "基于用户上传照片的植物识别",
        "与测量设备的集成以及测量数据的保存与展示",
        "生成和扫描指向用户资源的二维码（例如植物实例）",
        "文档及常见问题（FAQ）"
      ],
      "p1": "目前本服务以免费（测试版）形式提供。服务提供方未来可能引入付费计划、对免费计划的限制、广告或订阅，并将通过服务和/或网站通知用户。",
      "p2": "服务提供方可更改服务的功能、界面和运行方式，包括删除或添加功能，但不得违反强制性法律规定。"
    },
    "section4": {
      "title": "§ 4. 技术要求",
      "items": [
        "可访问互联网的设备。",
        "最新的网页浏览器（用于网站）或兼容的 Android 系统（用于应用）。",
        "有效的电子邮件地址（用于注册和账户管理）。",
        "在浏览器中启用 JavaScript 和 Cookies（用于网站），如为正常运行所必需。"
      ]
    },
    "section5": {
      "title": "§ 5. 账户与安全",
      "p1": "使用本服务的大多数功能需要创建账户。",
      "p2": "用户有义务提供真实信息并对登录凭据保密。",
      "p3": "除非因服务提供方原因导致，否则用户需对使用其账户进行的行为承担责任。",
      "p4": "如发现滥用、安全违规或违反本条款，服务提供方可暂时阻止对账户或服务的访问。"
    },
    "section6": {
      "title": "§ 6. 用户内容与许可",
      "p1": "用户在法律允许的范围内保留其用户内容的权利。",
      "p2": "用户授予服务提供方非独占、免费的、可撤销的（通过删除账户或内容）、在提供服务所必需范围内可转让的许可，仅用于存储、固定、复制、展示和处理用户内容，以实现和维护本服务。",
      "p3": "在植物识别功能中，用户可向服务提供方系统上传照片。服务提供方声明，用于识别的照片不会被保存超过完成识别流程所必需的时间，除非用户明确使用需要保存照片的功能。",
      "p4": "用户声明其对提供给服务的内容拥有相应权利，且不侵犯第三方权利。"
    },
    "section7": {
      "title": "§ 7. 使用规则与禁止事项",
      "intro": "用户承诺依法、遵循良好风俗并尊重他人权利使用本服务。特别禁止以下行为：",
      "list": [
        "尝试绕过身份验证、安全措施或技术限制",
        "以可能干扰服务运行的方式滥用 API、端点或集成机制（包括与测量设备相关的）",
        "向服务中引入非法、侮辱性、侵犯人格权、版权或知识产权的内容",
        "通过联系或支持功能发送垃圾信息或促销/群发内容",
        "导致未经授权访问其他用户数据的行为"
      ],
      "p1": "如违反上述规则，服务提供方可限制对服务或账户的访问。"
    },
    "section8": {
      "title": "§ 8. 二维码、链接与“秘密密钥”",
      "p1": "本服务可能允许生成二维码或链接（例如指向植物实例）。用户需对其保管和分享负责。",
      "p2": "若用户向第三方分享链接、标识符或访问密钥（例如用于读取测量数据），该等人员可在所授予权限范围内访问相关信息。用户需自行承担由此产生的风险。"
    },
    "section9": {
      "title": "§ 9. 付款与计划（未来信息）",
      "p1": "截至本条款发布之日，本服务以测试版形式免费提供。",
      "p2": "服务提供方未来可能引入付费计划、可续订订阅、广告或限制（例如植物数量）。付费计划可能通过 Google Play 或 Apple App Store 推出。",
      "p3": "如引入订阅，可能为自动续订。付款、结算及可能的退款条件可能依据商店（Google/Apple）的规则以及购买时在服务中展示的信息。"
    },
    "section10": {
      "title": "§ 10. 责任与免责声明",
      "p1": "本服务具有信息与辅助性质，用于支持植物养护。服务提供方不保证达到特定结果（例如植物生长、避免植物疾病、避免养护错误）。有关植物养护的决定由用户自行承担责任。",
      "p2": "服务提供方按“现状”（尽最大努力）提供服务。可能因维护、开发或故障而出现技术中断或可用性限制。",
      "p3": "在法律允许范围内，服务提供方不对以下原因导致的损害承担责任：不当使用服务、用户输入的数据错误、用户端测量设备的故障、互联网中断或其他非服务提供方可控的情况。",
      "p4": "本条款不排除或限制消费者依据强制性法律规定享有的权利。"
    },
    "section11": {
      "title": "§ 11. 投诉与联系",
      "p1": "用户可通过电子方式向以下地址提交有关服务运行的投诉：info@flovers.app。",
      "p2": "投诉应描述问题，注明发生日期和情况，并在可能的情况下附上有助于识别问题的信息（例如截图）。",
      "p3": "服务提供方将尽快回复，原则上不晚于 14 天。"
    },
    "section12": {
      "title": "§ 12. 合同终止与账户删除",
      "p1": "用户可随时在应用中删除账户，这将导致账户及其在服务提供方系统中的相关数据被永久删除（不存在“隐藏”模式）。",
      "p2": "如违反本条款、从事违法行为或危及服务安全，服务提供方可暂停或终止向用户提供服务。",
      "p3": "出于重要原因（例如技术或法律原因），服务提供方可终止（全部或部分）提供服务，并在可能的情况下提前通知用户。"
    },
    "section13": {
      "title": "§ 13. 知识产权",
      "p1": "软件、外观、标识、Flovers 名称、文档以及服务提供方在服务中提供的内容均受法律保护（包括版权），并归服务提供方或相关权利人所有。",
      "p2": "除法律允许的合理使用外，未经服务提供方同意，禁止复制、修改、传播或使用服务的任何元素。"
    },
    "section14": {
      "title": "§ 14. 用户年龄",
      "p1": "本服务面向已年满 16 周岁的人员。",
      "p2": "未满 16 周岁的用户不应创建账户或使用本服务。"
    },
    "section15": {
      "title": "§ 15. 相关文件",
      "intro": "与本服务相关的文件和信息包括：",
      "list": [
        "隐私政策",
        "Cookies 政策",
        "文档及 FAQ"
      ]
    },
    "section16": {
      "title": "§ 16. 适用法律与争议解决",
      "p1": "本条款适用波兰法律，但不影响消费者保护的强制性法律规定。",
      "p2": "争议应首先通过友好方式解决（例如通过电子邮件联系并尝试协商）。",
      "p3": "消费者可使用非诉讼争议解决方式以及 ODR（在线争议解决）平台，地址：https://ec.europa.eu/consumers/odr/。",
      "p4": "与消费者的争议，其法院管辖权依照普遍适用的法律规定确定。"
    },
    "section17": {
      "title": "§ 17. 条款变更",
      "p1": "因重要原因（例如法律变更、服务发展、技术变更），服务提供方可修改本条款。",
      "p2": "服务提供方将通过网站和/或应用通知条款变更。变更生效后继续使用服务即表示接受更新后的条款。"
    }
  }
}
