{
  "docs_reminders": {
    "title": "याद दिलाने वाले",
    "sections": [
      {
        "heading": "इस दृश्य का उद्देश्य",
        "body": [
          "याद दिलाने वाला दृश्य पौधों की देखभाल के लिए आवर्ती अनुसूचियों को प्रबंधित करने के लिए है।",
          "याद दिलाना यह निर्धारित करता है कि क्या किया जाना चाहिए (कार्य प्रकार), यह कितनी बार दोहराया जाएगा (अंतराल), और यह किस पौधे से जुड़ा है। इसके आधार पर, Flovers स्वचालित रूप से समय में कार्यों को उत्पन्न करता है।"
        ]
      },
      {
        "heading": "दो दृश्य: याद दिलाने की सूची और कैलेंडर",
        "body": [
          "इस स्क्रीन में दो मोड हैं: याद दिलाने की सूची और कैलेंडर दृश्य।",
          "आप उन्हें स्क्रीन को बाएं/दाएं खिसका कर या FAB मेनू से दृश्य बदलने का चयन करके स्विच कर सकते हैं।",
          "दोनों दृश्य समान डेटा दिखाते हैं, लेकिन अलग-अलग तरीके से — यह इस पर निर्भर करता है कि आप नियमों को जल्दी से देखना चाहते हैं या समय में योजना देखना चाहते हैं।"
        ]
      },
      {
        "heading": "याद दिलाने की सूची दृश्य",
        "body": [
          "सूची दृश्य में, प्रत्येक टाइल एक उपयोगकर्ता द्वारा बनाई गई याद दिलाने को दर्शाता है।",
          "टाइल कार्य प्रकार (आइकन और नाम), पौधे का नाम, स्थान (यदि सौंपा गया हो), आवृत्ति की जानकारी और अगली कार्य पूरा करने की तिथि को दिखाती है।",
          "यह खाता पर सभी सक्रिय आवर्ती नियमों को देखने का सबसे तेज़ तरीका है।"
        ]
      },
      {
        "heading": "याद दिलाने वाले टाइल पर क्रियाएँ (संपादित करें / हटाएं)",
        "body": [
          "प्रत्येक याद दिलाने में दो क्रियाएँ होती हैं: संपादित करें और हटाएं।",
          "संपादन से याद दिलाने के पैरामीटर जैसे अंतराल, कार्य प्रकार, संबंधित पौधा और अन्य सेटिंग्स (याद दिलाने के प्रकार के आधार पर) बदलने की अनुमति मिलती है।",
          "याद दिलाने को हटाना स्थायी है और भविष्य में इस नियम से कार्य उत्पन्न नहीं होंगे।"
        ]
      },
      {
        "heading": "कैलेंडर दृश्य",
        "body": [
          "कैलेंडर दृश्य में, याद दिलाने को विशिष्ट दिनों पर निर्धारित वस्तुओं के रूप में प्रस्तुत किया जाता है।",
          "विवरण देखने के लिए, कैलेंडर में दिन पर क्लिक करें — उस दिन के लिए निर्धारित वस्तुएं कैलेंडर के नीचे दिखाई देंगी।",
          "कैलेंडर रंग/आइकन संकेतक का उपयोग करता है ताकि यह दिखा सके कि उस दिन के लिए कौन से कार्य प्रकार निर्धारित किए गए हैं और कार्यों के वितरण का मूल्यांकन आसान बना सके।"
        ]
      },
      {
        "heading": "FAB मेनू",
        "body": [
          "FAB बटन याद दिलाने और दृश्य परिवर्तन से संबंधित त्वरित क्रियाएँ प्रदान करता है।",
          "उपलब्ध विकल्प हैं: याद दिलाना जोड़ें, दृश्य बदलें (सूची/कैलेंडर), क्रमबद्ध करें और फ़िल्टर करें।",
          "क्रमबद्ध करना समाप्ति तिथि, पौधे का नाम या स्थान के अनुसार किया जा सकता है।",
          "फ़िल्टर में शामिल हो सकते हैं: पौधे का नाम, स्थान, कार्य प्रकार और तिथि सीमा (समाप्ति तिथि सीमा)।"
        ]
      },
      {
        "heading": "याद दिलाने वाले कार्य कैसे उत्पन्न करते हैं (सामान्य तर्क)",
        "body": [
          "याद दिलाने वाला एक आवर्ती नियम है (जैसे हर 7 दिन में पानी देना)।",
          "याद दिलाने के आधार पर, Flovers कार्य उत्पन्न करता है और इन्हें होम स्क्रीन पर प्रदर्शन करता है जैसे कि करने के लिए आइटम।",
          "कार्य को पूरा करने के बाद, अगला कार्य याद दिलाने के अंतराल के अनुसार निर्धारित किया जाता है (इससे रूटीन स्वचालित रूप से जारी रहता है)।"
        ]
      },
      {
        "heading": "टिप्पणियाँ और व्यावहारिक सुझाव",
        "body": [
          "याद दिलाने वाले नियमितता बनाए रखने में मदद करते हैं, लेकिन पौधों के स्वास्थ्य की गारंटी नहीं देते हैं — वास्तविक स्थितियाँ अंतरालों को समायोजित करने की आवश्यकता हो सकती हैं।",
          "यदि स्थितियाँ बदलती हैं (सीज़न, प्रकाश, मिट्टी, गमले का आकार), तो याद दिलाने को अपडेट करने पर विचार करें।",
          "यदि आप बंद कार्यों और नोट्स का प्रबंधन करना चाहते हैं, तो कार्य इतिहास दृश्य का उपयोग करें (जो अलग से वर्णित है)।"
        ]
      }
    ]
  }
}
