{
  "docs_readings": {
    "title": "पढ़ाई",
    "sections": [
      {
        "heading": "इस दृश्य का उद्देश्य",
        "body": [
          "पढ़ाई दृश्य उन IoT उपकरणों की समीक्षा और प्रबंधन की अनुमति देता है जो पौधों से जुड़े हैं।",
          "प्रत्येक उपकरण फ्लोवर्स को वायुमंडलीय तापमान, आर्द्रता, प्रकाश स्तर और मिट्टी की आर्द्रता जैसे माप भेज सकता है।",
          "यह कार्यक्षमता उन उपयोगकर्ताओं के लिए है जो अपने उपकरण (जैसे कि Arduino या ESP के आधार पर) बनाने के लिए पौधों की स्थितियों की निगरानी कर रहे हैं।"
        ]
      },
      {
        "heading": "उपकरण के टाइल्स और अंतिम पढ़ाई",
        "body": [
          "स्क्रीन पर टाइल्स की एक सूची प्रदर्शित की जाती है, जहां प्रत्येक टाइल एक जुड़े हुए उपकरण का प्रतिनिधित्व करती है।",
          "प्रत्येक टाइल पौधे का नाम, स्थान और सेंसर से नवीनतम पढ़ाई दिखाती है।",
          "यदि डेटा अभी तक प्राप्त नहीं हुआ है, तो मानों के स्थान पर प्रतिस्थापन चिह्न दिखाए जाते हैं।"
        ]
      },
      {
        "heading": "टाइल के साथ इंटरएक्शन",
        "body": [
          "टाइल के क्षेत्र पर क्लिक करने से उपयोगकर्ता सीधे उस उपकरण के लिए पढ़ाई इतिहास दृश्य पर भेजा जाता है।",
          "किसी विशिष्ट पैरामीटर (जैसे, आर्द्रता या तापमान) के आइकन पर क्लिक करने से उस चयनित पैरामीटर के साथ पढ़ाई इतिहास खुलता है।",
          "यह विस्तृत ग्राफ़ों तक त्वरित पहुँच प्रदान करता है।"
        ]
      },
      {
        "heading": "उपकरण क्रियाएँ (3-बिंदु मेनू)",
        "body": [
          "प्रत्येक उपकरण टाइल में अतिरिक्त क्रियाओं के साथ एक 3-बिंदु मेनू होता है।",
          "उपलब्ध विकल्प हैं: पढ़ाई इतिहास, पौधे का विवरण, उपकरण संपादित करें और उपकरण हटाएं।",
          "उपकरण को हटाना स्थायी है और यह उपकरण के पौधे से लिंक को हटा देता है।"
        ]
      },
      {
        "heading": "पढ़ाई इतिहास",
        "body": [
          "पढ़ाई इतिहास दृश्य एकत्रित माप डेटा के विस्तृत ग्राफ़ों को प्रस्तुत करता है।",
          "डेटा को दैनिक, साप्ताहिक और मासिक रूप में दिखाया जा सकता है।",
          "ग्राफ़ वायुमंडलीय तापमान, आर्द्रता, प्रकाश स्तर और मिट्टी की आर्द्रता (उपकरण के आधार पर) के लिए उपलब्ध हैं।"
        ]
      },
      {
        "heading": "FAB मेनू",
        "body": [
          "FAB बटन उपकरणों के प्रबंधन से संबंधित क्रियाएँ प्रदान करता है।",
          "उपलब्ध विकल्प हैं: उपकरण कनेक्ट करें, उपकरण सेटअप, छांटें और फ़िल्टर करें।",
          "छंटाई पौधे के नाम, स्थान या अंतिम पढ़ाई समय के आधार पर की जा सकती है।",
          "फ़िल्टरिंग में पौधे का नाम, स्थान और उपकरण की स्थिति (सक्रिय, निष्क्रिय) शामिल है।"
        ]
      },
      {
        "heading": "उपकरण जोड़ना",
        "body": [
          "उपकरण जोड़ने का विकल्प एक नया माप उपकरण जोड़ने और इसे पौधे से जोड़ने के लिए होता है।",
          "सेटअप के दौरान टाइल पर दिखाए जाने वाले पैरामीटर और वैकल्पिक अलर्ट (जैसे, मिट्टी की आर्द्रता का कम स्तर) चुने जाते हैं।",
          "प्रत्येक उपकरण को एक अद्वितीय उपकरण पहचानकर्ता और एक गुप्त उपकरण कुंजी प्राप्त होती है।"
        ]
      },
      {
        "heading": "उपकरण प्रमाणन और डेटा प्रवाह",
        "body": [
          "उपकरण अपने उपकरण पहचानकर्ता और गुप्त कुंजी का उपयोग करके प्रमाणित होते हैं।",
          "पढ़ाई रिकॉर्ड करने के लिए उपयोगकर्ता प्रमाणन की आवश्यकता नहीं है — डेटा केवल उपकरण द्वारा नियंत्रित किया जाता है।",
          "यह दृष्टिकोण IoT के एकीकरण और संचार को सरल बनाता है।"
        ]
      },
      {
        "heading": "उपकरण सेटअप और दस्तावेज़",
        "body": [
          "उपकरण सेटअप विकल्प उपकरण के एकीकरण से संबंधित तकनीकी निर्देश प्रदान करता है।",
          "इसमें API एण्डपॉइंट्स (पढ़ाई भेजने के लिए POST, प्राप्त करने के लिए GET), उदाहरण पे-लोड और सेटिंग्स शामिल हैं।",
          "उपयोगकर्ता पूर्ण दस्तावेज़ीकरण डाउनलोड कर सकता है, जिसमें उदाहरण कोड, कनेक्शन योजनाएँ (Fritzing) और अनुशंसित सेंसर शामिल हैं।"
        ]
      },
      {
        "heading": "महत्वपूर्ण जानकारी",
        "body": [
          "उपकरण की स्थिरता, सेंसरों की कैलिब्रेशन और शारीरिक स्थापना उपयोगकर्ता की जिम्मेदारी है।",
          "सेंसर से प्राप्त पढ़ाइयाँ सूचनात्मक होती हैं और उन्हें पौधों की निगरानी के साथ जोड़ा जाना चाहिए।",
          "Flovers बाहरी उपकरणों या स्वनिर्मित उपकरणों से प्राप्त डेटा की सटीकता की गारंटी नहीं देता है।"
        ]
      }
    ]
  }
}
