{
  "docs_scanner": {
    "title": "क्यूआर स्कैनर",
    "sections": [
      {
        "heading": "स्कैनर का क्या उपयोग है",
        "body": [
          "स्कैनर व्यू फ्लावर्स में पहले से जेनरेट किए गए क्यूआर कोड्स को स्कैन करने की सुविधा देता है।",
          "सबसे सामान्य परिदृश्य क्यूआर कोड को प्रिंट करना और इसे गमले पर रखना है, ताकि बाद में जल्दी से सही पौधे को ऐप में खोला जा सके।",
          "क्यूआर स्कैनिंग का मुख्य उद्देश्य सुविधाजनक और तेज नेविगेशन है — बिना सूची में मैन्युअल रूप से खोजे।"
        ]
      },
      {
        "heading": "कैमरा तक पहुँच की आवश्यकता",
        "body": [
          "क्यूआर स्कैनर की सुविधा का उपयोग करने के लिए फ्लावर्स ऐप को फोन के कैमरे तक पहुँच की अनुमति की आवश्यकता है।",
          "कैमरा केवल वास्तविक समय में क्यूआर कोड स्कैनिंग के लिए उपयोग किया जाता है और यह वीडियो रिकॉर्डिंग या फोटो लेने के लिए इस्तेमाल नहीं होता है, सिवाय इस प्रक्रिया के।",
          "अगर कैमरा तक पहुँच को अस्वीकार कर दिया जाता है, तो स्कैनर की सुविधा तब तक काम नहीं करेगी जब तक कि सिस्टम सेटिंग्स में उपयुक्त अनुमतियाँ प्रदान न की जाएं।"
        ]
      },
      {
        "heading": "फ्लावर्स में क्यूआर कोड में क्या होता है",
        "body": [
          "फ्लावर्स में क्यूआर कोड फ्लावर्स के लिए एक संदर्भ और उपयोगकर्ता खाते में पौधे की विशिष्ट इंस्टेंस (ID) का पहचानकर्ता होता है।",
          "सही तरीके से क्यूआर कोड स्कैन करने पर ऐप इसे पहचान लेता है और निर्दिष्ट पौधे के लिए रीडायरेक्ट करता है।",
          "क्यूआर कोड मुख्य रूप से उपयोगकर्ता खाते में सहेजे गए अपने पौधों के साथ काम करने के लिए होते हैं।"
        ]
      },
      {
        "heading": "सही तरीके से स्कैन करने के बाद क्या होता है",
        "body": [
          "क्यूआर कोड को सही तरीके से स्कैन करने के बाद उपयोगकर्ता को स्वचालित रूप से पौधे के विवरण (Plant Details) दृश्य पर रीडायरेक्ट किया जाता है।",
          "पौधे के विवरण में पौधे की जानकारी, जुड़े कार्य और नवीनतम रीडिंग्स (यदि पौधा डिवाइस से जुड़ा हुआ है) उपलब्ध होते हैं।",
          "इससे स्कैनर पौधे के पूर्ण दृश्य पर जाने का सबसे तेज़ तरीका बन जाता है।"
        ]
      },
      {
        "heading": "पौधे का क्यूआर कोड कहाँ देखा जा सकता है",
        "body": [
          "क्यूआर कोड का पूर्वावलोकन पौधे के दृश्य (Plants) में पौधों की सूची पर उपलब्ध है — बस चयनित पौधे के लिए ड्रॉपडाउन मेनू खोलें और क्यूआर कोड विकल्प चुनें।",
          "क्यूआर कोड को पौधे के विवरण (Plant Details) दृश्य में भी सीधे देखा जा सकता है।",
          "दोनों स्थानों पर वही क्यूआर कोड दिखाया जाता है जो उस पौधे के लिए असाइन किया गया है।"
        ]
      },
      {
        "heading": "क्यूआर कोड को सहेजना या भेजना",
        "body": [
          "पौधे (Plants) दृश्य और पौधे के विवरण (Plant Details) से क्यूआर कोड को फोन में सहेजा जा सकता है।",
          "क्यूआर कोड को अपनी ईमेल पर भी भेजा जा सकता है — जैसे कि बाद में प्रिंट करने या बैकअप कॉपी रखने के लिए।",
          "प्रिंट करते समय क्यूआर कोड की पठनीयता का ध्यान रखें (अच्छा कंट्रास्ट, कोई मोड़ नहीं, कोई प्रतिबिंब नहीं)।"
        ]
      },
      {
        "heading": "स्कैनिंग समस्याओं का समाधान",
        "body": [
          "यदि स्कैनिंग काम नहीं कर रही है, तो रोशनी को सुधारने की कोशिश करें और सुनिश्चित करें कि कोड फ्लैट और पूरी तरह से कैमरा फ्रेम में दिखाई दे रहा है।",
          "अगर कोड क्षतिग्रस्त या धुंधला है, तो इसे ऐप से फिर से सेव करें या ईमेल पर भेजकर एक नई प्रति प्रिंट करें।",
          "यदि कोड गलत पौधे को खोलता है, तो सुनिश्चित करें कि जब कोड सेव या एक्सपोर्ट किया गया था, तो सही पौधे को चुना गया था।"
        ]
      }
    ]
  }
}
