{
  "docs_home": {
    "title": "होम",
    "sections": [
      {
        "heading": "होम दृश्य का उद्देश्य",
        "body": [
          "होम वह मुख्य स्क्रीन है जो सही तरीके से लॉग इन करने के बाद दिखाई देती है।",
          "यह दैनिक गतिविधियों पर ध्यान केंद्रित करता है: यह अनुस्मारकों के आधार पर जनरेट किए गए कार्यों को प्रदर्शित करता है, जिससे यह जल्दी से देखा जा सकता है कि आज क्या ध्यान देने की आवश्यकता है या क्या पहले से ही लंबित है।",
          "यदि कोई कार्य करने के लिए नहीं है, तो एक सूचना बॉक्स दिखाई देता है जो योजना में कोई कार्य न होने का संदेश देता है और आगे के कदमों के सुझाव देता है, जैसे कि अनुस्मारक बनाने का सुझाव।"
        ]
      },
      {
        "heading": "कार्य सूची (अनुस्मारकों से उत्पन्न टाइलें)",
        "body": [
          "प्रत्येक टाइल एक एकल कार्य का प्रतिनिधित्व करती है जो अनुस्मारक की परिभाषा के आधार पर उत्पन्न होती है (जैसे: पानी देना, छिड़काव करना, उर्वरक देना, प्रत्यारोपण करना या देखभाल करना)।",
          "कार्य स्वचालित रूप से तब दिखाई देते हैं जब वे अनुस्मारक में निर्धारित चक्रीयता नियमों के अनुसार आवश्यक हो जाते हैं।",
          "टाइल सामान्यतः कार्य का प्रकार, पौधे का नाम, स्थान और समय सीमा की स्थिति (जैसे: आज के लिए या लंबित) शामिल करती है।"
        ]
      },
      {
        "heading": "कार्य टाइल मेनू (एकल कार्य के लिए क्रियाएं)",
        "body": [
          "प्रत्येक कार्य में एक संदर्भ मेनू (तीन बिंदुओं वाला मेनू) होता है जिसमें उस विशेष कार्य के लिए संबंधित क्रियाएं होती हैं।",
          "पूर्ण के रूप में चिह्नित करें: कार्य को बंद करता है और वैकल्पिक रूप से एक नोट जोड़ने की अनुमति देता है, जो देखभाल इतिहास को बनाने में मदद करता है।",
          "अनुस्मारक संपादित करें: कार्य से संबंधित अनुस्मारक को खोलता है ताकि चक्रीयता सेटिंग्स को बदला जा सके।",
          "पौधे पर जाएं: कार्य से जुड़े पौधे के विवरण दृश्य पर ले जाता है।",
          "इतिहास दिखाएं: कार्यों का इतिहास खोलता है जो उसी पौधे या अनुस्मारक के लिए पहले किए गए कार्यों को दिखाता है।"
        ]
      },
      {
        "heading": "FAB बटन (त्वरित क्रियाएं)",
        "body": [
          "होम स्क्रीन पर एक FAB बटन उपलब्ध होता है जो कार्यों के साथ काम करने के लिए त्वरित क्रियाओं का एक सेट खोलता है।",
          "लंबित दिखाएं: केवल लंबित कार्यों को प्रदर्शित करने के लिए त्वरित फ़िल्टर लागू करता है।",
          "आज के लिए दिखाएं: आज के लिए निर्धारित कार्यों को प्रदर्शित करने के लिए त्वरित फ़िल्टर लागू करता है।",
          "क्रमबद्ध करें: कार्यों की सूची में क्रम बदलता है।",
          "फ़िल्टर करें: चुने गए मानदंडों के आधार पर कार्यों की सूची को संकुचित करता है।",
          "इतिहास: कार्यों के इतिहास दृश्य पर ले जाता है, जिसे अलग से दस्तावेजित किया जाता है।"
        ]
      },
      {
        "heading": "क्रमबद्ध करने के विकल्प",
        "body": [
          "क्रमबद्ध करना आपको कार्यों की सूची को आपके कार्य करने के तरीके के अनुसार अनुकूलित करने की अनुमति देता है।",
          "उपलब्ध क्रमबद्ध करने के विकल्प हैं: निष्पादन तिथि (समय सीमा), पौधे का नाम और स्थान।"
        ]
      },
      {
        "heading": "फ़िल्टर करने के विकल्प",
        "body": [
          "फ़िल्टर आपको चयनित कार्यों के समूह पर ध्यान केंद्रित करने में मदद करते हैं।",
          "कार्य को फ़िल्टर किया जा सकता है: पौधे के नाम, स्थान, कार्य प्रकार और निष्पादन तिथियों की सीमा के अनुसार।",
          "फ़िल्टर को संयोजित किया जा सकता है, जैसे कि केवल पानी देने के कार्यों को एक चयनित स्थान पर प्रदर्शित करने के लिए।"
        ]
      },
      {
        "heading": "समूह समापन कार्य (बल्क)",
        "body": [
          "समूह समापन कार्य तब उपलब्ध होते हैं जब संक्षिप्त दृश्य का उपयोग किया जाता है: लंबित दिखाएं या आज के लिए दिखाएं।",
          "जब इनमें से कोई एक फ़िल्टर सक्रिय होता है, तो FAB बटन अस्थायी रूप से अतिरिक्त क्रिया, जैसे 'दिखाए गए कार्यों को पूर्ण के रूप में चिह्नित करें' को प्रदर्शित करता है।",
          "यह क्रिया सभी वर्तमान में दिखाई दे रहे कार्यों को एक साथ बंद कर देती है, बिना प्रत्येक टाइल को मैन्युअल रूप से चयनित किए।",
          "समूह समापन उस स्थिति के लिए डिज़ाइन किया गया है जब आप एक ही देखभाल कार्य को एक साथ कई पौधों के लिए कर रहे होते हैं।",
          "चयनित प्रवाह के आधार पर, समापन कार्यों पर नोट्स जोड़ना संभव हो सकता है, यहां तक कि समूह क्रिया के बाद भी।"
        ]
      },
      {
        "heading": "होम स्क्रीन से नेविगेशन",
        "body": [
          "होम स्क्रीन आपको कार्य टाइलों और FAB शॉर्टकट्स पर क्रियाओं के माध्यम से एप्लिकेशन के अन्य हिस्सों में त्वरित नेविगेशन की अनुमति देती है।",
          "एकल कार्य से आप सीधे पौधे के विवरण या कार्यों के इतिहास पर जा सकते हैं।",
          "FAB से आप कार्यों के इतिहास को खोल सकते हैं या क्रमबद्ध करने और फ़िल्टर करने के माध्यम से कार्यों की सूची को संकुचित कर सकते हैं।"
        ]
      }
    ]
  }
}
