{
  "docs_plants": {
    "title": "पौधे",
    "sections": [
      {
        "heading": "इस दृश्य का उद्देश्य",
        "body": [
          "पौधों का दृश्य आपके खाते में बनाए गए सभी पौधों की इंस्टेंस को प्रदर्शित करता है।",
          "प्रत्येक टाइल एक पौधे का प्रतिनिधित्व करता है (आपका उदाहरण)। टाइल से आप पौधे के विवरण पर जा सकते हैं या तीन बिंदुओं के मेनू में शॉर्टकट्स का उपयोग कर सकते हैं (जैसे याद दिलाना, डायरी, क्यूआर कोड)।"
        ]
      },
      {
        "heading": "पौधे के टाइल्स (सूची)",
        "body": [
          "पौधे का टाइल पौधे का नाम और (यदि उपलब्ध हो) संबंधित पौधे की परिभाषा (प्रजाति) और निर्धारित स्थान को प्रदर्शित करता है।",
          "टाइल की सामग्री (तीन बिंदुओं के मेनू के बाहर) पर टैप करने से पौधे के विवरण दृश्य पर जाते हैं।"
        ]
      },
      {
        "heading": "तीन बिंदुओं का मेनू (पौधे की क्रियाएँ)",
        "body": [
          "प्रत्येक टाइल में तीन बिंदुओं का मेनू होता है जिसमें चयनित पौधे के लिए क्रियाएँ होती हैं:",
          "पौधे को संपादित करें: पौधे के डेटा और पैरामीटर को संपादित करने के लिए खोलता है।",
          "याद दिलाने दिखाएँ: याद दिलाने के दृश्य पर जाता है जिसमें चयनित पौधे से संबंधित याद दिलाने का फ़िल्टर सेट होता है।",
          "पौधे का डायरी दिखाएँ: बंद किए गए कार्यों का इतिहास (उपयोगकर्ता की टिप्पणियों सहित) दिखाने वाला मोडल खोलता है। टिप्पणियाँ दिखाई देती हैं और छिपाई नहीं जाती हैं।",
          "क्यूआर कोड दिखाएँ: पौधे के लिए क्यूआर कोड, संक्षिप्त विवरण और कोड को अपनी ईमेल पर भेजने या डाउनलोड करने के विकल्प वाला मोडल खोलता है।",
          "पौधे को हटाएँ: पौधे और संबंधित डेटा, जैसे कार्य, याद दिलाने और उपकरणों से लिंक को स्थायी रूप से हटा देता है।"
        ]
      },
      {
        "heading": "FAB बटन का मेनू",
        "body": [
          "पौधे के दृश्य में FAB त्वरित क्रियाएँ प्रदान करता है:",
          "पौधा बनाएँ: पौधे बनाने के लिए एक वर्कफ़्लो (9 चरणों की प्रक्रिया) को सक्रिय करता है, जिसमें पौधे को ठीक से परिभाषित किया जा सकता है।",
          "सॉर्ट करें: पौधों के टाइल्स को पौधे के नाम या स्थान के अनुसार सॉर्ट करता है।",
          "फ़िल्टर करें: स्थान के अनुसार सूची को फ़िल्टर करता है।",
          "स्थान: स्थान दृश्य पर जाता है, जहाँ स्थान जोड़े, संपादित और प्रबंधित किए जा सकते हैं, जिनका उपयोग समूहबद्ध करने और फ़िल्टर करने के लिए किया जाता है।"
        ]
      },
      {
        "heading": "पौधा हटाना (महत्वपूर्ण जानकारी)",
        "body": [
          "पौधे को हटाना एक स्थायी क्रिया है और इसे पूर्ववत नहीं किया जा सकता है।",
          "पौधे को हटाने से पौधे की इंस्टेंस और संबंधित डेटा, जैसे जनरेट किए गए कार्य, पौधे से जुड़े याद दिलाने और उपकरणों से लिंक हटा दिए जाते हैं।"
        ]
      },
      {
        "heading": "जब कोई पौधा नहीं दिखता",
        "body": [
          "यदि सूची खाली है, तो FAB मेनू से पौधा बनाएँ क्रिया का उपयोग करके पहला पौधा जोड़ें।",
          "पौधे जोड़ने के बाद, आप उन्हें स्थानों के माध्यम से समूहित कर सकते हैं और याद दिलाने के द्वारा देखभाल दिनचर्या को प्रबंधित कर सकते हैं।"
        ]
      }
    ]
  }
}
