{
  "docs_profile": {
    "title": "प्रोफ़ाइल",
    "sections": [
      {
        "heading": "इस दृश्य का उद्देश्य",
        "body": [
          "प्रोफ़ाइल दृश्य खाता डेटा, अधिसूचना सेटिंग्स, ऐप कॉन्फ़िगरेशन और सहायता का प्रबंधन करने के लिए केंद्रीय स्थान है।",
          "यह उपयोगकर्ता को व्यक्तिगत डेटा और फ्लोवर्स ऐप के व्यवहार दोनों पर नियंत्रण करने की अनुमति देता है।"
        ]
      },
      {
        "heading": "खाता",
        "body": [
          "खाता अनुभाग खाता के बारे में बुनियादी जानकारी दिखाता है, जैसे ईमेल पता और खाता बनाने की तिथि।",
          "यहां से उपयोगकर्ता ईमेल पता बदल सकता है (पासवर्ड से पुष्टि आवश्यक है), वर्तमान पासवर्ड बदल सकता है, लॉगआउट कर सकता है या खाता स्थायी रूप से हटा सकता है।",
          "खाता हटाने से उपयोगकर्ता के सभी डेटा, जैसे पौधे, अनुस्मारक, कार्य, पठन और उपकरण, का अपरिवर्तनीय रूप से नष्ट हो जाएगा।"
        ]
      },
      {
        "heading": "अधिसूचनाएँ",
        "body": [
          "अधिसूचनाएँ अनुभाग ईमेल और पुश अधिसूचनाओं के लिए अनुमतियों और प्राथमिकताओं का प्रबंधन करने की अनुमति देता है।",
          "दोनों चैनलों के लिए, उपयोगकर्ता दो प्रकार की अधिसूचनाएँ चालू या बंद कर सकता है: आज के लिए नियोजित कार्यों के बारे में दैनिक सारांश और एक अनुस्मारक जो 24 घंटे बाद भेजा जाता है यदि कार्य अभी भी पूरा नहीं हुआ है।",
          "प्रत्येक प्रकार की अधिसूचना के लिए, उपयोगकर्ता भेजने का समय निर्धारित करता है (पूरा घंटा, जैसे 14:00)।"
        ]
      },
      {
        "heading": "सेटिंग्स",
        "body": [
          "सेटिंग्स अनुभाग ऐप के सामान्य व्यवहार और रूप को नियंत्रित करने की अनुमति देता है।",
          "उपलब्ध विकल्पों में भाषा चयन, तिथि और समय प्रारूप, तापमान की इकाई (सेल्सियस, फ़ारेनहाइट, केल्विन), माप की इकाई (मीट्रिक या इंपीरियल) और FAB बटन की स्थिति (बाएं या दाएं) शामिल हैं।",
          "उपयोगकर्ता ऐप के रूप को भी अनुकूलित कर सकता है, जैसे बैकग्राउंड इमेज, टाइल थीम (प्रकाश या अंधकार) और टाइल्स की पारदर्शिता स्तर।"
        ]
      },
      {
        "heading": "सहायता",
        "body": [
          "सहायता अनुभाग उपयोगकर्ता को फ्लोवर्स टीम से सीधे संपर्क करने की अनुमति देता है।",
          "उपयोगकर्ता एक समस्या रिपोर्ट कर सकता है या तकनीकी सहायता टीम से पूछताछ भेज सकता है।",
          "त्रुटियाँ रिपोर्ट करना ऐप के विकास और गुणवत्ता सुधार में मदद करता है।"
        ]
      }
    ]
  }
}
