{
  "docs_auth": {
    "title": "लॉगिन और पंजीकरण",
    "sections": [
      {
        "heading": "नया खाता बनाना (पंजीकरण)",
        "body": [
          "Flovers का उपयोग करने के लिए, एक व्यक्तिगत उपयोगकर्ता खाता बनाना आवश्यक है। पंजीकरण सीधे मोबाइल एप्लिकेशन में होता है।",
          "पंजीकरण के दौरान केवल ईमेल पता और पासवर्ड की आवश्यकता होती है। इस चरण में कोई अतिरिक्त व्यक्तिगत जानकारी आवश्यक नहीं है।",
          "पासवर्ड में कम से कम 8 वर्ण होने चाहिए और इसमें कम से कम एक अंक और एक विशेष वर्ण होना चाहिए, ताकि बुनियादी सुरक्षा स्तर सुनिश्चित किया जा सके।",
          "पंजीकरण को समाप्त करने से पहले उपयोगकर्ता को नियम और शर्तों और गोपनीयता नीति को स्वीकार करना होगा।"
        ]
      },
      {
        "heading": "ईमेल के माध्यम से खाता सक्रियण",
        "body": [
          "पंजीकरण फ़ॉर्म भेजने के बाद, दिए गए ईमेल पते पर एक सक्रियण संदेश भेजा जाता है।",
          "खाता सक्रिय करने के लिए, प्राप्त संदेश में दिए गए पुष्टि लिंक पर क्लिक करना आवश्यक है।",
          "खाते के सक्रिय होने तक एप्लिकेशन में लॉगिन करना संभव नहीं है।"
        ]
      },
      {
        "heading": "पुनः सक्रियण ईमेल भेजना",
        "body": [
          "यदि सक्रियण ईमेल नहीं आया है, तो उपयोगकर्ता एप्लिकेशन से इसे पुनः भेजने का अनुरोध कर सकता है।",
          "यह विकल्प लॉगिन या पंजीकरण स्क्रीन पर उपलब्ध है और इसका उपयोग तब किया जा सकता है जब संदेश खो गया हो, देरी से आया हो, या स्पैम में चला गया हो।",
          "पुनः भेजने से पहले, स्पैम फ़ोल्डर या अन्य मेल फ़िल्टर की जांच करना उचित है।"
        ]
      },
      {
        "heading": "मौजूदा खाते में लॉगिन",
        "body": [
          "लॉगिन करने के लिए केवल ईमेल पता और खाता से जुड़ा पासवर्ड आवश्यक है।",
          "यदि खाता अभी तक सक्रिय नहीं किया गया है, तो एप्लिकेशन ईमेल पते की पुष्टि की आवश्यकता के बारे में सूचित करेगा।",
          "लॉगिन डेटा सर्वर पर सुरक्षित रूप से सत्यापित किया जाता है; पासवर्ड को स्पष्ट रूप में नहीं रखा जाता है।"
        ]
      },
      {
        "heading": "भूल गए पासवर्ड को रीसेट करना",
        "body": [
          "यदि उपयोगकर्ता भूल गए पासवर्ड के कारण लॉगिन नहीं कर पा रहे हैं, तो वे पासवर्ड रीसेट के लिए ईमेल भेजने का अनुरोध कर सकते हैं।",
          "संदेश में निर्देश और एक सुरक्षित लिंक होता है जो नए पासवर्ड को सेट करने की अनुमति देता है।",
          "नया पासवर्ड सेट करने के बाद, तुरंत एप्लिकेशन में लॉगिन करना संभव है।"
        ]
      },
      {
        "heading": "सुरक्षा टिप्स",
        "body": [
          "प्रत्येक उपयोगकर्ता खाता पंजीकरण के दौरान सेट किए गए व्यक्तिगत पासवर्ड द्वारा सुरक्षित किया जाता है।",
          "सुरक्षा कारणों से लॉगिन जानकारी को तीसरे पक्ष के साथ साझा नहीं करना चाहिए।",
          "यदि खाता में अनधिकृत पहुंच का संदेह हो, तो तुरंत पासवर्ड बदलने की सलाह दी जाती है।"
        ]
      }
    ]
  }
}
