{
  "docs_create_plant_wizard": {
    "title": "पौधा जोड़ने का विज़ार्ड",
    "sections": [
      {
        "heading": "इस प्रक्रिया का उद्देश्य",
        "body": [
          "पौधा जोड़ने का विज़ार्ड 9 चरणों में एक मार्गदर्शित प्रक्रिया है, जो आपके खाते में एक नया पौधा इंस्टेंस बनाने के लिए है।",
          "यह (वैकल्पिक रूप से) पौधे को फ्लोवर्स डेटाबेस से पौधे की परिभाषा से जोड़ने में मदद करता है, संदर्भ (स्थान, एक्सपोज़र) एकत्र करता है, और वैकल्पिक रूप से देखभाल प्राथमिकताओं के आधार पर अनुस्मारक उत्पन्न करता है।",
          "विज़ार्ड का उपयोग केवल नए पौधे को बनाने के लिए किया जाता है। मौजूदा पौधे को संपादित करने के लिए एक अलग दृश्य/प्रक्रिया का उपयोग किया जाता है।"
        ]
      },
      {
        "heading": "चरण 01 — पौधे की परिभाषा का चयन (वैकल्पिक)",
        "body": [
          "आप खोज बॉक्स का उपयोग करके पौधे की परिभाषा (निर्मित प्रजाति प्रोफ़ाइल) खोज सकते हैं।",
          "नीचे एक सूची है जिसमें लोकप्रिय घरेलू पौधे हैं, जो एक त्वरित शॉर्टकट के रूप में कार्य करता है।",
          "वैकल्पिक रूप से आप पौधों की पहचान का उपयोग कर सकते हैं: स्कैनिंग चालू करें, तस्वीर लें या इसे गैलरी से चुनें, और सिस्टम तीन सबसे मेल खाने वाले परिणाम दिखाएगा।",
          "यदि आप प्रस्ताव स्वीकार करते हैं, तो चयनित पौधे की परिभाषा नए पौधे पर लागू हो जाएगी।"
        ]
      },
      {
        "heading": "चरण 02 — परिभाषा का पूर्वावलोकन",
        "body": [
          "यदि पौधे की परिभाषा चयनित की गई है, तो इस चरण में उसकी जानकारी दिखाई जाएगी: चित्र और मुख्य विशेषताएँ एवं प्राथमिकताएँ।",
          "यह एक सत्यापन कदम है, जो आगे बढ़ने से पहले सही प्रोफ़ाइल की पुष्टि करने में मदद करता है।"
        ]
      },
      {
        "heading": "चरण 03 — स्थान का चयन (आवश्यक)",
        "body": [
          "उस स्थान को चुनें जहाँ पौधा स्थित है (जैसे रसोई, लिविंग रूम, बालकनी)।",
          "इस चरण में आप एक नया स्थान भी जोड़ सकते हैं।",
          "वर्तमान में स्थान का चयन आवश्यक है ताकि आप अगले चरणों में आगे बढ़ सकें।"
        ]
      },
      {
        "heading": "चरण 04 — एक्सपोज़र (वैकल्पिक माप)",
        "body": [
          "यह चरण एक्सपोज़र संदर्भ को दर्ज करने की अनुमति देता है: दिशा, प्रकाश स्तर और खिड़की से दूरी।",
          "दिशा को फोन के कंपास का उपयोग करके मापा जा सकता है, यदि एप्लिकेशन को कंपास/सेंसर की अनुमति दी गई हो।",
          "प्रकाश स्तर को मापा जा सकता है यदि उपकरण में उपयुक्त सेंसर हो और आवश्यक अनुमतियाँ दी गई हों।",
          "एक्सपोज़र मान वैकल्पिक हैं — आप इन्हें मैन्युअल रूप से पूरा कर सकते हैं या छोड़ सकते हैं।"
        ]
      },
      {
        "heading": "चरण 05 — बर्तन और मिट्टी (वैकल्पिक)",
        "body": [
          "बर्तन/गमला का प्रकार (जैसे प्लास्टिक, सिरेमिक) और मिट्टी/सब्सट्रेट का प्रकार निर्धारित करें।",
          "ये फ़ील्ड वैकल्पिक हैं, लेकिन यह स्वचालित कार्यों को सक्रिय करते समय सुझाए गए अंतराल के बेहतर मिलान में मदद कर सकते हैं।"
        ]
      },
      {
        "heading": "चरण 06 — स्वचालित कार्य (वैकल्पिक, पौधे की परिभाषा के साथ)",
        "body": [
          "यदि पौधा एक पौधे की परिभाषा से जुड़ा है, तो फ्लोवर्स स्वचालित रूप से प्राथमिकताओं के आधार पर अनुस्मारक/कार्य उत्पन्न कर सकता है।",
          "मुख्य चेकबॉक्स को चिह्नित करें ताकि स्वचालित उत्पन्न को सक्षम किया जा सके, और फिर उन कार्यों के प्रकार का चयन करें जिन्हें बनाना है (जैसे पानी देना, छिड़काव, खाद डालना, स्थानांतरित करना, देखभाल)।",
          "सुझाए गए अंतराल पौधे की परिभाषा पर आधारित होते हैं और एक्सपोज़र और बर्तन/मिट्टी के आधार पर अनुकूलित किए जा सकते हैं यदि ये डेटा उपलब्ध हों।",
          "आप इस चरण को छोड़ सकते हैं और बाद में मैन्युअल रूप से अनुस्मारक बना सकते हैं।"
        ]
      },
      {
        "heading": "चरण 07 — अपना स्वयं का चित्र जोड़ना (वैकल्पिक)",
        "body": [
          "आप अपने फोन से पौधे का अपना चित्र जोड़ सकते हैं।",
          "यह चरण वैकल्पिक है और आपके एप्लिकेशन प्रवाह के अनुसार, यह बाद में भी संभव हो सकता है।"
        ]
      },
      {
        "heading": "चरण 08 — अंतिम डेटा (आवश्यक नाम)",
        "body": [
          "पौधे का प्रदर्शन नाम सेट करें (आवश्यक)।",
          "वैकल्पिक रूप से नोट्स और खरीदारी की तिथि जोड़ें।",
          "यह जानकारी पौधे की विशेषताओं में दिखाई देती है और देखभाल इतिहास को साफ़ और सुसंगत रखने में मदद करती है।"
        ]
      },
      {
        "heading": "चरण 09 — सारांश और पुष्टि",
        "body": [
          "सही तरीके से पौधा जोड़ने के बाद, विज़ार्ड पुष्टि/सारांश स्क्रीन दिखाता है।",
          "यहां से आप पौधों की सूची में जा सकते हैं या नए बनाए गए पौधे को खोल सकते हैं — एप्लिकेशन के नेविगेशन के आधार पर।"
        ]
      },
      {
        "heading": "टिप्पणियाँ और अनुमतियाँ",
        "body": [
          "पौधों की पहचान के लिए कैमरा और/या गैलरी तक पहुँच की आवश्यकता होती है, यह उस तरीके पर निर्भर करता है जिससे चित्र प्रदान किया गया हो।",
          "एक्सपोज़र माप के लिए सेंसर अनुमतियाँ (जैसे कंपास) की आवश्यकता हो सकती है और यह उपकरण में उपलब्ध हार्डवेयर पर निर्भर करेगा।",
          "पौधे की परिभाषा से जुड़ना वैकल्पिक है — आप इस चरण को छोड़ सकते हैं और फिर भी पौधा बना सकते हैं, और बाद में अनुस्मारक मैन्युअल रूप से जोड़ सकते हैं।"
        ]
      }
    ]
  }
}
