{
  "docs_overview": {
    "title": "समीक्षा",
    "sections": [
      {
        "heading": "Flovers क्या है?",
        "body": [
          "Flovers एक पौधा देखभाल सहायक है, जो दैनिक गतिविधियों को व्यवस्थित करने, देखभाल इतिहास को ट्रैक करने और अपने IoT उपकरणों से डेटा को मॉनिटर करने में मदद करता है।",
          "ऐप रिमाइंडर्स और कार्यों को पौधों के प्रोफाइल (आपके पौधे) और पौधों की परिभाषाओं (प्रकारों की अंतर्निहित प्रोफाइल और अनुशंसाओं) के साथ जोड़ता है।",
          "Flovers आपके निर्णयों का समर्थन करता है, लेकिन उन्हें प्रतिस्थापित नहीं करता है—देखभाल के परिणाम स्थितियों और निर्देशों के अनुप्रयोग पर निर्भर करते हैं।",
          "सेवा में मोबाइल ऐप (Android; भविष्य में iOS), बैकएंड API और दस्तावेज़ों और कानूनी जानकारी के साथ एक वेबसाइट शामिल है।"
        ]
      },
      {
        "heading": "प्रमुख अवधारणाएँ (ऐप संरचना कैसे काम करती है)",
        "body": [
          "पौधे की परिभाषा: एक अंतर्निहित प्रजाति प्रोफ़ाइल जिसमें सामान्य विशेषताएँ और अनुशंसाएँ (प्रकाश, सिंचाई/सिंचाई, उर्वरक आदि) होती हैं।",
          "पौधे का उदाहरण: आपका व्यक्तिगत पौधा (आपका संस्करण), वैकल्पिक रूप से पौधे की परिभाषा से जुड़ा होता है ताकि बेहतर डिफ़ॉल्ट सुझाव प्राप्त हो सकें।",
          "रिमाइंडर: एक आवधिक नियम (जैसे, X दिनों में सिंचाई), जिसके आधार पर स्वचालित रूप से कार्य उत्पन्न होते हैं।",
          "कार्य: रिमाइंडर से उत्पन्न एक विशिष्ट क्रिया; आप इसे पूरा के रूप में चिह्नित कर सकते हैं और एक नोट जोड़ सकते हैं, देखभाल इतिहास बनाने के लिए।"
        ]
      },
      {
        "heading": "मुख्य सुविधाएँ संक्षेप में",
        "body": [
          "उपयोगकर्ता खाता: पंजीकरण, लॉगिन, ईमेल सत्यापन, पासवर्ड रीसेट और प्रोफ़ाइल सेटिंग्स का प्रबंधन।",
          "पौधों का प्रबंधन: पौधों को जोड़ना, स्थानों के द्वारा समूहित करना, नोट्स और कार्यों का इतिहास देखना।",
          "रिमाइंडर और कार्य: आवधिक दिनचर्या बनाना (सिंचाई, छिड़काव, उर्वरक, प्रत्यारोपण, देखभाल) और उन्हें पूरा करना।",
          "IoT रीडिंग्स: अपने उपकरणों को जोड़ना और तापमान, आर्द्रता, मृदा आर्द्रता और प्रकाश की तीव्रता जैसे डेटा को रिकॉर्ड करना।"
        ]
      },
      {
        "heading": "पौधों की पहचान (तस्वीर के आधार पर)",
        "body": [
          "Flovers पौधों की पहचान तस्वीर से करता है, ताकि पौधे की परिभाषा को बेहतर तरीके से मेल किया जा सके और डिफ़ॉल्ट सेटिंग्स के साथ शुरू किया जा सके।",
          "पहचान सर्वर पक्ष पर होती है, जिसमें सेवा प्रदाता का अपना ML सिस्टम होता है, जो 700+ प्रजातियों पर प्रशिक्षित है।",
          "पहचान के लिए भेजी गई तस्वीरें केवल पहचान प्रक्रिया को पूरा करने के लिए उपयोग की जाती हैं और स्थायी रूप से संग्रहित नहीं की जाती हैं।",
          "परिणाम तस्वीर की गुणवत्ता, प्रकाश, फोकस, पौधे की दृश्यता और अन्य प्रजातियों के साथ समानता पर निर्भर करते हैं।"
        ]
      },
      {
        "heading": "IoT उपकरण और सेंसर डेटा",
        "body": [
          "Flovers अपने या बाहरी उपकरणों (जैसे, Arduino) का समर्थन करता है, जो आपके खाते से जुड़े डेटा भेजते हैं।",
          "समर्थित रीडिंग्स: हवा का तापमान, आर्द्रता, मृदा आर्द्रता और प्रकाश का स्तर।",
          "रीडिंग्स बैकएंड में स्टोर की जाती हैं और ऐप में वर्तमान मानों और इतिहास (दैनिक/साप्ताहिक/मासिक सारांश) के रूप में प्रस्तुत की जाती हैं।",
          "आपके पास पेयरिंग और उपयोग पर नियंत्रण है—उपकरणों की स्थिरता, कैलिब्रेशन और स्थापना आपके नियंत्रण में रहती है।"
        ]
      },
      {
        "heading": "QR कोड और त्वरित पहुँच",
        "body": [
          "आप QR कोड उत्पन्न कर सकते हैं, जिसमें आपके खाते में पौधे के उदाहरण का लिंक होता है।",
          "एक सामान्य परिदृश्य कोड को गमले पर प्रिंट और चिपकाना है, फिर पौधे के विवरण में त्वरित पहुँच के लिए स्कैन करें।",
          "QR कोड सुविधा के लिए होते हैं; इन्हें एक एक्सेस संकेतक के रूप में देखें और सार्वजनिक रूप से साझा न करें, यदि वे मेटाडेटा का खुलासा कर सकते हैं।",
          "वर्तमान में, पौधे के विवरण केवल लॉग इन किए गए मालिक के लिए ही उपलब्ध होते हैं।"
        ]
      },
      {
        "heading": "सूचनाएँ और रिमाइंडर",
        "body": [
          "Flovers कार्यों के बारे में पुश सूचनाएँ भेज सकता है (Firebase के माध्यम से), आज के कार्यों या देर से कार्यों के बारे में—यह सेटिंग्स पर निर्भर करता है।",
          "सूचना सेटिंग्स आपको प्रोफ़ाइल में मिलेंगी; पुश बंद करने के बाद भी, रिमाइंडर और कार्य ऐप में रहते हैं।",
          "ईमेल संदेश वर्तमान में मुख्य रूप से खाता गतिविधियों (सक्रियकरण और पासवर्ड रीसेट) के लिए उपयोग किए जाते हैं।",
          "सूचनाएँ सहायक होती हैं—Flovers पौधों के स्वास्थ्य की गारंटी नहीं देता और यह नहीं सुनिश्चित करता कि रिमाइंडर नुकसान से बचेंगे।"
        ]
      },
      {
        "heading": "गोपनीयता, सुरक्षा और आपका डेटा",
        "body": [
          "Flovers खाता डेटा और सेवा प्रदान करने के लिए आवश्यक डेटा (पौधे, रिमाइंडर, कार्य, नोट्स और रीडिंग्स) संग्रहीत करता है।",
          "पासवर्ड हैश्ड रूप में संग्रहीत होते हैं; खाता सक्रियण के लिए ईमेल सत्यापन की आवश्यकता होती है।",
          "डेटा संसाधित करने का अनुमान EU में है; होस्टिंग Hetzner (EU) पर योजना बनाई गई है, और पुश सूचनाएँ Firebase के माध्यम से प्रदान की जाती हैं।",
          "विस्तृत जानकारी गोपनीयता नीति और सेवा शर्तों में उपलब्ध है, जो वेबसाइट और ऐप में उपलब्ध हैं।"
        ]
      },
      {
        "heading": "सीमाएँ और महत्वपूर्ण अस्वीकरण",
        "body": [
          "Flovers एक योजना और निगरानी उपकरण है; यह एक पेशेवर सलाहकार प्रणाली नहीं है और यह बागवानी ज्ञान को प्रतिस्थापित नहीं करता है।",
          "सेंसर रीडिंग्स गलत हो सकती हैं (कैलिब्रेशन, स्थापना, स्थिति); महत्वपूर्ण मामलों में, इन्हें स्वयं सत्यापित करें।",
          "देखभाल अनुशंसाएँ सामान्य हैं और यह आपके पर्यावरण (मिट्टी, गमला, प्रकाश, आर्द्रता, मौसम) के अनुकूल नहीं हो सकती हैं।",
          "अगर कुछ गलत लगता है, तो अपनी खुद की राय पर भरोसा करें—दिनचर्या को समायोजित करें और विश्वसनीय स्रोतों का उपयोग करें।"
        ]
      },
      {
        "heading": "आगे क्या?",
        "body": [
          "अगर आप शुरू कर रहे हैं, तो Login & Register पर जाएं और फिर Create Plant Wizard में पहला पौधा उदाहरण बनाएं।",
          "फिर रिमाइंडर सेट करें और कार्यों को पूरा करें, ताकि दिनचर्या बनाए रखें और देखभाल इतिहास बनाएं।",
          "अगर आपके पास उपकरण है, तो Readings खोलें, इसे कॉन्फ़िगर करें और Readings History का उपयोग करके रुझानों पर नजर रखें।",
          "FAQ का उपयोग करें त्वरित उत्तरों के लिए और सेवा शर्तों/गोपनीयता नीति दस्तावेज़ों का उपयोग करें औपचारिक मामलों के लिए।"
        ]
      }
    ]
  }
}
