{
  "docs_task_history": {
    "title": "कार्य इतिहास",
    "sections": [
      {
        "heading": "कार्य इतिहास दृश्य का उद्देश्य",
        "body": [
          "कार्य इतिहास का उपयोग उन कार्यों को देखने और प्रबंधित करने के लिए किया जाता है जो किए गए हैं (बंद किए गए)।",
          "यह यह विश्लेषण करने में मदद करता है कि क्या किया गया, कब किया गया और किन पौधों पर यह कार्य किए गए थे।",
          "दृश्य को सक्रिय फ़िल्टर (जैसे चयनित पौधे के लिए इतिहास) के साथ खोला जा सकता है या यह सभी बंद कार्यों को प्रदर्शित कर सकता है।"
        ]
      },
      {
        "heading": "बंद कार्यों के टाइल्स",
        "body": [
          "प्रत्येक टाइल एक व्यक्तिगत बंद कार्य का प्रतिनिधित्व करती है और इसमें कार्य का प्रकार (जैसे जलना, स्प्रे करना, उर्वरक देना), पौधे का नाम, स्थान और कार्य की तिथि शामिल होती है।",
          "बंद कार्यों में कार्य को पूरा करने के दौरान जो टिप्पणी जोड़ी गई हो सकती है।",
          "टिप्पणियाँ केवल टाइल को विस्तारित करने पर दिखाई देती हैं।"
        ]
      },
      {
        "heading": "टिप्पणियों का पूर्वावलोकन: विस्तारण और संकुचन",
        "body": [
          "बंद कार्य के लिए टिप्पणी देखने के लिए, आप टाइल को टैप करके विस्तारित कर सकते हैं।",
          "आप कार्यविभाजन से संबंधित कार्य के रूप में 'विस्तारित/संकीर्ण' क्रिया का चयन करने के लिए तीन बिंदु मेनू का भी उपयोग कर सकते हैं (वर्तमान स्थिति के आधार पर)।",
          "इससे सूची पठनीय और संक्षिप्त बनी रहती है, और विवरण आवश्यकता अनुसार उपलब्ध होते हैं।"
        ]
      },
      {
        "heading": "टाइल मेनू (तीन बिंदु)",
        "body": [
          "प्रत्येक बंद कार्य टाइल में एक संदर्भ मेनू होता है जिसमें उस विशेष इतिहास आइटम के लिए क्रियाएँ होती हैं।",
          "विस्तारित/संकीर्ण: टाइल के भीतर टिप्पणी अनुभाग को दिखाता या छिपाता है।",
          "स्मरणोत्सव संपादित करें: कार्य से संबंधित अनुस्मारक पर जाता है, ताकि आप आवधिकता सेटिंग्स या अन्य पैरामीटर बदल सकें।",
          "पौधे पर जाएं: कार्य से संबंधित पौधे के विवरण दृश्य पर ले जाता है।",
          "कार्य हटाएं: चयनित बंद कार्य को स्थायी रूप से उपयोगकर्ता खाता से हटा देता है।"
        ]
      },
      {
        "heading": "FAB क्रियाएँ (फ्लोटिंग एक्शन बटन)",
        "body": [
          "कार्य इतिहास दृश्य में एक FAB बटन होता है जो पूरे सूची पर कार्य करने के लिए क्रियाएँ प्रदान करता है।",
          "सॉर्ट करें: बंद कार्यों के प्रदर्शित क्रम को बदलता है।",
          "फ़िल्टर करें: चयनित मानदंडों के आधार पर इतिहास सूची को संकुचित करता है।",
          "हटाएं: मानदंडों के आधार पर कार्यों को सामूहिक रूप से हटाने की अनुमति देता है (जैसे चयनित पौधे के लिए कार्य, स्थान के लिए कार्य, कार्य प्रकार के लिए कार्य, या किसी निर्दिष्ट तिथि से पुराने कार्य)।"
        ]
      },
      {
        "heading": "सॉर्टिंग विकल्प",
        "body": [
          "सॉर्टिंग मदद करता है इतिहास को उस क्रम में देखने में जो आपके काम करने के तरीके के लिए सबसे उपयुक्त है।",
          "उपलब्ध सॉर्टिंग विकल्प हैं: क्रियावली तिथि, पौधे का नाम और स्थान।"
        ]
      },
      {
        "heading": "फ़िल्टरिंग विकल्प",
        "body": [
          "फ़िल्टर आपको बंद कार्यों के चयनित उपसमूह पर ध्यान केंद्रित करने की अनुमति देते हैं।",
          "आप फ़िल्टर कर सकते हैं: पौधे का नाम, स्थान, कार्य प्रकार और क्रियावली तिथि सीमा के आधार पर।",
          "फ़िल्टर को संयुक्त किया जा सकता है, जैसे कि एक विशेष स्थान पर एक निश्चित माह में उर्वरक किए गए कार्यों को प्रदर्शित करने के लिए।"
        ]
      },
      {
        "heading": "समूहात्मक हटाना (हटाने की क्रिया)",
        "body": [
          "समूहात्मक हटाना आपको चयनित मानदंडों के आधार पर कई बंद कार्यों को एक साथ स्थायी रूप से हटाने की अनुमति देता है।",
          "सामान्य परिदृश्यों में शामिल हैं: एक पौधे के इतिहास को साफ़ करना, स्थान के लिए कार्य हटाना, केवल एक कार्य प्रकार को हटाना या किसी निर्दिष्ट तिथि से पुराने कार्यों को हटाना।",
          "समूहात्मक हटाना स्थायी है और इसे पलट नहीं सकते।"
        ]
      },
      {
        "heading": "कार्य इतिहास और होम के बीच अंतर",
        "body": [
          "होम वर्तमान कार्यों (आज और लंबित कार्य) पर केंद्रित है और उनके निष्पादन पर ध्यान देता है।",
          "कार्य इतिहास निष्पादित कार्यों पर केंद्रित है और यह इतिहास प्रविष्टियों की समीक्षा, सॉर्टिंग, फ़िल्टरिंग और हटाने का समर्थन करता है।",
          "ये दोनों दृश्य एक साथ उपयोगकर्ता को दैनिक कार्यों (होम) को निष्पादित करने और दीर्घकालिक देखभाल इतिहास (कार्य इतिहास) का विश्लेषण करने की अनुमति देते हैं।"
        ]
      }
    ]
  }
}
