{
  "docs_plant_details": {
    "title": "पौधे का विवरण",
    "sections": [
      {
        "heading": "इस दृश्य का उद्देश्य",
        "body": [
          "पौधे का विवरण दृश्य एक उपयोगकर्ता द्वारा बनाई गई एकल पौधे को देखने और प्रबंधित करने का केंद्रीय स्थान है।",
          "यह पौधे की जानकारी, निर्धारित अनुस्मारक, कार्य, सेंसर रीडिंग (यदि उपलब्ध हो) और इस पौधे से संबंधित त्वरित क्रियाओं को जोड़ता है।"
        ]
      },
      {
        "heading": "पौधे की जानकारी",
        "body": [
          "स्क्रीन के ऊपरी भाग में पौधे का चित्र, उसका नाम, वैकल्पिक पौधे की परिभाषा का नाम और निर्धारित स्थान प्रदर्शित होता है।",
          "नीचे पौधे के निर्माण के दौरान दी गई विशेषताओं जैसे कि खरीदारी की तारीख, नोट्स, प्रकाश की स्थिति, उन्मुखीकरण, खिड़की से दूरी, गमले का प्रकार और मिट्टी का प्रकार प्रदर्शित होती हैं।",
          "यह जानकारी अनुस्मारकों, रीडिंग और देखभाल निर्णयों की सही व्याख्या करने में मदद करती है।"
        ]
      },
      {
        "heading": "पौधे स्तर की क्रियाएँ (तीन बिंदु मेनू)",
        "body": [
          "पौधे के शीर्षक से संबंधित तीन बिंदु मेनू पौधे से संबंधित अतिरिक्त क्रियाएँ प्रदान करता है।",
          "उपलब्ध विकल्पों में पौधे की परिभाषा (यदि वह जुड़ी हो), पौधे के डेटा का संपादन, चित्र बदलना और इस पौधे के लिए फ़िल्टर किए गए अनुस्मारकों पर जाना शामिल है।",
          "चित्र बदलने से आप डिफ़ॉल्ट चित्र को बदल सकते हैं, अपने फोन से एक चित्र जोड़ सकते हैं या चित्र हटा सकते हैं।"
        ]
      },
      {
        "heading": "पौधे की परिभाषा",
        "body": [
          "यदि पौधा फ्लोवर्स डेटाबेस की पौधे की परिभाषा से जुड़ा है, तो उपयोगकर्ता उस परिभाषा का समर्पित दृश्य खोल सकता है।",
          "यह दृश्य पौधे का विवरण, देखभाल की प्राथमिकताएँ, लक्षण, कठिनाई स्तर, तापमान सीमा, आर्द्रता, विषाक्तता और विकास के प्रकार जैसी जाति संबंधित जानकारी प्रदान करता है।",
          "पौधों की परिभाषाएँ सामान्य मार्गदर्शन प्रदान करती हैं और इन्हें उपयोगकर्ता की वास्तविक स्थितियों के संदर्भ में व्याख्यायित किया जाना चाहिए।"
        ]
      },
      {
        "heading": "अनुस्मारक और कार्य",
        "body": [
          "अनुस्मारक अनुभाग उस पौधे से संबंधित सभी सक्रिय अनुस्मारक प्रदर्शित करता है।",
          "प्रत्येक अनुस्मारक का अपना तीन बिंदु मेनू होता है, जो कार्य को बंद करने, अनुस्मारक संपादित करने या कार्य इतिहास दिखाने की अनुमति देता है।",
          "कार्य को बंद करते समय उपयोगकर्ता एक नोट जोड़ सकता है, जो पौधे की देखभाल इतिहास का हिस्सा बन जाता है।"
        ]
      },
      {
        "heading": "नवीनतम रीडिंग",
        "body": [
          "यदि पौधा किसी माप यंत्र से जुड़ा है, तो इस दृश्य में सेंसर रीडिंग प्रदर्शित होती हैं।",
          "समर्थित रीडिंग में वायु तापमान, वायु आर्द्रता, प्रकाश स्तर और मिट्टी की आर्द्रता शामिल हैं।",
          "अनुभाग अंतिम मानों को दिखाता है और माप समय की जानकारी प्रदान करता है।",
          "रीडिंग के टाइल पर टैप करने से उपयोगकर्ता रीडिंग इतिहास दृश्य में पहुंच जाता है, जहाँ तापमान, आर्द्रता, प्रकाश और मिट्टी की आर्द्रता (यदि डिवाइस पौधे से जुड़ा हो) के लिए दैनिक/साप्ताहिक/मासिक सारांश और विस्तृत ग्राफ प्रदर्शित होते हैं।"
        ]
      },
      {
        "heading": "QR कोड और त्वरित पहुँच",
        "body": [
          "प्रत्येक पौधे का एक अद्वितीय QR कोड होता है, जो स्क्रीन के नीचे प्रदर्शित होता है।",
          "इस कोड को स्कैन करने से सीधे पौधे के विवरण दृश्य में पहुँच जाता है।",
          "QR कोड को डिवाइस पर सहेजा जा सकता है या ईमेल किया जा सकता है, जिससे इसे मुद्रित किया जा सकता है और गमले पर लगाया जा सकता है।"
        ]
      },
      {
        "heading": "महत्वपूर्ण जानकारी",
        "body": [
          "उपयोगकर्ता द्वारा जोड़ी गई तस्वीरें केवल उपयोगकर्ता के डिवाइस पर स्टोर होती हैं और फ्लोवर्स के बैकएंड में नहीं सेव होती हैं।",
          "पौधों के डिफ़ॉल्ट चित्र फ्लोवर्स बैकएंड से आते हैं और इन्हें AI के माध्यम से उत्पन्न किया जा सकता है।",
          "सेंसर रीडिंग और सुझाए गए कार्य सूचना उद्देश्य के होते हैं और इन्हें उपयोगकर्ता की व्यक्तिगत मूल्यांकन के साथ जोड़ा जाना चाहिए।"
        ]
      }
    ]
  }
}
