{
  "title": "सामान्यतः पूछे जाने वाले प्रश्न",
  "items": [
    {
      "q": "Flovers क्या है और मैं इसे किस लिए उपयोग कर सकता हूँ?",
      "a": "Flovers एक ऐप है जो पौधों की देखभाल का समर्थन करता है, कार्यों को व्यवस्थित करने और सेंसर डेटा के आधार पर पौधों के मापदंडों की निगरानी करने के लिए। यह अनुस्मारक, सुझाव और जानकारी प्रदान करता है जो दैनिक खेती में सहायक होते हैं।"
    },
    {
      "q": "क्या Flovers मुफ्त है?",
      "a": "हाँ। वर्तमान में Flovers मुफ्त में उपलब्ध है।"
    },
    {
      "q": "Flovers कौन सी प्लेटफ़ॉर्म पर उपलब्ध है?",
      "a": "Flovers वर्तमान में Android पर उपलब्ध है। भविष्य में iOS के लिए समर्थन की योजना है।"
    },
    {
      "q": "क्या Flovers उपयोग करने के लिए खाता आवश्यक है?",
      "a": "हाँ। ऐप और इसके कार्यों का उपयोग करने के लिए खाता बनाना आवश्यक है।"
    },
    {
      "q": "क्या Flovers कई भाषाओं में उपलब्ध है?",
      "a": "हाँ। Flovers कई भाषाओं का समर्थन करता है, जिनमें अंग्रेजी, पोलिश, जर्मन, इतालवी, फ्रांसीसी, स्पेनिश, पुर्तगाली, अरबी, हिंदी, चीनी, जापानी और कोरियाई शामिल हैं।"
    },
    {
      "q": "मैं खाता कैसे बना सकता हूँ?",
      "a": "आप ऐप में सीधे पंजीकरण कर सकते हैं। पंजीकरण के बाद, खाता पुष्टि के लिए ईमेल से सत्यापित करना आवश्यक है। यदि आवश्यक हो, तो आप फिर से सक्रियण ईमेल भेज सकते हैं।"
    },
    {
      "q": "मैंने सक्रियण ईमेल नहीं प्राप्त किया है — क्या करूँ?",
      "a": "आप ऐप में सीधे सक्रियण ईमेल को पुनः भेजने का अनुरोध कर सकते हैं।"
    },
    {
      "q": "मैं पासवर्ड कैसे रीसेट कर सकता हूँ?",
      "a": "आप ऐप में पासवर्ड रीसेट के लिए ईमेल का अनुरोध कर सकते हैं। यदि आप लॉग इन हैं, तो आप खाता सेटिंग्स में सीधे पासवर्ड बदल सकते हैं।"
    },
    {
      "q": "क्या मैं अपने खाते से जुड़े ईमेल पते को बदल सकता हूँ?",
      "a": "हाँ। लॉग इन करने के बाद, आप ऐप में प्रोफ़ाइल स्क्रीन पर अपना ईमेल पता बदल सकते हैं।"
    },
    {
      "q": "मैं खाता और डेटा को कैसे हटा सकता हूँ?",
      "a": "खाता स्थायी रूप से प्रोफ़ाइल स्क्रीन से लॉग इन करने के बाद हटाया जा सकता है। यह कार्रवाई अपरिवर्तनीय है और इससे सभी संबंधित डेटा हटा दिए जाएंगे।"
    },
    {
      "q": "पौधे की परिभाषा और मेरा पौधा में क्या अंतर है?",
      "a": "पौधे की परिभाषा Flovers के डेटाबेस में एक अंतर्निहित रिकॉर्ड है, जिसमें किसी प्रजाति की सामान्य जानकारी जैसे कि प्राथमिकताएँ, विशेषताएँ, चित्र, प्रकाश, मिट्टी की आवश्यकताएँ, और सिचाई या स्प्रेइंग के लिए अनुशंसित अंतराल होते हैं। आपका पौधा वह विशिष्ट उदाहरण है जिसे आप स्वयं प्रबंधित करते हैं।"
    },
    {
      "q": "पौधों की पहचान की सुविधा कितनी सटीक है?",
      "a": "सटीकता चित्र की गुणवत्ता और पौधे की स्थिति पर निर्भर करती है। पहचान प्रणाली 700 से अधिक पौधों की प्रजातियों पर आधारित है।"
    },
    {
      "q": "क्या पौधों की पहचान के लिए भेजी गई तस्वीरें सहेजी जाती हैं?",
      "a": "नहीं। तस्वीरों को केवल पहचान के उद्देश्यों के लिए बैकएंड द्वारा प्रोसेस किया जाता है और इन्हें स्थायी रूप से सहेजा नहीं जाता है।"
    },
    {
      "q": "क्या मैं एक साथ कई पौधों का पालन कर सकता हूँ?",
      "a": "हाँ। वर्तमान में कोई पौधों या मापने वाले उपकरणों की संख्या पर कोई सीमा नहीं है, जिन्हें जोड़ा जा सकता है। प्रत्येक पौधा एक मापने वाले उपकरण से जुड़ा हो सकता है।"
    },
    {
      "q": "क्या मैं पौधों पर नोट्स जोड़ सकता हूँ या एक पौधा डायरी रख सकता हूँ?",
      "a": "हाँ। आप पौधों और समाप्त कार्यों पर नोट्स जोड़ सकते हैं, जिससे एक देखभाल डायरी बनाई जा सकती है।"
    },
    {
      "q": "अनुस्मारक और कार्य कैसे काम करते हैं?",
      "a": "उपयोगकर्ता एक निर्दिष्ट अंतराल के साथ अनुस्मारक बनाता है। इसके आधार पर कार्य स्वचालित रूप से बनाए जाते हैं। कार्य को पूरा किए जाने के बाद, अगला कार्य निर्धारित अंतराल के अनुसार योजना बनाई जाती है। सेटिंग्स के आधार पर, आप आज के या एक दिन पहले के कार्यों के लिए ईमेल या पुश सूचनाएँ प्राप्त कर सकते हैं।"
    },
    {
      "q": "किस प्रकार के देखभाल कार्यों का समर्थन किया जाता है?",
      "a": "समर्थित कार्यों में सिचाई, स्प्रेइंग, उर्वरक, प्रत्यारोपण, और सामान्य देखभाल शामिल हैं।"
    },
    {
      "q": "क्या होगा अगर मैं कार्य करना भूल जाऊं?",
      "a": "अगर कार्य पूरा नहीं किया जाता है, तो ऐप 24 घंटों के बाद अनुस्मारक भेज सकता है। अन्यथा, कार्य तब तक लंबित रहेगा जब तक कि इसे पूरा नहीं किया जाता।"
    },
    {
      "q": "क्या मैं अनुस्मारकों को बंद या संपादित कर सकता हूँ?",
      "a": "आप कभी भी अनुस्मारकों को संपादित या हटा सकते हैं। वर्तमान में उन्हें अस्थायी रूप से निलंबित करने का कोई विकल्प नहीं है।"
    },
    {
      "q": "क्या अनुस्मारक यह सुनिश्चित करते हैं कि मेरे पौधे स्वस्थ होंगे?",
      "a": "नहीं। Flovers अनुस्मारक और सुझाव प्रदान करता है, लेकिन देखभाल से संबंधित निर्णय और उनके प्रभाव उपयोगकर्ता पर निर्भर करते हैं।"
    },
    {
      "q": "मैं Flovers से कौन से सेंसर और उपकरण जोड़ सकता हूँ?",
      "a": "Flovers तापमान, वायु आर्द्रता, प्रकाश स्तर और मिट्टी की आर्द्रता मापने वाले सेंसर का समर्थन करता है। उपकरणों के प्रस्तावित कॉन्फ़िगरेशन ऐप दस्तावेज़ में पाए जा सकते हैं।"
    },
    {
      "q": "सेंसर डेटा कितनी बार अपडेट होते हैं?",
      "a": "पढ़ाई हर 5 मिनट में भेजी जा सकती है। डेटा को रिकॉर्ड करने के लिए, वर्तमान में डेटा को घंटे के अंतराल में संग्रहीत किया जाता है।"
    },
    {
      "q": "क्या होगा अगर मेरा मापने वाला उपकरण काम करना बंद कर दे?",
      "a": "ऐप पढ़ाई की अनुपस्थिति के बारे में सूचित नहीं करता है। हालांकि, अगर मिट्टी की आर्द्रता का स्तर निर्धारित सीमा से नीचे गिरता है, तो यह सूचनाएं भेज सकता है।"
    },
    {
      "q": "क्या सेंसर डेटा क्लाउड में सहेजा जाता है?",
      "a": "हाँ। सेंसर डेटा VPS सर्वर पर क्लाउड में सहेजा जाता है।"
    },
    {
      "q": "क्या अन्य लोग मेरे सेंसर डेटा को देख सकते हैं?",
      "a": "वर्तमान में नहीं। भविष्य में साझा करने के विकल्प जोड़े जा सकते हैं। उपयोगकर्ता API से डेटा डाउनलोड करके इसे अन्य उपकरणों, जैसे स्वचालित सिचाई, के साथ एकीकृत भी कर सकता है।"
    },
    {
      "q": "Flovers में QR कोड का क्या उपयोग है?",
      "a": "उपयोगकर्ता QR कोड जेनरेट और प्रिंट कर सकते हैं और उन्हें गमलों पर लगा सकते हैं। प्रत्येक कोड एक विशिष्ट पौधे की इकाई को दर्शाता है। कोड स्कैन करने पर, उपयोगकर्ता ऐप में पौधे की जानकारी में पहुँच जाएगा।"
    },
    {
      "q": "क्या पौधे के QR कोड या लिंक को साझा करना सुरक्षित है?",
      "a": "आमतौर पर हाँ। पौधे की जानकारी केवल लॉगिन किए उपयोगकर्ता को दिखाई देती है, जो उसका मालिक होता है।"
    },
    {
      "q": "क्या मैं अपने पौधों को सार्वजनिक कर सकता हूँ या उन्हें दोस्तों के साथ साझा कर सकता हूँ?",
      "a": "इस समय नहीं। सार्वजनिक साझाकरण की सुविधाएँ भविष्य में जोड़ी जा सकती हैं।"
    },
    {
      "q": "क्यों मुझे सूचनाएं नहीं मिल रही हैं?",
      "a": "सुनिश्चित करें कि पुश सूचनाएं आपके डिवाइस की सिस्टम सेटिंग्स और ऐप की प्रोफ़ाइल स्क्रीन पर सक्षम हैं।"
    },
    {
      "q": "मैं तकनीकी सहायता से कैसे संपर्क कर सकता हूँ या समस्या की रिपोर्ट कैसे कर सकता हूँ?",
      "a": "आप Flovers की वेबसाइट पर संपर्क फ़ॉर्म का उपयोग कर सकते हैं या ऐप में प्रोफ़ाइल स्क्रीन से संपर्क फ़ॉर्म का उपयोग कर सकते हैं।"
    }
  ]
}
