{
  "privacy": {
    "title": "गोपनीयता नीति",
    "lastUpdated": "अंतिम अद्यतन: {{date}}",
    "section1": {
      "title": "धारा 1. सामान्य प्रावधान",
      "p1": "Flovers वेब सेवा और Flovers मोबाइल ऐप के संबंध में व्यक्तिगत डेटा का संचालन करने वाला डेटा नियंत्रक मार्सिन जानोव्स्की, कॉपी पेस्ट आईटी सॉल्यूशंस है, जिसका मुख्यालय पिओल. फ्रांसेस्को नुल्लो 30/115, 31-543 क्राकोव, पोलैंड में है, ईमेल पता: info@flovers.app, जिसे आगे \"प्रबंधक\" कहा जाएगा।",
      "p2": "प्रबंधक व्यक्तिगत डेटा का संचालन यूरोपीय संसद और परिषद (EU) 2016/679 विनियमन (GDPR) के अनुसार करता है।",
      "p3": "यह गोपनीयता नीति Flovers वेब सेवा, Flovers मोबाइल ऐप (एंड्रॉइड, और भविष्य में iOS) और उनके संचालन से संबंधित बैकएंड इंफ्रास्ट्रक्चर को कवर करती है।"
    },
    "section2": {
      "title": "धारा 2. व्यक्तिगत डेटा के संचालन का क्षेत्र और उद्देश्य",
      "intro": "प्रबंधक व्यक्तिगत डेटा को निम्नलिखित उद्देश्यों के लिए संचालित करता है:",
      "list": [
        "ऐप्लिकेशन में उपयोगकर्ता खाता बनाने और उसे संचालित करने के लिए",
        "उपयोगकर्ता की प्रमाणीकरण और लॉगिन प्रक्रिया को पूरा करने के लिए",
        "सिस्टम संदेशों को भेजने के लिए, जिनमें सत्यापन ईमेल और पासवर्ड रीसेट शामिल हैं",
        "संपर्क फ़ॉर्म के माध्यम से भेजे गए अनुरोधों की प्रक्रिया के लिए",
        "ऐप्लिकेशन और सेवा के सही संचालन को सुनिश्चित करने के लिए",
        "पौधों की देखभाल से संबंधित अनुस्मारक, कार्य और सूचनाएं पूरी करने के लिए",
        "सिस्टम की सुरक्षा सुनिश्चित करने और तकनीकी लॉग बनाए रखने के लिए"
      ],
      "legalBasis": "डेटा संचालन का कानूनी आधार GDPR के अनुच्छेद 6(1)(b) (संविदा निष्पादन), अनुच्छेद 6(1)(c) (कानूनी आवश्यकता) और अनुच्छेद 6(1)(f) (प्रबंधक के वैध हित) है।"
    },
    "section3": {
      "title": "धारा 3. संचालित किए गए डेटा की श्रेणियाँ",
      "intro": "ऐप्लिकेशन या सेवा के उपयोग के तरीके के आधार पर, प्रबंधक निम्नलिखित डेटा का संचालन कर सकता है:",
      "list": [
        "उपयोगकर्ता का ईमेल पता",
        "उपयोगकर्ता का एन्क्रिप्टेड पासवर्ड",
        "उपयोगकर्ता के प्रोफ़ाइल और प्राथमिकताओं की जानकारी",
        "उपकरण के तकनीकी डेटा (उपकरण का प्रकार, ऑपरेटिंग सिस्टम, ऐप्लिकेशन का संस्करण)",
        "IP पता",
        "उपकरण की ओरिएंटेशन से संबंधित डेटा (जैसे, पौधों को प्रकाश के संपर्क में लाने के लिए अनुकूलन)",
        "उपयोगकर्ता द्वारा पौधों, माप और IoT सेंसर से संबंधित दर्ज किए गए डेटा"
      ],
      "note": "उपयोगकर्ता द्वारा खींची गई तस्वीरें सामान्यतः डिवाइस पर स्थानीय रूप से प्रोसेस की जाती हैं, जब तक उपयोगकर्ता उन्हें सर्वर-साइड प्रोसेसिंग की आवश्यकता वाली सुविधाओं में उपयोग करने का निर्णय नहीं लेता।"
    },
    "section4": {
      "title": "धारा 4. उपयोगकर्ता खाते और सुरक्षा",
      "p1": "Flovers ऐप्लिकेशन के उपयोगकर्ता व्यक्तिगत खाते बनाते हैं जो पासवर्ड से सुरक्षित होते हैं।",
      "p2": "पासवर्ड एन्क्रिप्टेड (हैश किए गए) रूप में संग्रहीत होते हैं।",
      "p3": "उपयोगकर्ता खाता ईमेल पते के सत्यापन की आवश्यकता करता है।",
      "p4": "उपयोगकर्ता किसी भी समय अपना पासवर्ड बदल सकता है या उसे रीसेट करने की प्रक्रिया का उपयोग कर सकता है।"
    },
    "section5": {
      "title": "धारा 5. सूचनाएं और संचार",
      "p1": "प्रबंधक केवल लेन-देन संबंधित संदेश भेजता है, विशेष रूप से लॉगिन, खाता सत्यापन और पासवर्ड रीसेट से संबंधित।",
      "p2": "ऐप्लिकेशन पौधों की देखभाल से संबंधित कार्यों को याद दिलाने के लिए पुश नोटिफिकेशन (जैसे, Firebase के माध्यम से) का उपयोग कर सकती है।",
      "p3": "प्रबंधक भविष्य में न्यूज़लेटर लागू करने का अधिकार सुरक्षित रखता है, हालांकि, विपणन संदेशों का वितरण केवल उपयोगकर्ता से अलग से सहमति प्राप्त करने के बाद किया जाएगा।"
    },
    "section6": {
      "title": "धारा 6. कुकीज़ और समान प्रौद्योगिकियाँ",
      "p1": "Flovers वेब सेवा वेबसाइट के सही संचालन के लिए आवश्यक कुकीज़ का उपयोग कर सकती है।",
      "p2": "कुकीज़ केवल तकनीकी और कार्यात्मक उद्देश्यों के लिए उपयोग की जाती हैं।",
      "p3": "वेबसाइट तीसरी पार्टी विश्लेषणात्मक या विपणन उपकरणों का उपयोग नहीं करती है।"
    },
    "section7": {
      "title": "धारा 7. डेटा प्राप्तकर्ता और डेटा का संचालन स्थान",
      "p1": "व्यक्तिगत डेटा उन सर्वरों पर संचालन किया जाता है जो यूरोपीय संघ के क्षेत्र में स्थित हैं।",
      "p2": "सर्वर इंफ्रास्ट्रक्चर Hetzner Online GmbH द्वारा बनाए रखा जाता है।",
      "p3": "प्रबंधक पुश सूचनाओं की सेवा में Firebase का उपयोग कर सकता है।",
      "p4": "प्रबंधक व्यक्तिगत डेटा को यूरोपीय संघ से बाहर तीसरे देशों में नहीं भेजता है।"
    },
    "section8": {
      "title": "धारा 8. डेटा का भंडारण काल",
      "p1": "व्यक्तिगत डेटा उपयोगकर्ता खाते के अस्तित्व के दौरान संग्रहीत रहता है।",
      "p2": "खाता हटाए जाने के बाद, डेटा को स्थायी रूप से हटा दिया जाता है या अनामित कर दिया जाता है, जब तक कि कानून की अन्य प्रावधानों के तहत कोई अन्य नियम न हो।"
    },
    "section9": {
      "title": "धारा 9. प्रभावित व्यक्तियों के अधिकार",
      "intro": "हर व्यक्ति, जिसका डेटा संचालित किया गया है, को निम्नलिखित अधिकार होते हैं:",
      "list": [
        "अपने डेटा तक पहुँचने का अधिकार",
        "डेटा में सुधार करने का अधिकार",
        "डेटा हटाने का अधिकार",
        "संचालन को सीमित करने का अधिकार",
        "विरोध करने का अधिकार",
        "किसी भी समय सहमति वापस लेने का अधिकार"
      ],
      "p2": "उपरोक्त अधिकारों को लागू करने के लिए, कृपया प्रबंधक से ईमेल के माध्यम से संपर्क करें: info@flovers.app।",
      "p3": "व्यक्तिगत डेटा से संबंधित व्यक्ति को डेटा सुरक्षा प्रमुख से शिकायत करने का भी अधिकार है।"
    },
    "section10": {
      "title": "धारा 10. अंतिम प्रावधान",
      "p1": "प्रबंधक व्यक्तिगत डेटा की सुरक्षा के लिए उपयुक्त तकनीकी और संगठनात्मक उपायों का पालन करता है।",
      "p2": "प्रबंधक इस गोपनीयता नीति को अद्यतन करने का अधिकार सुरक्षित रखता है।",
      "p3": "गोपनीयता नीति का वर्तमान संस्करण हमेशा Flovers की वेबसाइट और मोबाइल ऐप पर उपलब्ध होता है।"
    }
  }
}
