{
  "common": {
    "copy": "कॉपी करें",
    "copied": "कॉपी किया गया"
  },
  "title": "उपकरण योजनाएं और वायरिंग",
  "lead": "यह पृष्ठ यह वर्णन करता है कि IoT सेंसर से डेटा फ्लोवर्स में कैसे भेजें। यहाँ आपको एंडपॉइंट्स, पेलोड संरचना और लोकप्रिय सेंसरों के लिए ESP32/ESP8266 के लिए Arduino कोड का उदाहरण मिलेगा। यहाँ एक वायरिंग चित्र (Fritzing) का प्लेसहोल्डर भी है जिसे बाद में बदलना है।",
  "endpoints": {
    "title": "API एंडपॉइंट्स",
    "note": "यह एंडपॉइंट्स उदाहरण हैं। जब आप उपकरण को जोड़ते हैं, तो इन्हें उत्पादन बैकएंड पते से बदलें।",
    "ingest": {
      "label": "इनजेस्ट डेटा (POST)",
      "value": "http://127.0.0.1:8000/api/readings/ingest/"
    },
    "read": {
      "label": "पढ़ाई डेटा (GET/POST)",
      "value": "http://127.0.0.1:8000/api/readings/"
    }
  },
  "ingest": {
    "title": "POST इनजेस्ट दस्तावेज़",
    "desc": "एक पढ़ाई का उदाहरण JSON के रूप में भेजें। बैकएंड डिवाइस की कुंजी + सीक्रेट की जांच करता है और डिवाइस के तहत मेट्रिक्स सहेजता है।",
    "schemaLabel": "पेलोड संरचना (JSON)",
    "psLabel": "PowerShell उदाहरण (POST)"
  },
  "read": {
    "title": "GET / पढ़ाई दस्तावेज़",
    "desc": "समय सीमा में उपकरण के लिए डेटा पढ़ें। यदि बैकएंड POST के माध्यम से अनुरोधों का समर्थन करता है, तो आप URL में पैरामीटर के बजाय JSON बॉडी भेज सकते हैं।",
    "exampleLabel": "उदाहरण (GET + वैकल्पिक POST)"
  },
  "arduino": {
    "title": "Arduino (ESP32/ESP8266) — उदाहरण कोड",
    "desc": "संदर्भ कार्यान्वयन: Wi-Fi से जुड़ता है, सेंसर पढ़ता है और निर्धारित अंतराल में ingest एंडपॉइंट पर JSON POST भेजता है। सेंसर की नमी (गीला/सूखा) मानों को कैलिब्रेट करें ताकि प्रतिशत समझ में आए।",
    "codeLabel": "Arduino उदाहरण (Wi-Fi + POST ingest)",
    "note": "यदि आपको सही टाइमस्टैम्प्स चाहिए, तो NTP समय सिंक्रनाइज़ेशन (configTime) जोड़ें और उपकरण पर ISO-8601 UTC उत्पन्न करें।",
    "sensors": {
      "bh1750": "BH1750 (GY-302) — I2C के माध्यम से प्रकाश तीव्रता",
      "moisture": "क्षमता सेंसर मिट्टी की नमी — एनालॉग रीडिंग (गीला/सूखा कैलिब्रेशन आवश्यक)",
      "bme280": "BME280 — I2C के माध्यम से तापमान और नमी (वैकल्पिक दबाव)"
    }
  },
  "wiring": {
    "title": "वायरिंग योजना",
    "desc": "यहां बाद में Fritzing से चित्र जोड़ें। यह प्लेसहोल्डर पृष्ठ के लेआउट को स्थिर करता है जब तक कि योजना तैयार नहीं हो जाती।",
    "aria": "वायरिंग योजना का प्लेसहोल्डर",
    "placeholderTitle": "Fritzing प्लेसहोल्डर",
    "placeholderSub": "जब आप योजना को निर्यात करेंगे तो इस ब्लॉक को चित्र से बदलें।"
  }
}
