{
  "terms": {
    "title": "नियम और शर्तें",
    "lastUpdated": "अंतिम अपडेट: {{date}}",
    "section1": {
      "title": "§ 1. सामान्य प्रावधान",
      "p1": "यह नियम और शर्तें Flovers वेबसाइट और मोबाइल एप्लिकेशन (Android और भविष्य में iOS) के उपयोग के लिए शर्तें निर्धारित करती हैं, साथ ही सेवा प्रदाता द्वारा इलेक्ट्रॉनिक माध्यम से सेवाएं प्रदान करने की शर्तें।",
      "p2": "सेवा प्रदाता है मार्सिन जानोवस्की कॉपी पेस्ट IT समाधान, ul. płk. Francesco Nullo 30/115, 31-543 क्राकोव, पोलैंड, ईमेल: info@flovers.app (इसके बाद: \"सेवा प्रदाता\")।",
      "p3": "सेवा का उपयोग करते समय (जिसमें खाता पंजीकरण, लॉगिन, एप्लिकेशन या वेबसाइट की सुविधाओं का उपयोग शामिल है), उपयोगकर्ता इन नियमों और शर्तों को स्वीकार करता है और उनका पालन करने का वचन देता है।",
      "p4": "नियमों और शर्तों से अप्रभावित मामलों में, विशेष रूप से लागू होने वाले कानूनों में: इलेक्ट्रॉनिक सेवाएं प्रदान करने के कानून, सिविल कोड, उपभोक्ता अधिकारों का कानून और अन्य पोलिश और यूरोपीय संघ के कानूनों की संबंधित प्रावधानों का पालन किया जाएगा।"
    },
    "section2": {
      "title": "§ 2. परिभाषाएँ",
      "items": [
        "„सेवा” – सेवा प्रदाता द्वारा Flovers के तहत इलेक्ट्रॉनिक रूप से प्रदान की गई सेवाएं, जिसमें मोबाइल एप्लिकेशन, वेबसाइट और संबंधित बैकएंड बुनियादी ढांचा शामिल हैं।",
        "„एप्लिकेशन” – Flovers मोबाइल एप्लिकेशन जो मोबाइल उपकरणों (Android; भविष्य में iOS) पर उपलब्ध है।",
        "„वेबसाइट” – Flovers की वेबसाइट और संबंधित दस्तावेज़ और जानकारी।",
        "„उपयोगकर्ता” – सेवा का उपयोग करने वाला व्यक्ति; पंजीकरण के मामले में – वह व्यक्ति जिसने खाता बनाया है।",
        "„खाता” – सेवा प्रदाता के सिस्टम में उपयोगकर्ता की व्यक्तिगत प्रोफ़ाइल, जो पासवर्ड से सुरक्षित है।",
        "„उपकरण” – वह उपकरण जिसका उपयोग उपयोगकर्ता सेवा का उपयोग करने के लिए करता है (जैसे मोबाइल फोन, टैबलेट) और यदि लागू हो, तो माप उपकरण (जैसे Arduino) जो सेवा को डेटा भेजता है।",
        "„पौधे की परिभाषा” – सेवा प्रदाता द्वारा तैयार की गई पौधे की रिकॉर्ड/कार्ड, जिसमें विशेषताएँ, प्राथमिकताएँ और सिफारिशें (जैसे पानी देना, छिड़काव, उर्वरक) शामिल हैं, जो स्वचालित रूप से उत्पन्न किए गए तत्वों (जैसे एआई सामग्री) को भी शामिल कर सकते हैं।",
        "„पौधे का उदाहरण” – उपयोगकर्ता द्वारा खाते में परिभाषित किया गया पौधा (उसका व्यक्तिगत उदाहरण), जो पौधे की परिभाषा से जुड़ा हो सकता है।",
        "„माप डेटा” – सेंसर से डेटा (जैसे हवा का तापमान, आर्द्रता, मिट्टी की आर्द्रता, प्रकाश स्तर) जो पौधे के उदाहरण से जुड़ा होता है।",
        "„स्मरण” – एक नियमित कार्य की परिभाषा (जैसे पानी देना, छिड़काव, उर्वरक, स्थानांतरण, देखभाल), जिस पर आधारित कार्य बनाए जाते हैं।",
        "„कार्य” – एक कार्य सूची का तत्व जो स्मरण पर आधारित होता है; उपयोगकर्ता इसे पूरा के रूप में चिह्नित कर सकता है और नोट्स जोड़ सकता है।",
        "„उपयोगकर्ता सामग्री” – डेटा जो उपयोगकर्ता सेवा में दर्ज या बनाए रखता है (जैसे पौधों के उदाहरण, नोट्स, कार्यों का इतिहास, पौधे का जर्नल, उपकरणों के साथ संबंध, माप डेटा)।",
        "„पौधों की पहचान” – एक कार्य जो उपयोगकर्ता द्वारा दी गई छवि का विश्लेषण करता है और सेवा प्रदाता द्वारा पहचान परिणाम प्रदान करता है।",
        "„नियम और शर्तें” – यह Flovers सेवा के उपयोग की शर्तें।"
      ]
    },
    "section3": {
      "title": "§ 3. सेवा और कार्यात्मकता की सीमा",
      "intro": "सेवा में विशेष रूप से निम्नलिखित शामिल हो सकते हैं:",
      "list": [
        "खाते का पंजीकरण और प्रबंधन (लॉगिन, ईमेल पुष्टि, पासवर्ड रीसेट, सक्रियण लिंक फिर से भेजना)",
        "पौधों की परिभाषाओं का पुस्तकालय और संबंधित मार्गदर्शन",
        "पौधों के उदाहरण बनाने और जर्नल/इतिहास बनाए रखना (नोट्स, कार्यों का इतिहास)",
        "पौधों की देखभाल के लिए स्मरण और कार्य (जैसे पानी देना, छिड़काव, उर्वरक, स्थानांतरण)",
        "उपयोगकर्ता द्वारा दी गई छवि के आधार पर पौधों की पहचान",
        "माप उपकरणों के साथ एकीकरण और माप डेटा का संग्रहण और प्रस्तुति",
        "QR कोड और लिंक उत्पन्न करना और स्कैन करना जो उपयोगकर्ता संसाधनों (जैसे पौधे के उदाहरण) की ओर ले जाते हैं",
        "दस्तावेज़ और FAQ खंड"
      ],
      "p1": "सेवा वर्तमान में एक नि:शुल्क संस्करण (बीटा) के रूप में उपलब्ध है। सेवा प्रदाता भविष्य में भुगतान योजनाएं, नि:शुल्क योजना के लिए सीमाएं, विज्ञापन या सब्सक्रिप्शन प्रस्तुत कर सकता है – इसके बारे में उपयोगकर्ताओं को सेवा और/या वेबसाइट के माध्यम से सूचित किया जाएगा।",
      "p2": "सेवा प्रदाता सेवा की कार्यात्मकताओं, इंटरफेस और संचालन के तरीके को बदल सकता है, जिसमें सुविधाएं जोड़ना या हटाना, बशर्ते कि यह लागू कानूनों का उल्लंघन न करे।"
    },
    "section4": {
      "title": "§ 4. तकनीकी आवश्यकताएँ",
      "items": [
        "इंटरनेट कनेक्शन वाला उपकरण।",
        "वर्तमान वेब ब्राउज़र (वेबसाइट के लिए) या संगत Android प्रणाली (एप्लिकेशन के लिए)।",
        "सक्रिय ईमेल पता (खाता पंजीकरण और प्रबंधन के लिए)।",
        "ब्राउज़र में JavaScript और कुकीज़ की सहायता चालू होनी चाहिए (वेबसाइट के लिए), यदि यह सही ढंग से काम करने के लिए आवश्यक हो।"
      ]
    },
    "section5": {
      "title": "§ 5. खाता और सुरक्षा",
      "p1": "सेवा की अधिकांश सुविधाओं का उपयोग करने के लिए खाता बनाना आवश्यक है।",
      "p2": "उपयोगकर्ता को सही जानकारी देने और लॉगिन डेटा की गोपनीयता बनाए रखने का उत्तरदायित्व है।",
      "p3": "उपयोगकर्ता अपने खाते का उपयोग करके किए गए कार्यों के लिए जिम्मेदार है, सिवाय इसके कि वे सेवा प्रदाता की ओर से हुए हों।",
      "p4": "सेवा प्रदाता खाता या सेवा तक अस्थायी रूप से पहुंच को रोक सकता है अगर वह धोखाधड़ी, सुरक्षा उल्लंघन या नियमों का उल्लंघन पाता है।"
    },
    "section6": {
      "title": "§ 6. उपयोगकर्ता सामग्री और लाइसेंस",
      "p1": "उपयोगकर्ता अपनी सामग्री पर उस हद तक अधिकार बनाए रखता है, जैसा कि उसे कानून के तहत प्राप्त है।",
      "p2": "उपयोगकर्ता सेवा प्रदाता को एक गैर-विशेष, निःशुल्क, निरस्त करने योग्य (खाता या सामग्री हटाने के माध्यम से), सेवा प्रदान करने के लिए आवश्यक सीमा तक हस्तांतरित करने योग्य लाइसेंस प्रदान करता है, ताकि उपयोगकर्ता की सामग्री को संग्रहीत, स्थायी रूप से, पुनःप्राप्त, दिखाया और प्रोसेस किया जा सके।",
      "p3": "पौधों की पहचान के अंतर्गत उपयोगकर्ता सेवा प्रदाता को एक छवि भेज सकता है। सेवा प्रदाता यह घोषणा करता है कि पहचान प्रक्रिया को पूरा करने के लिए आवश्यक समय से अधिक समय तक चित्र संग्रहीत नहीं किया जाता है, जब तक कि उपयोगकर्ता स्पष्ट रूप से ऐसा करने के लिए कार्यक्षमता का उपयोग न करे।",
      "p4": "उपयोगकर्ता यह घोषणा करता है कि वह उस सामग्री के अधिकार रखता है जो वह सेवा में प्रदान करता है, और वह सामग्री तीसरे पक्ष के अधिकारों का उल्लंघन नहीं करती है।"
    },
    "section7": {
      "title": "§ 7. उपयोग के नियम और निषेध",
      "intro": "उपयोगकर्ता सेवा का उपयोग कानून, अच्छे शिष्टाचार और अन्य व्यक्तियों के अधिकारों का सम्मान करते हुए करने का वचन देता है। विशेष रूप से निषिद्ध है:",
      "list": [
        "प्रमाणीकरण, सुरक्षा या तकनीकी सीमाओं को पार करने के प्रयास करना",
        "एपीआई, एंडपॉइंट्स या एकीकरण तंत्र (जिसमें माप उपकरणों के साथ संबंध) का दुरुपयोग करना जो सेवा की कार्यप्रणाली को प्रभावित कर सकता है",
        "सेवा में अवैध, अपमानजनक, व्यक्तिगत अधिकारों का उल्लंघन करने वाली, या बौद्धिक संपदा अधिकारों का उल्लंघन करने वाली सामग्री दर्ज करना",
        "संपर्क या समर्थन सुविधाओं के माध्यम से स्पैम या प्रचार/मास प्रोमोशनल सामग्री भेजना",
        "दूसरे उपयोगकर्ताओं के डेटा तक अनधिकृत पहुंच प्राप्त करने के प्रयास"
      ],
      "p1": "सेवा प्रदाता उपरोक्त नियमों के उल्लंघन के मामलों में सेवा या खाते की पहुंच को सीमित कर सकता है।"
    },
    "section8": {
      "title": "§ 8. QR कोड, लिंक और \"गुप्त कुंजी\"",
      "p1": "सेवा QR कोड या लिंक (जैसे पौधे के उदाहरण तक लिंक) उत्पन्न करने की अनुमति दे सकती है। उपयोगकर्ता उनके भंडारण और साझाकरण के लिए जिम्मेदार है।",
      "p2": "यदि उपयोगकर्ता लिंक, पहचानकर्ता या एक्सेस कुंजी (जैसे माप डेटा के लिए) तीसरे पक्ष को प्रदान करता है, तो वे व्यक्तियाँ निर्धारित अनुमतियों के अनुसार निर्दिष्ट जानकारी तक पहुंच प्राप्त कर सकती हैं। उपयोगकर्ता को इस तरह के साझाकरण से जुड़े जोखिम का सामना करना पड़ता है।"
    },
    "section9": {
      "title": "§ 9. भुगतान और योजनाएँ (भविष्य में जानकारी)",
      "p1": "इस नियम और शर्तों के प्रकाशन के समय, सेवा बीटा मॉडल के तहत मुफ्त में उपलब्ध है।",
      "p2": "सेवा प्रदाता भविष्य में भुगतान योजनाएँ, आवर्ती सब्सक्रिप्शन, विज्ञापन या सीमाएँ (जैसे पौधों की संख्या) पेश कर सकता है। भुगतान योजनाएँ, जैसे Google Play या Apple App Store के माध्यम से, हो सकती हैं।",
      "p3": "यदि सब्सक्रिप्शन पेश किए जाते हैं, तो वे स्वचालित रूप से नवीनीकरण योग्य हो सकते हैं। भुगतान, बिलिंग और रिफंड की शर्तें स्टोर (Google/Apple) और सेवा में खरीदारी के समय प्रदान की गई जानकारी से संबंधित हो सकती हैं।"
    },
    "section10": {
      "title": "§ 10. जिम्मेदारी और अस्वीकरण",
      "p1": "सेवा सूचना और उपयोग का उद्देश्य है और पौधों की देखभाल में सहायता प्रदान करती है। सेवा प्रदाता निश्चित परिणामों की गारंटी नहीं देता (जैसे पौधों की वृद्धि, पौधों के रोगों से बचाव, देखभाल में गलतियों से बचाव)। पौधों की देखभाल पर निर्णय उपयोगकर्ता की जिम्मेदारी पर किए जाते हैं।",
      "p2": "सेवा प्रदाता सेवा को \"जैसा है\" (सर्वश्रेष्ठ प्रयास के अनुसार) प्रदान करता है। तकनीकी व्यवधान या उपलब्धता सीमाएँ हो सकती हैं जो रखरखाव, विकास या आपातकालीन घटनाओं से संबंधित हैं।",
      "p3": "सेवा प्रदाता किसी भी नुकसान के लिए जिम्मेदार नहीं है जो उत्पन्न होते हैं: सेवा के गलत उपयोग, उपयोगकर्ता द्वारा दर्ज किए गए गलत डेटा, उपयोगकर्ता के माप उपकरणों के दोषपूर्ण कार्य, इंटरनेट की उपलब्धता में व्यवधान या अन्य कारणों से जो सेवा प्रदाता के नियंत्रण से बाहर हैं, कानून के अनुसार अनुमेय सीमा तक।",
      "p4": "इस पैराग्राफ की शर्तें उपभोक्ताओं के कानूनी अधिकारों को सीमित या हटा नहीं सकती हैं।"
    },
    "section11": {
      "title": "§ 11. शिकायतें और संपर्क",
      "p1": "उपयोगकर्ता सेवा के संचालन के संबंध में शिकायतें इलेक्ट्रॉनिक रूप से info@flovers.app पर भेज सकता है।",
      "p2": "शिकायत में समस्या का विवरण, तिथि और घटनाओं के संदर्भ को शामिल किया जाना चाहिए और, यदि संभव हो, तो मामले की पहचान में मदद करने वाली जानकारी (जैसे स्क्रीनशॉट) संलग्न की जानी चाहिए।",
      "p3": "सेवा प्रदाता बिना किसी देरी के उत्तर देगा, और जहां तक संभव हो, 14 दिनों के भीतर उत्तर देगा।"
    },
    "section12": {
      "title": "§ 12. अनुबंध समाप्ति, खाता हटाना",
      "p1": "उपयोगकर्ता एप्लिकेशन के माध्यम से किसी भी समय खाता हटा सकता है, जिससे खाता और संबंधित डेटा सेवा प्रदाता के सिस्टम से स्थायी रूप से हट जाएंगे (बिना किसी \"गुप्त\" मोड के)।",
      "p2": "सेवा प्रदाता नियमों का उल्लंघन, अवैध गतिविधियों या सेवा की सुरक्षा को खतरे में डालने वाली गतिविधियों के मामले में उपयोगकर्ता के लिए सेवा को निलंबित या समाप्त कर सकता है।",
      "p3": "सेवा प्रदाता महत्वपूर्ण कारणों (जैसे तकनीकी, कानूनी कारण) के कारण सेवा का (पूरी या आंशिक) समाप्त कर सकता है, और उपयोगकर्ताओं को पूर्व सूचना देगा, जहां तक संभव हो।"
    },
    "section13": {
      "title": "§ 13. बौद्धिक संपदा",
      "p1": "सॉफ़्टवेयर, रूप, लोगो, नाम Flovers, दस्तावेज़ और सेवा प्रदाता द्वारा सेवा के तहत प्रदान की गई सामग्री कानूनी सुरक्षा, विशेष रूप से कॉपीराइट के अधीन है, और यह सेवा प्रदाता या अधिकार प्राप्त संस्थाओं की संपत्ति है।",
      "p2": "सेवा प्रदाता की अनुमति के बिना सेवा के तत्वों की नकल, संशोधन, वितरण या उपयोग करना निषिद्ध है, सिवाय इसके कि यह कानूनी रूप से अनुमत उपयोग हो।"
    },
    "section14": {
      "title": "§ 14. उपयोगकर्ता की आयु",
      "p1": "सेवा उन व्यक्तियों के लिए है जो 16 वर्ष या उससे अधिक हैं।",
      "p2": "यदि उपयोगकर्ता 16 वर्ष से कम है, तो उसे खाता स्थापित करने या सेवा का उपयोग करने से बचना चाहिए।"
    },
    "section15": {
      "title": "§ 15. संबंधित दस्तावेज़",
      "intro": "सेवा के साथ निम्नलिखित दस्तावेज़ और जानकारी संबंधित हैं:",
      "list": [
        "गोपनीयता नीति",
        "कुकी नीति",
        "दस्तावेज़ और FAQ"
      ]
    },
    "section16": {
      "title": "§ 16. लागू कानून और विवादों का समाधान",
      "p1": "यह नियम और शर्तें पोलिश कानून के अधीन हैं, बशर्ते उपभोक्ता संरक्षण के बिना उल्लंघन किए गए प्रावधानों की अनदेखी न की जाए।",
      "p2": "प्रारंभ में विवादों का समाधान मैत्रीपूर्ण रूप से किया जाना चाहिए (जैसे ईमेल संपर्क के माध्यम से और सहमति स्थापित करने की कोशिश करना)।",
      "p3": "उपभोक्ता विवादों के समाधान के वैकल्पिक तरीकों और ODR (ऑनलाइन विवाद समाधान) मंच का उपयोग कर सकते हैं जो इस पते पर उपलब्ध है: https://ec.europa.eu/consumers/odr/।",
      "p4": "उपभोक्ताओं के साथ विवादों में अदालत की अधिकारिता सामान्य लागू कानून के अनुसार निर्धारित की जाएगी।"
    },
    "section17": {
      "title": "§ 17. नियमों में परिवर्तन",
      "p1": "सेवा प्रदाता महत्वपूर्ण कारणों (जैसे कानूनी परिवर्तन, सेवा का विकास, तकनीकी परिवर्तन) के कारण नियमों में परिवर्तन कर सकता है।",
      "p2": "सेवा प्रदाता नियमों में परिवर्तन के बारे में वेबसाइट और/या एप्लिकेशन के माध्यम से उपयोगकर्ताओं को सूचित करेगा। सेवा के परिवर्तित नियमों को स्वीकार करने के लिए सेवा के उपयोग के साथ जारी रखना इसके अद्यतन नियमों को स्वीकार करने का संकेत है।"
    }
  }
}
