{
  "docs_reminders": {
    "title": "التذكيرات",
    "sections": [
      {
        "heading": "هدف هذه العرض",
        "body": [
          "عرض التذكيرات يُستخدم لإدارة جداول الصيانة الدورية للنباتات.",
          "التذكرة تحدد ما يجب أن يتم (نوع المهمة)، ومدى تكرارها (الفاصل الزمني)، وأي نبات مرتبط بها. بناءً على ذلك، يقوم فلوفرز بإنشاء المهام تلقائيًا في الوقت المحدد."
        ]
      },
      {
        "heading": "عرضان: قائمة التذكيرات والتقويم",
        "body": [
          "هذه الشاشة تحتوي على وضعين: قائمة التذكيرات وعرض التقويم.",
          "يمكنك التبديل بينهما عن طريق سحب الشاشة لليسار/اليمين أو اختيار تغيير العرض من قائمة FAB.",
          "يعرض كلا العرضين نفس البيانات، ولكن بطريقة مختلفة — حسب ما إذا كنت ترغب في مراجعة القواعد بسرعة أو عرض الجدول الزمني."
        ]
      },
      {
        "heading": "عرض قائمة التذكيرات",
        "body": [
          "في عرض القائمة، كل بلاطة تمثل تذكرة واحدة أنشأها المستخدم.",
          "تعرض البلاطة نوع المهمة (الأيقونة والاسم)، اسم النبات، الموقع (إذا كان مخصصًا)، معلومات التكرار وتاريخ التنفيذ التالي.",
          "هذه هي أسرع طريقة لمراجعة جميع القواعد الدورية النشطة في الحساب."
        ]
      },
      {
        "heading": "الإجراءات على بلاطة التذكرة (تعديل / حذف)",
        "body": [
          "كل تذكرة تحتوي على إجراءين: تعديل وحذف.",
          "التعديل يسمح بتغيير معلمات التذكرة مثل الفاصل الزمني، نوع المهمة، النبات المرتبط وإعدادات أخرى (اعتمادًا على نوع التذكرة).",
          "حذف التذكرة هو إجراء دائم ويؤدي إلى توقف إنشاء المهام بناءً على هذه القاعدة في المستقبل."
        ]
      },
      {
        "heading": "عرض التقويم",
        "body": [
          "في عرض التقويم، يتم عرض التذكيرات كأحداث مجدولة في أيام محددة.",
          "لعرض التفاصيل، انقر على اليوم في التقويم — ستظهر الأحداث المجدولة لهذا اليوم أسفل التقويم.",
          "يستخدم التقويم مؤشرات لونية/أيقونات للإشارة إلى أنواع المهام المجدولة لهذا اليوم ويساعد في تقييم توزيع المهام."
        ]
      },
      {
        "heading": "قائمة FAB",
        "body": [
          "زر FAB يوفر إجراءات سريعة متعلقة بالتذكيرات وتغيير العرض.",
          "الخيارات المتاحة هي: إضافة تذكرة، تغيير العرض (قائمة/تقويم)، ترتيب وتصنيف.",
          "يمكن الترتيب حسب الموعد النهائي (تاريخ الاستحقاق)، اسم النبات أو الموقع.",
          "يمكن الفلترة حسب: اسم النبات، الموقع، نوع المهمة ونطاق التواريخ (نطاق تاريخ الاستحقاق)."
        ]
      },
      {
        "heading": "كيف تنشئ التذكيرات المهام (المنطق العام)",
        "body": [
          "التذكرة هي قاعدة دورية (مثل سقي كل 7 أيام).",
          "بناءً على التذكيرات، يقوم فلوفرز بإنشاء المهام وعرضها على شاشة البداية كعناصر للقيام بها.",
          "بعد إغلاق المهمة، يتم جدولة المهمة التالية وفقًا للفاصل الزمني للتذكرة (مما يضمن استمرار الروتين تلقائيًا)."
        ]
      },
      {
        "heading": "ملاحظات ونصائح عملية",
        "body": [
          "التذكيرات تساعد في الحفاظ على الانتظام، لكنها لا تضمن صحة النباتات — قد تتطلب الظروف الفعلية تعديل الفواصل الزمنية.",
          "إذا تغيرت الظروف (فصل السنة، الضوء، التربة، حجم الوعاء)، يجب التفكير في تحديث التذكيرات.",
          "إذا كنت ترغب في إدارة المهام المغلقة والملاحظات، استخدم عرض سجل المهام (الموضح في مكان آخر)."
        ]
      }
    ]
  }
}
