{
  "docs_create_plant_wizard": {
    "title": "معالج إضافة النبات",
    "sections": [
      {
        "heading": "هدف هذه العملية",
        "body": [
          "معالج إضافة النبات هو عملية موجهة من 9 خطوات تهدف إلى إنشاء نسخة جديدة من النبات على حسابك.",
          "يساعد (اختياريًا) في ربط النبات بتعريف النبات من قاعدة بيانات Flovers، جمع السياق (الموقع، التعرض) ويمكنه أيضًا إنشاء تذكيرات استنادًا إلى تفضيلات العناية.",
          "المعالج مخصص فقط لإنشاء نبات جديد. تحرير نبات موجود يتم في عرض/عملية مختلفة."
        ]
      },
      {
        "heading": "الخطوة 01 — اختيار تعريف النبات (اختياري)",
        "body": [
          "يمكنك البحث عن تعريف النبات (الملف التعريفي المدمج للنوع) باستخدام حقل البحث.",
          "أسفل الحقل، يوجد قائمة بالنباتات المنزلية الشائعة التي تعمل كاختصار سريع.",
          "اختياريًا، يمكنك استخدام التعرف على النباتات: شغل المسح، التقط صورة أو اخترها من المعرض، وسيعرض النظام 3 نتائج متوافقة بشكل أكبر.",
          "إذا قمت بقبول الاقتراح، سيتم تطبيق تعريف النبات المحدد على النبات الذي يتم إنشاؤه."
        ]
      },
      {
        "heading": "الخطوة 02 — معاينة التعريف",
        "body": [
          "إذا تم اختيار تعريف النبات، ستعرض هذه الخطوة تفاصيله: الصورة والخصائص الأساسية والتفضيلات.",
          "هذه خطوة تحقق تتيح لك تأكيد الملف الصحيح قبل الانتقال إلى الخطوة التالية."
        ]
      },
      {
        "heading": "الخطوة 03 — اختيار الموقع (مطلوب)",
        "body": [
          "اختر الموقع الذي يوجد فيه النبات (مثل المطبخ، الصالون، الشرفة).",
          "في هذه المرحلة، يمكنك أيضًا إضافة موقع جديد.",
          "حالياً، يعتبر اختيار الموقع مطلوبًا للانتقال إلى الخطوات التالية."
        ]
      },
      {
        "heading": "الخطوة 04 — التعرض (القياسات الاختيارية)",
        "body": [
          "تتيح لك هذه الخطوة تسجيل سياق التعرض: الاتجاه، مستوى الضوء، والمسافة من النافذة.",
          "يمكن قياس الاتجاه باستخدام بوصلة الهاتف إذا كانت التطبيق لديه الأذونات المطلوبة للبوصلة/أجهزة الاستشعار.",
          "يمكن قياس مستوى الضوء إذا كان الجهاز يحتوي على جهاز استشعار مناسب وتم منح الأذونات المطلوبة.",
          "قيم التعرض اختيارية - يمكنك ملؤها يدويًا أو تخطيها."
        ]
      },
      {
        "heading": "الخطوة 05 — الوعاء والتربة (اختياري)",
        "body": [
          "حدد نوع الحاوية/الوعاء (مثل البلاستيك، السيراميك) ونوع التربة/الركيزة.",
          "هذه الحقول اختيارية ولكنها قد تساعد في تحسين التوافق مع الفترات الزمنية المقترحة عندما تكون المهام التلقائية مفعلّة."
        ]
      },
      {
        "heading": "الخطوة 06 — المهام التلقائية (اختياري، مع تعريف النبات)",
        "body": [
          "إذا كان النبات مرتبطًا بتعريف النبات، يمكن لـ Flovers إنشاء تذكيرات/مهام تلقائيًا بناءً على التفضيلات من القاعدة.",
          "حدد المربع الرئيسي لتفعيل التوليد التلقائي، ثم اختر أنواع المهام التي يجب إنشاؤها (مثل الري، الرش، التسميد، إعادة الزرع، العناية).",
          "الفترات الزمنية المقترحة تعتمد على تعريف النبات ويمكن تعديلها بناءً على التعرض والوعاء/التربة، إذا كانت هذه البيانات متوفرة.",
          "يمكنك تخطي هذه الخطوة وإنشاء التذكيرات يدويًا في وقت لاحق."
        ]
      },
      {
        "heading": "الخطوة 07 — إضافة صورة خاصة (اختياري)",
        "body": [
          "يمكنك إضافة صورة خاصة للنبات من هاتفك.",
          "هذه الخطوة اختيارية ويمكن تنفيذها لاحقًا بناءً على تدفقك في التطبيق."
        ]
      },
      {
        "heading": "الخطوة 08 — البيانات النهائية (الاسم مطلوب)",
        "body": [
          "حدد اسم العرض للنبات (مطلوب).",
          "اختياريًا، أضف ملاحظات وتاريخ الشراء.",
          "هذه المعلومات مرئية في تفاصيل النبات وتساعد في تتبع تاريخ العناية."
        ]
      },
      {
        "heading": "الخطوة 09 — الملخص والتأكيد",
        "body": [
          "بعد إضافة النبات بنجاح، يعرض المعالج شاشة التأكيد/الملخص.",
          "من هذه النقطة، يمكنك الانتقال إلى قائمة النباتات أو فتح النبات الذي تم إنشاؤه حديثًا — بناءً على التنقل في التطبيق."
        ]
      },
      {
        "heading": "ملاحظات وأذونات",
        "body": [
          "يتطلب التعرف على النباتات الوصول إلى الكاميرا و/أو المعرض، اعتمادًا على طريقة تقديم الصورة.",
          "قد تتطلب قياسات التعرض أذونات لأجهزة الاستشعار (مثل البوصلة) وتعتمد على توفر الأجهزة في الجهاز.",
          "الربط مع تعريف النبات اختياري — يمكنك تخطي هذه الخطوة ولا يزال بإمكانك إنشاء النبات وإضافة التذكيرات يدويًا."
        ]
      }
    ]
  }
}
