{
  "docs_home": {
    "title": "الرئيسية",
    "sections": [
      {
        "heading": "هدف عرض الرئيسية",
        "body": [
          "الرئيسية هي الشاشة الرئيسية التي تظهر بعد تسجيل الدخول بنجاح.",
          "تركز على الأنشطة اليومية: تعرض المهام التي تم إنشاؤها استنادًا إلى التذكيرات، مما يتيح لك رؤية بسرعة ما يتطلب اهتمامًا اليوم أو ما هو متأخر.",
          "إذا لم تكن هناك أي مهام يجب القيام بها، يتم عرض بلاط إعلامي برسالة تفيد بعدم وجود مهام مجدولة مع اقتراحات للخطوات التالية، مثل إنشاء تذكيرات."
        ]
      },
      {
        "heading": "قائمة المهام (البلاطات التي تم إنشاؤها من التذكيرات)",
        "body": [
          "كل بلاطة تمثل مهمة واحدة تم إنشاؤها استنادًا إلى تعريف التذكير (مثل الري، الرش، التسميد، الزراعة أو العناية).",
          "تظهر المهام تلقائيًا عندما تصبح مطلوبة وفقًا لقواعد التكرار المحددة في التذكير.",
          "عادةً ما تحتوي البلاطة على نوع المهمة، اسم النبات، الموقع وحالة الموعد (مثل اليوم أو المتأخر)."
        ]
      },
      {
        "heading": "قائمة بلاطة المهمة (إجراءات للمهمة الفردية)",
        "body": [
          "كل مهمة تحتوي على قائمة سياقية (قائمة من ثلاث نقاط) تحتوي على إجراءات تتعلق بالمهمة المحددة.",
          "تحديد كمكتملة: يغلق المهمة ويسمح بإضافة ملاحظة اختيارية، مما يساعد في بناء سجل العناية.",
          "تعديل التذكير: يفتح التذكير المرتبط بالمهمة لتغيير إعدادات التكرار.",
          "انتقل إلى النبات: ينقلك إلى عرض تفاصيل النبات المرتبط بالمهمة.",
          "عرض التاريخ: يفتح تاريخ المهام الذي يعرض المهام المنجزة سابقًا للنبات أو التذكير نفسه."
        ]
      },
      {
        "heading": "زر FAB (الإجراءات السريعة)",
        "body": [
          "على شاشة الرئيسية، يوجد زر FAB الذي يوسع مجموعة من الإجراءات السريعة للعمل مع المهام.",
          "عرض المتأخر: يطبق فلتر سريع لعرض المهام المتأخرة فقط.",
          "عرض اليوم: يطبق فلتر سريع لعرض المهام المجدولة لليوم.",
          "الفرز: يغير ترتيب عرض المهام في القائمة.",
          "التصفية: يضيق قائمة المهام وفقًا للمعايير المختارة.",
          "التاريخ: ينقلك إلى عرض تاريخ المهام، الذي يتم توثيقه بشكل منفصل."
        ]
      },
      {
        "heading": "خيارات الفرز",
        "body": [
          "الفرز يسمح بتعديل قائمة المهام لتناسب طريقة عملك.",
          "الخيارات المتاحة للفرز هي: تاريخ التنفيذ (الموعد النهائي)، اسم النبات والموقع."
        ]
      },
      {
        "heading": "خيارات التصفية",
        "body": [
          "تساعد الفلاتر على التركيز على مجموعة محددة من المهام.",
          "يمكن تصفية المهام وفقًا: لاسم النبات، الموقع، نوع المهمة أو نطاق تاريخ التنفيذ.",
          "يمكن دمج الفلاتر، على سبيل المثال، لعرض مهام الري للنباتات في موقع معين."
        ]
      },
      {
        "heading": "إغلاق المهام الجماعي (الجملة)",
        "body": [
          "إغلاق المهام الجماعي متاح عند استخدام العروض المختصرة: عرض المتأخر أو عرض اليوم.",
          "عندما يكون أحد هذه الفلاتر نشطًا، يعرض زر FAB مؤقتًا إجراء إضافيًا مثل \"تحديد المهام الظاهرة كمكتملة\".",
          "يغلق هذا الإجراء جميع المهام الظاهرة حاليًا دفعة واحدة، دون الحاجة إلى تحديد البلاطات يدويًا.",
          "تم تصميم الإغلاق الجماعي مع وضع في الاعتبار الحالات التي تقوم فيها بنفس الإجراء للعناية بعدة نباتات في وقت واحد.",
          "اعتمادًا على التدفق المختار، قد يكون من الممكن إضافة ملاحظات للمهام المغلقة بعد إجراء الإغلاق الجماعي."
        ]
      },
      {
        "heading": "التنقل من شاشة الرئيسية",
        "body": [
          "تتيح شاشة الرئيسية التنقل السريع إلى أجزاء أخرى من التطبيق من خلال الإجراءات على البلاطات والاختصارات FAB.",
          "من مستوى المهمة الفردية، يمكنك الانتقال مباشرة إلى تفاصيل النبات أو إلى تاريخ المهام.",
          "من مستوى FAB، يمكنك فتح تاريخ المهام أو تضييق قائمة المهام باستخدام الفرز والفلاتر."
        ]
      }
    ]
  }
}
