{
  "docs_plants": {
    "title": "النباتات",
    "sections": [
      {
        "heading": "هدف هذه العرض",
        "body": [
          "يعرض عرض النباتات جميع مثيلات النباتات التي تم إنشاؤها في حسابك.",
          "يمثل كل بلاطة نباتًا واحدًا (نسختك). يمكنك الانتقال من البلاطة إلى تفاصيل النبات أو استخدام الاختصارات في قائمة النقاط الثلاث (مثل التذكيرات، السجل، رمز الاستجابة السريعة)."
        ]
      },
      {
        "heading": "بلاطات النباتات (القائمة)",
        "body": [
          "تُظهر بلاطة النبات اسم النبات وأيضًا (إذا كان متاحًا) اسم التعريف المرتبط بالنبات (النوع) والموقع المعين.",
          "لمس محتوى البلاطة (ما عدا القائمة ذات النقاط الثلاث) ينقلك إلى عرض تفاصيل النبات."
        ]
      },
      {
        "heading": "قائمة النقاط الثلاث (إجراءات النبات)",
        "body": [
          "تحتوي كل بلاطة على قائمة من النقاط الثلاث تتضمن الإجراءات الخاصة بالنبات المحدد:",
          "تعديل النبات: يفتح تحرير البيانات والمعلمات الخاصة بالنبات.",
          "عرض التذكيرات: ينقلك إلى عرض التذكيرات مع الفلتر المُعد على التذكيرات المرتبطة بالنبات المحدد.",
          "عرض سجل النبات: يفتح نافذة منبثقة تحتوي على سجل المهام المكتملة (مع ملاحظات المستخدم). الملاحظات مرئية ولا تُخفى.",
          "عرض رمز الاستجابة السريعة: يفتح نافذة منبثقة تحتوي على رمز الاستجابة السريعة للنبات، مع وصف مختصر وخيارات لحفظ (تنزيل) أو إرسال الرمز إلى بريدك الإلكتروني.",
          "حذف النبات: يحذف النبات بشكل دائم مع البيانات المرتبطة مثل المهام، التذكيرات والروابط مع الأجهزة."
        ]
      },
      {
        "heading": "قائمة زر FAB",
        "body": [
          "يوفر زر FAB في عرض النباتات إجراءات سريعة:",
          "إنشاء نبات: يبدأ معالج إنشاء النبات (عملية من 9 خطوات) حيث يمكنك تحديد النبات بدقة.",
          "فرز: يقوم بفرز بلاطات النباتات حسب اسم النبات أو الموقع.",
          "تصفية: يقوم بتصفية القائمة حسب الموقع.",
          "المواقع: ينقلك إلى عرض المواقع حيث يمكنك إضافة وتحرير وإدارة المواقع التي تُستخدم للتجميع والتصفية."
        ]
      },
      {
        "heading": "حذف النبات (معلومات هامة)",
        "body": [
          "حذف النبات هو عملية دائمة ولا يمكن التراجع عنها.",
          "حذف النبات يحذف مثيل النبات والبيانات المرتبطة مثل المهام المُنشأة، التذكيرات المعينة لهذا النبات والروابط مع الأجهزة."
        ]
      },
      {
        "heading": "عندما لا يظهر أي نباتات",
        "body": [
          "إذا كانت القائمة فارغة، استخدم إجراء إنشاء نبات من قائمة FAB لإضافة أول مثيل نبات.",
          "بعد إضافة النباتات، يمكنك تجميعها باستخدام المواقع وإدارة روتينات العناية من خلال التذكيرات."
        ]
      }
    ]
  }
}
