{
  "docs_overview": {
    "title": "نظرة عامة",
    "sections": [
      {
        "heading": "ما هو Flovers؟",
        "body": [
          "Flovers هو مساعد للعناية بالنباتات يساعد في تنظيم الأنشطة اليومية، تتبع تاريخ العناية، ومراقبة القراءات من أجهزتك الخاصة باستخدام إنترنت الأشياء.",
          "تجمع التطبيق بين التذكيرات والمهام مع ملفات تعريف النباتات (نباتاتك) وتعريفات النباتات (الملفات التعريفية المدمجة مع التوصيات).",
          "يدعم Flovers قراراتك، لكنه لا يستبدلها—تعتمد نتائج العناية على الظروف وطريقة تطبيق الإرشادات.",
          "الخدمة تشمل التطبيق المحمول (أندرويد؛ وفي المستقبل iOS)، API للخلفية، بالإضافة إلى موقع ويب مع الوثائق والمعلومات القانونية."
        ]
      },
      {
        "heading": "المفاهيم الأساسية (كيف تعمل بنية التطبيق)",
        "body": [
          "تعريف النبات: الملف التعريفي المدمج للنوع الذي يحتوي على خصائص عامة وتوصيات (الضوء، الري/الرش، التسميد، إلخ).",
          "نسخة النبات: نبتتك الخاصة (نسختك)، مرتبطة اختياريًا مع تعريف النبات للحصول على إرشادات افتراضية أفضل.",
          "تذكير: قاعدة دورية (مثلاً، الري كل X يوم)، يتم بناءً عليها إنشاء المهام تلقائيًا.",
          "مهمة: نشاط معين تم إنشاؤه من التذكير؛ يمكنك وسمه على أنه مكتمل وإضافة ملاحظة، مما يبني تاريخ العناية."
        ]
      },
      {
        "heading": "أهم الوظائف باختصار",
        "body": [
          "حساب المستخدم: التسجيل، تسجيل الدخول، تأكيد البريد الإلكتروني، إعادة تعيين كلمة المرور، وإدارة إعدادات الملف الشخصي.",
          "إدارة النباتات: إضافة النباتات، التجميع حسب المواقع، الملاحظات، ومعاينة تاريخ الأنشطة.",
          "التذكيرات والمهام: إنشاء روتين دوري (الري، الرش، التسميد، الزرع، العناية) وتنفيذه.",
          "قراءات إنترنت الأشياء: ربط الأجهزة الخاصة بك وتخزين البيانات مثل درجة الحرارة، رطوبة الهواء، رطوبة التربة، وشدة الضوء."
        ]
      },
      {
        "heading": "التعرف على النباتات (من خلال الصورة)",
        "body": [
          "يتيح Flovers التعرف على النباتات من الصورة لتسهيل مطابقة تعريف النبات وبدء إعدادات افتراضية أفضل.",
          "يتم التعرف على الصورة من قبل الخادم باستخدام نظام التعلم الآلي الخاص بالمزود، المدرب على أكثر من 700 نوع.",
          "تُستخدم الصور المرسلة للتعرف فقط لتنفيذ عملية التعرف ولا يتم تخزينها بشكل دائم.",
          "النتائج تعتمد على جودة الصورة، الإضاءة، وضوح الصورة، وضوح النبات والتشابه مع الأنواع الأخرى."
        ]
      },
      {
        "heading": "أجهزة إنترنت الأشياء وبيانات المستشعرات",
        "body": [
          "يدعم Flovers الأجهزة الخاصة أو الخارجية (مثل Arduino) التي ترسل قراءات مرتبطة بحسابك.",
          "القراءات المدعومة: درجة حرارة الهواء، رطوبة الهواء، رطوبة التربة، ومستوى الضوء.",
          "يتم تخزين القراءات في الخلفية ويتم عرضها في التطبيق كقيم حالية وتاريخ (ملخصات يومية/أسبوعية/شهرية).",
          "أنت تتحكم في التوصيل والاستخدام—الاستقرار والمعايرة وتركيب الأجهزة تبقى على مسؤوليتك."
        ]
      },
      {
        "heading": "رموز الاستجابة السريعة والوصول السريع",
        "body": [
          "يمكنك إنشاء رموز استجابة سريعة تحتوي على رابط إلى نسخة النبات في حسابك.",
          "السيناريو المعتاد هو طباعة ولصق الرمز على الوعاء، ثم مسحه ضوئيًا للانتقال السريع إلى تفاصيل النبات.",
          "تُستخدم رموز الاستجابة السريعة للراحة؛ تعامل معها كمؤشرات وصول ولا تشاركها علنًا إذا كانت قد تكشف البيانات الوصفية.",
          "حاليًا، تفاصيل النبات مخصصة للاطلاع عليها من قبل صاحب الحساب المسجل فقط."
        ]
      },
      {
        "heading": "الإشعارات والتذكيرات",
        "body": [
          "يمكن لـ Flovers إرسال إشعارات دفع (من خلال Firebase) بشأن المهام لهذا اليوم أو المهام المتأخرة—حسب الإعدادات.",
          "يمكنك العثور على إعدادات الإشعارات في الملف الشخصي؛ حتى بعد إيقاف الإشعارات، تبقى التذكيرات والمهام في التطبيق.",
          "تُستخدم رسائل البريد الإلكتروني حاليًا بشكل رئيسي لأنشطة الحساب (تنشيط الحساب وإعادة تعيين كلمة المرور).",
          "الإشعارات هي دعم فقط—لا يضمن Flovers صحة النباتات أو أن التذكيرات ستمنع الخسائر."
        ]
      },
      {
        "heading": "الخصوصية والأمان وبياناتك",
        "body": [
          "يحتفظ Flovers ببيانات الحساب والبيانات اللازمة لتقديم الخدمة (النباتات، التذكيرات، المهام، الملاحظات، والقراءات).",
          "يتم تخزين كلمات المرور بشكل مشفر؛ يتطلب تنشيط الحساب التحقق من البريد الإلكتروني.",
          "يفترض أن تتم معالجة البيانات في الاتحاد الأوروبي؛ من المقرر استضافة الخدمة على Hetzner (الاتحاد الأوروبي)، والإشعارات تتم عبر Firebase.",
          "التفاصيل متوفرة في سياسة الخصوصية والشروط المتاحة على الموقع الإلكتروني وفي التطبيق."
        ]
      },
      {
        "heading": "القيود والتحذيرات الهامة",
        "body": [
          "Flovers هو أداة للتخطيط والمراقبة؛ ليس نظامًا استشاريًا احترافيًا ولا يحل محل المعرفة البستانية.",
          "قد تكون قراءات المستشعرات غير دقيقة (المعايرة، التركيب، الظروف)؛ تحقق منها بنفسك في الحالات المهمة.",
          "التوصيات للعناية هي عامة وقد لا تتناسب مع ظروفك (التربة، الوعاء، الضوء، الرطوبة، الموسم).",
          "إذا بدا شيء غير صحيح، اتبع تقييمك الخاص—قم بتعديل الروتين واستخدم مصادر موثوقة."
        ]
      },
      {
        "heading": "ماذا بعد؟",
        "body": [
          "إذا كنت تبدأ، انتقل إلى تسجيل الدخول والتسجيل، ثم أنشئ أول نسخة نبات في معالج إنشاء النباتات.",
          "ثم قم بإعداد التذكيرات وتنفيذ المهام للحفاظ على الروتين وبناء تاريخ العناية.",
          "إذا كان لديك جهاز، افتح القراءات، وقم بإعداده واستخدم تاريخ القراءات لمتابعة الاتجاهات.",
          "استخدم الأسئلة المتكررة للحصول على إجابات سريعة، وراجع الوثائق (الشروط/سياسة الخصوصية) لأمور رسمية."
        ]
      }
    ]
  }
}
