{
  "docs_plant_details": {
    "title": "تفاصيل النبات",
    "sections": [
      {
        "heading": "غرض هذه العرض",
        "body": [
          "عرض تفاصيل النبات هو المكان المركزي لعرض وإدارة نبات فردي تم إنشاؤه من قبل المستخدم.",
          "يجمع بين معلومات النبات، التذكيرات المعينة، المهام، قراءات المستشعرات (إذا كانت متوفرة) والإجراءات السريعة المتعلقة بالنبات."
        ]
      },
      {
        "heading": "معلومات عن النبات",
        "body": [
          "في الجزء العلوي من الشاشة يتم عرض صورة النبات، اسمه، اسم تعريف النبات الاختياري والموقع المعين.",
          "في الأسفل يتم عرض المعلمات التفصيلية المقدمة أثناء إنشاء النبات، مثل تاريخ الشراء، الملاحظات، ظروف الإضاءة، التوجيه، المسافة من النافذة، نوع الوعاء ونوع التربة.",
          "تساعد هذه المعلومات في تفسير التذكيرات، القراءات والقرارات المتعلقة بالعناية."
        ]
      },
      {
        "heading": "الإجراءات على مستوى النبات (قائمة النقاط الثلاث)",
        "body": [
          "توفر قائمة النقاط الثلاث المرتبطة بعنوان النبات إجراءات إضافية تتعلق بالنبات نفسه.",
          "تشمل الخيارات المتاحة عرض تعريف النبات (إذا كان مرتبطًا به)، تعديل بيانات النبات، تغيير الصورة والانتقال إلى التذكيرات المفلترة لهذا النبات.",
          "تتيح تغيير الصورة استبدال الصورة الافتراضية، إضافة صورة شخصية من الهاتف أو إزالة الصورة."
        ]
      },
      {
        "heading": "تعريف النبات",
        "body": [
          "إذا كان النبات مرتبطًا بتعريف نبات من قاعدة بيانات Flovers، يمكن للمستخدم فتح العرض المخصص للتعريف.",
          "يعرض هذا العرض معلومات الأنواع مثل وصف النبات، تفضيلات العناية، الخصائص، مستوى الصعوبة، نطاق درجات الحرارة، الرطوبة، السمية وطبيعة النمو.",
          "تقدم تعريفات النباتات إرشادات عامة ويجب تفسيرها في سياق الظروف الفعلية للمستخدم."
        ]
      },
      {
        "heading": "التذكيرات والمهام",
        "body": [
          "يعرض قسم التذكيرات جميع التذكيرات النشطة المخصصة للنبات المعين.",
          "كل تذكير يحتوي على قائمة نقاط ثلاثية خاصة به تسمح بإغلاق المهمة، تعديل التذكير أو عرض تاريخ المهام.",
          "أثناء إغلاق المهمة، يمكن للمستخدم إضافة ملاحظة تصبح جزءًا من سجل العناية بالنبات."
        ]
      },
      {
        "heading": "أحدث القراءات",
        "body": [
          "إذا كان النبات مرتبطًا بجهاز قياس، يتم عرض أحدث القراءات من المستشعرات في هذا العرض.",
          "القراءات المدعومة تشمل درجة حرارة الهواء، رطوبة الهواء، مستوى الضوء ورطوبة التربة.",
          "يعرض القسم القيم الأخيرة مع معلومات عن وقت القياس.",
          "لمس البلاطة التي تحتوي على القراءات ينقل المستخدم إلى عرض تاريخ القراءات، حيث يتم عرض الرسوم البيانية التفصيلية والملخصات (يوميًا/أسبوعيًا/شهريًا) لدرجة الحرارة، الرطوبة، الضوء ورطوبة التربة (إذا كان الجهاز مرتبطًا بالنبات)."
        ]
      },
      {
        "heading": "رمز الاستجابة السريعة والوصول السريع",
        "body": [
          "كل نبات يحتوي على رمز QR فريد يعرض في أسفل الشاشة.",
          "مسح هذا الرمز في عرض الماسح يوجه مباشرة إلى عرض تفاصيل النبات.",
          "يمكن حفظ رمز QR على الجهاز أو إرساله عبر البريد الإلكتروني، مما يتيح طباعة الرمز ووضعه على الوعاء."
        ]
      },
      {
        "heading": "معلومات هامة",
        "body": [
          "الصور التي يضيفها المستخدم محفوظة فقط على جهاز المستخدم وليست مخزنة في الخادم الخلفي لـ Flovers.",
          "الصور الافتراضية للنباتات تأتي من الخادم الخلفي لـ Flovers وقد يتم إنشاؤها باستخدام الذكاء الاصطناعي.",
          "القراءات من المستشعرات والإجراءات المقترحة هي للغرض الإعلامي ويجب دمجها مع التقييم الشخصي للمستخدم."
        ]
      }
    ]
  }
}
