{
  "docs_task_history": {
    "title": "تاريخ المهام",
    "sections": [
      {
        "heading": "هدف عرض تاريخ المهام",
        "body": [
          "يُستخدم تاريخ المهام لمراجعة وإدارة المهام التي تم إتمامها (مغلقة).",
          "يسهل تحليل ما تم إنجازه، ومتى تم تنفيذه، والنباتات التي تأثرت بالإجراءات.",
          "يمكن فتح العرض مع مرشح نشط (على سبيل المثال، تاريخ لنبات معين) أو عرض جميع المهام المغلقة."
        ]
      },
      {
        "heading": "بلاطات المهام المغلقة",
        "body": [
          "تمثل كل بلاطة مهمة مغلقة واحدة وتتضمن نوع المهمة (مثل: سقي، رش، تسميد)، اسم النبات، الموقع، وتاريخ التنفيذ.",
          "قد تحتوي المهام المغلقة على ملاحظة تم إضافتها عند تعيين المهمة على أنها مكتملة.",
          "الملاحظات تظهر فقط بعد توسيع البلاطة."
        ]
      },
      {
        "heading": "معاينة الملاحظات: التوسيع والانكماش",
        "body": [
          "لمشاهدة الملاحظة الخاصة بمهمة مغلقة، يمكنك توسيع البلاطة بالضغط عليها.",
          "يمكنك أيضًا استخدام القائمة ذات الثلاث نقاط لتنفيذ إجراء التوسيع/الانكماش (بناءً على الحالة الحالية).",
          "بذلك يمكن أن تظل القائمة قابلة للقراءة ومضغوطة، مع توفر التفاصيل عند الطلب."
        ]
      },
      {
        "heading": "قائمة البلاطة (ثلاث نقاط)",
        "body": [
          "كل بلاطة لمهمة مغلقة تحتوي على قائمة سياقية تحتوي على إجراءات خاصة بتلك السجل المحدد في التاريخ.",
          "توسيع/انكماش: يظهر أو يخفي قسم الملاحظات داخل البلاطة.",
          "تحرير التذكير: ينقل إلى التذكير المرتبط بالمهمة لتعديل إعدادات التكرار أو المعلمات الأخرى.",
          "الانتقال إلى النبات: ينقل إلى عرض تفاصيل النبات المرتبط بالمهمة.",
          "حذف المهمة: يحذف المهمة المغلقة المحددة بشكل دائم من حساب المستخدم."
        ]
      },
      {
        "heading": "إجراءات FAB (زر الإجراء العائم)",
        "body": [
          "يحتوي عرض تاريخ المهام على زر FAB مع إجراءات للعمل على كامل القائمة.",
          "فرز: يغير ترتيب عرض المهام المغلقة.",
          "تصفية: يضيق قائمة التاريخ وفقًا للمعايير المحددة.",
          "حذف: يتيح الحذف الجماعي للمهام استنادًا إلى المعايير (مثلًا، مهام نبات معين، لموقع معين، لنوع معين من المهام، أو المهام الأقدم من تاريخ معين)."
        ]
      },
      {
        "heading": "خيارات الفرز",
        "body": [
          "يساعد الفرز في تصفح التاريخ بالترتيب الذي يناسب أسلوب عملك.",
          "الخيارات المتاحة للفرز هي: تاريخ التنفيذ، اسم النبات، والموقع."
        ]
      },
      {
        "heading": "خيارات التصفية",
        "body": [
          "تسمح الفلاتر بالتركيز على مجموعة مختارة من المهام المغلقة.",
          "يمكنك التصفية حسب: اسم النبات، الموقع، نوع المهمة، وفترة تاريخ التنفيذ.",
          "يمكن دمج الفلاتر، على سبيل المثال لعرض التسميد الذي تم في موقع معين في شهر مختار."
        ]
      },
      {
        "heading": "الحذف الجماعي (إجراء الحذف)",
        "body": [
          "يتيح الحذف الجماعي إزالة العديد من المهام المغلقة بشكل دائم استنادًا إلى المعايير المحددة.",
          "السيناريوهات الشائعة هي: مسح تاريخ نبات واحد، حذف المهام لموقع معين، حذف نوع واحد فقط من المهام أو حذف المهام الأقدم من تاريخ معين.",
          "الحذف الجماعي دائم ولا يمكن التراجع عنه."
        ]
      },
      {
        "heading": "الفروقات بين تاريخ المهام والصفحة الرئيسية",
        "body": [
          "تركز الصفحة الرئيسية على المهام الحالية (لليوم والمتأخرة) وأداء تلك المهام.",
          "يتركز تاريخ المهام على المهام التي تم إتمامها ويدعم مراجعتها، ترتيبها، تصفيتها وحذف السجلات التاريخية.",
          "معًا، يسمح هذان العرضان بأداء الأنشطة اليومية (الصفحة الرئيسية) وتحليل تاريخ العناية على المدى الطويل (تاريخ المهام)."
        ]
      }
    ]
  }
}
