{
  "docs_readings": {
    "title": "القراءات",
    "sections": [
      {
        "heading": "هدف هذه العرض",
        "body": [
          "عرض القراءات يتيح لك استعراض وإدارة الأجهزة المتصلة بالنباتات.",
          "كل جهاز يمكنه إرسال قياسات مثل درجة حرارة الهواء، ورطوبة الهواء، ومستوى الضوء، ورطوبة التربة إلى فلورز.",
          "هذه الوظيفة مخصصة للمستخدمين الذين يبنون أجهزتهم الخاصة (مثل Arduino أو ESP) لمراقبة ظروف النباتات."
        ]
      },
      {
        "heading": "بلاط الأجهزة وآخر القراءات",
        "body": [
          "يتم عرض قائمة من البلاط على الشاشة حيث يمثل كل بلاط جهازًا واحدًا مرتبطًا.",
          "يعرض كل بلاط اسم النبات، والموقع، وآخر القراءات من المستشعرات.",
          "إذا لم يتم استلام البيانات بعد، يتم عرض رموز بديلة بدلاً من القيم."
        ]
      },
      {
        "heading": "التفاعلات مع البلاط",
        "body": [
          "النقر على منطقة البلاط ينقل المستخدم مباشرة إلى عرض تاريخ القراءات للجهاز المحدد.",
          "النقر على أيقونة المعامل المحدد (مثل الرطوبة أو درجة الحرارة) يفتح تاريخ القراءات مع هذا المعامل المحدد.",
          "يسمح ذلك بالوصول السريع إلى الرسوم البيانية التفصيلية."
        ]
      },
      {
        "heading": "إجراءات الجهاز (قائمة النقاط الثلاث)",
        "body": [
          "كل بلاط جهاز يحتوي على قائمة النقاط الثلاث مع إجراءات إضافية.",
          "الخيارات المتاحة هي: تاريخ القراءات، تفاصيل النبات، تحرير الجهاز، وحذف الجهاز.",
          "حذف الجهاز دائم ويزيل ارتباطه بالنبات."
        ]
      },
      {
        "heading": "تاريخ القراءات",
        "body": [
          "عرض تاريخ القراءات يعرض الرسوم البيانية التفصيلية للبيانات التي تم جمعها.",
          "يمكن عرض البيانات بتنسيقات يومية، أسبوعية، وشهرية.",
          "الرسوم البيانية متاحة لدرجة حرارة الهواء، ورطوبة الهواء، ومستوى الضوء، ورطوبة التربة (حسب الجهاز)."
        ]
      },
      {
        "heading": "قائمة FAB",
        "body": [
          "زر FAB يوفر إجراءات لإدارة الأجهزة.",
          "الخيارات المتاحة هي: ربط الجهاز، تكوين الجهاز، ترتيب، وتصفية.",
          "يمكن ترتيب الأجهزة حسب اسم النبات، الموقع، أو وقت آخر قراءة.",
          "تصفية البيانات تشمل اسم النبات، الموقع، وحالة الجهاز (نشط، غير نشط)."
        ]
      },
      {
        "heading": "ربط الجهاز",
        "body": [
          "خيار ربط الجهاز يستخدم لإضافة جهاز قياس جديد وربطه بالنبات.",
          "أثناء التكوين، يتم اختيار المعلمات التي تظهر على البلاط، بالإضافة إلى التنبيهات الاختيارية (مثل انخفاض مستوى رطوبة التربة).",
          "كل جهاز يحصل على معرّف فريد للجهاز ومفتاح سري للجهاز."
        ]
      },
      {
        "heading": "تفويض الجهاز وتدفق البيانات",
        "body": [
          "الأجهزة تفوض باستخدام معرّف الجهاز والمفتاح السري.",
          "لا يتطلب الأمر تفويض المستخدم لتسجيل القراءات — الوصول مقيد فقط بواسطة بيانات الجهاز.",
          "يُبسط هذا النهج التكامل والتواصل في IoT."
        ]
      },
      {
        "heading": "تكوين الجهاز والوثائق",
        "body": [
          "خيار تكوين الجهاز يوفر تعليمات فنية بشأن تكامل الأجهزة.",
          "يتضمن معلومات حول نقاط النهاية لـ API (POST لإرسال القراءات، GET لاسترجاعها)، وأمثلة على البيانات و الإعدادات.",
          "يمكن للمستخدم تحميل الوثائق الكاملة، بما في ذلك الكود النموذجي، والرسوم التخطيطية للاتصال (Fritzing)، والمستشعرات الموصى بها."
        ]
      },
      {
        "heading": "معلومات هامة",
        "body": [
          "استقرار الجهاز، ومعايرة المستشعرات، والتركيب الفعلي تقع على عاتق المستخدم.",
          "القراءات من المستشعرات هي للاستعلام فقط ويجب تفسيرها جنبًا إلى جنب مع مراقبة النباتات.",
          "فلورز لا تضمن دقة البيانات المستخلصة من الأجهزة الخارجية أو التي تم إنشاؤها بنفسها."
        ]
      }
    ]
  }
}
