{
  "docs_auth": {
    "title": "تسجيل الدخول والتسجيل",
    "sections": [
      {
        "heading": "إنشاء حساب جديد (التسجيل)",
        "body": [
          "للاستفادة من Flovers، يجب إنشاء حساب مستخدم فردي. يتم التسجيل مباشرة في التطبيق المحمول.",
          "خلال التسجيل، يتطلب فقط عنوان البريد الإلكتروني وكلمة المرور. في هذه المرحلة، لا تُطلب أي بيانات شخصية إضافية.",
          "يجب أن تتكون كلمة المرور من 8 أحرف على الأقل ويجب أن تحتوي على رقم واحد على الأقل ورمز خاص واحد لضمان مستوى أمني أساسي.",
          "قبل إتمام التسجيل، يجب على المستخدم قبول الشروط والأحكام وسياسة الخصوصية."
        ]
      },
      {
        "heading": "تفعيل الحساب عبر البريد الإلكتروني",
        "body": [
          "بعد إرسال نموذج التسجيل إلى عنوان البريد الإلكتروني المحدد، يتم إرسال رسالة تفعيل.",
          "لتفعيل الحساب، يجب النقر على الرابط التأكيدي الموجود في الرسالة المستلمة.",
          "حتى يتم تفعيل الحساب، لا يمكن تسجيل الدخول إلى التطبيق."
        ]
      },
      {
        "heading": "إعادة إرسال البريد الإلكتروني للتفعيل",
        "body": [
          "إذا لم تصل رسالة التفعيل، يمكن للمستخدم طلب إعادة إرسالها من خلال التطبيق.",
          "تكون هذه الخيارات متاحة على شاشة تسجيل الدخول أو التسجيل ويمكن استخدامها إذا كانت الرسالة مفقودة أو متأخرة أو تم إرسالها إلى البريد العشوائي.",
          "قبل إعادة الإرسال، من الأفضل التحقق من مجلد البريد العشوائي أو الفلاتر الأخرى للبريد."
        ]
      },
      {
        "heading": "تسجيل الدخول إلى حساب موجود",
        "body": [
          "لتسجيل الدخول، يلزم فقط عنوان البريد الإلكتروني وكلمة المرور المرتبطة بالحساب.",
          "إذا لم يتم تفعيل الحساب بعد، سيقوم التطبيق بإعلامك بضرورة تأكيد عنوان البريد الإلكتروني.",
          "يتم التحقق من بيانات الدخول بأمان من خلال الخادم; لا يتم تخزين كلمات المرور بصيغة نصية."
        ]
      },
      {
        "heading": "إعادة تعيين كلمة المرور المنسية",
        "body": [
          "إذا لم يتمكن المستخدم من تسجيل الدخول بسبب نسيان كلمة المرور، يمكنه طلب إرسال بريد إلكتروني لإعادة تعيين كلمة المرور.",
          "تحتوي الرسالة على تعليمات ورابط آمن يسمح بتعيين كلمة مرور جديدة.",
          "بعد تعيين كلمة المرور الجديدة، يمكن تسجيل الدخول إلى التطبيق على الفور."
        ]
      },
      {
        "heading": "ملاحظات بشأن الأمان",
        "body": [
          "كل حساب مستخدم محمي بكلمة مرور فردية تم تعيينها أثناء التسجيل.",
          "لأسباب أمنية، يجب عدم مشاركة بيانات الدخول مع أطراف ثالثة.",
          "في حالة الشك في وجود وصول غير مصرح به إلى الحساب، يُوصى بتغيير كلمة المرور فورًا."
        ]
      }
    ]
  }
}
