{
  "docs_scanner": {
    "title": "ماسح QR",
    "sections": [
      {
        "heading": "ما هو استخدام الماسح",
        "body": [
          "عرض الماسح يتيح لك مسح أكواد QR التي تم إنشاؤها مسبقًا للنباتات في Flovers.",
          "السيناريو الأكثر شيوعًا هو طباعة رمز QR ووضعه على الأصيص لفتح النبات المعين لاحقًا بسرعة في التطبيق.",
          "يتم استخدام مسح QR بشكل أساسي للتنقل السهل والسريع — دون الحاجة إلى البحث يدويًا في القائمة."
        ]
      },
      {
        "heading": "الوصول المطلوب إلى الكاميرا",
        "body": [
          "لاستخدام وظيفة الماسح QR، يتطلب تطبيق Flovers إذنًا للوصول إلى الكاميرا في الهاتف.",
          "يتم استخدام الكاميرا فقط لمسح أكواد QR في الوقت الفعلي ولا تستخدم لتسجيل الفيديو أو التقاط الصور خارج هذه العملية.",
          "إذا تم رفض الوصول إلى الكاميرا، فلن تعمل وظيفة الماسح حتى يتم منح الأذونات المناسبة في إعدادات الجهاز."
        ]
      },
      {
        "heading": "ماذا يحتوي رمز QR في Flovers",
        "body": [
          "رمز QR في Flovers يحتوي على مرجع إلى Flovers ومعرف (ID) لنسخة معينة من النبات في حساب المستخدم.",
          "بعد مسح الرمز بنجاح، يتعرف التطبيق عليه ويوجه المستخدم إلى النبات المحدد.",
          "أكواد QR مخصصة أساسًا للعمل مع النباتات الخاصة المخزنة في الحساب."
        ]
      },
      {
        "heading": "ماذا يحدث بعد مسح الرمز بنجاح",
        "body": [
          "بعد مسح رمز QR بنجاح في عرض الماسح، يتم توجيه المستخدم تلقائيًا إلى عرض تفاصيل النبات (Plant Details).",
          "في تفاصيل النبات، تتوفر معلومات عن النبات، المهام المرتبطة به، وأحدث القراءات (إذا كان النبات متصلًا بجهاز).",
          "بفضل ذلك، يعد الماسح أسرع طريقة للوصول إلى العرض الكامل للنبات."
        ]
      },
      {
        "heading": "أين يمكن مشاهدة رمز QR للنبات",
        "body": [
          "يمكن عرض رمز QR في قائمة النباتات ضمن عرض النباتات (Plants) — فقط افتح القائمة المنسدلة للنبات المختار واختر خيار رمز QR.",
          "يمكن أيضًا عرض رمز QR مباشرة في عرض تفاصيل النبات (Plant Details).",
          "في كلا المكانين، يتم عرض نفس رمز QR المعين للنبات."
        ]
      },
      {
        "heading": "حفظ أو إرسال رمز QR",
        "body": [
          "يمكنك حفظ رمز QR على الهاتف من عرض النباتات (Plants) أو من تفاصيل النبات (Plant Details).",
          "يمكن أيضًا إرسال رمز QR إلى عنوان البريد الإلكتروني الخاص بك — على سبيل المثال للطباعة لاحقًا أو للاحتفاظ بنسخة احتياطية.",
          "أثناء الطباعة، تأكد من وضوح الرمز (تباين جيد، لا انثناءات، لا انعكاسات ضوء)."
        ]
      },
      {
        "heading": "حل مشكلات المسح",
        "body": [
          "إذا لم يعمل المسح، حاول تحسين الإضاءة وتأكد من أن الرمز مسطح ومرئي بالكامل في إطار الكاميرا.",
          "إذا كان الرمز تالفًا أو مشوشًا، قم بحفظه مرة أخرى من التطبيق أو أرسله عبر البريد الإلكتروني واطبع نسخة جديدة.",
          "إذا كان الرمز يفتح النبات غير الصحيح، تأكد من أنك اخترت النبات الصحيح أثناء الحفظ أو التصدير."
        ]
      }
    ]
  }
}
