{
  "docs_profile": {
    "title": "الملف الشخصي",
    "sections": [
      {
        "heading": "هدف هذه الصفحة",
        "body": [
          "عرض الملف الشخصي هو المكان المركزي لإدارة بيانات الحساب، وإعدادات الإشعارات، وتكوين التطبيق، والدعم.",
          "يتيح للمستخدم التحكم في كل من البيانات الشخصية وسلوك التطبيق Flovers."
        ]
      },
      {
        "heading": "الحساب",
        "body": [
          "عرض الحساب يعرض معلومات أساسية عن الحساب مثل عنوان البريد الإلكتروني وتاريخ إنشاء الحساب.",
          "من هذه الصفحة، يمكن للمستخدم تغيير عنوان البريد الإلكتروني (يجب تأكيده بكلمة المرور)، تغيير كلمة المرور الحالية، تسجيل الخروج أو حذف الحساب بشكل دائم.",
          "حذف الحساب يؤدي إلى مسح دائم لجميع بيانات المستخدم، بما في ذلك النباتات، والتذكيرات، والمهام، والقراءات، والأجهزة."
        ]
      },
      {
        "heading": "الإشعارات",
        "body": [
          "قسم الإشعارات يتيح إدارة الأذونات والتفضيلات لإشعارات البريد الإلكتروني والإشعارات الفورية.",
          "لكلا القناتين، يمكن للمستخدم تمكين أو تعطيل نوعين من الإشعارات: ملخص يومي يحتوي على المهام المجدولة لليوم، وتذكير يتم إرساله بعد 24 ساعة إذا لم يتم تنفيذ المهام بعد.",
          "بالنسبة لكل نوع من الإشعارات، يحدد المستخدم وقت الإرسال (الساعة الكاملة، مثل 14:00)."
        ]
      },
      {
        "heading": "الإعدادات",
        "body": [
          "قسم الإعدادات يتيح التحكم في سلوك التطبيق العام ومظهره.",
          "الخيارات المتاحة تشمل اختيار اللغة، تنسيق التاريخ والوقت، وحدات الحرارة (مئوي، فهرنهايت، كلفن)، وحدات القياس (مترية أو إمبريالية)، وموقع زر FAB (الجانب الأيسر أو الأيمن).",
          "يمكن للمستخدم أيضًا تخصيص مظهر التطبيق باختيار صورة الخلفية، ونمط البلاط (فاتح أو داكن)، ومستوى الشفافية للبلاط."
        ]
      },
      {
        "heading": "الدعم",
        "body": [
          "قسم الدعم يتيح الاتصال المباشر مع فريق Flovers.",
          "يمكن للمستخدم الإبلاغ عن مشكلة أو إرسال استفسار إلى فريق الدعم الفني.",
          "الإبلاغ عن الأخطاء يساعد في تطوير وتحسين جودة التطبيق."
        ]
      }
    ]
  }
}
