{
  "title": "الأسئلة المتداولة",
  "items": [
    {
      "q": "ما هو Flovers وكيف يمكنني استخدامه؟",
      "a": "Flovers هو تطبيق يدعم رعاية النباتات من خلال تنظيم المهام ومراقبة معايير النباتات بناءً على البيانات من أجهزة الاستشعار. يوفر تذكيرات، وإرشادات، ومعلومات مفيدة في الزراعة اليومية."
    },
    {
      "q": "هل Flovers مجاني؟",
      "a": "نعم. Flovers متاح حاليًا مجانًا."
    },
    {
      "q": "ما هي الأنظمة الأساسية التي يدعمها Flovers؟",
      "a": "Flovers متاح حاليًا على نظام Android. في المستقبل، من المخطط دعم iOS."
    },
    {
      "q": "هل يحتاج Flovers إلى حساب لاستخدامه؟",
      "a": "نعم. إنشاء حساب مطلوب لاستخدام التطبيق ووظائفه."
    },
    {
      "q": "هل Flovers متاح بعدة لغات؟",
      "a": "نعم. يدعم Flovers العديد من اللغات بما في ذلك الإنجليزية، البولندية، الألمانية، الإيطالية، الفرنسية، الإسبانية، البرتغالية، العربية، الهندية، الصينية، اليابانية، والكورية."
    },
    {
      "q": "كيف يمكنني إنشاء حساب؟",
      "a": "يمكنك التسجيل مباشرة في التطبيق. بعد التسجيل، يتم تأكيد الحساب عبر البريد الإلكتروني. إذا لزم الأمر، يمكنك إرسال بريد إلكتروني تنشيطي مرة أخرى."
    },
    {
      "q": "لم أتلقَ البريد الإلكتروني التنشيطي - ماذا أفعل؟",
      "a": "يمكنك طلب إعادة إرسال البريد الإلكتروني التنشيطي مباشرة من التطبيق."
    },
    {
      "q": "كيف يمكنني إعادة تعيين كلمة المرور؟",
      "a": "يمكنك طلب بريد إلكتروني لإعادة تعيين كلمة المرور من التطبيق. إذا كنت قد سجلت الدخول، يمكنك أيضًا تغيير كلمة المرور مباشرة في إعدادات الحساب."
    },
    {
      "q": "هل يمكنني تغيير عنوان البريد الإلكتروني المرتبط بحسابي؟",
      "a": "نعم. بعد تسجيل الدخول، يمكنك تغيير عنوان البريد الإلكتروني في شاشة الملف الشخصي في التطبيق."
    },
    {
      "q": "كيف يمكنني حذف الحساب والبيانات؟",
      "a": "يمكن حذف الحساب بشكل دائم من شاشة الملف الشخصي بعد تسجيل الدخول. هذه العملية لا رجعة فيها وتؤدي إلى حذف جميع البيانات المرتبطة."
    },
    {
      "q": "ما الفرق بين تعريف النبات والنبات الخاص بي؟",
      "a": "تعريف النبات هو سجل مدمج في قاعدة بيانات Flovers يحتوي على معلومات عامة حول النوع المحدد مثل التفضيلات، الخصائص، الصور، متطلبات الضوء والتربة، والفترات الموصى بها للري أو الرش. نباتك هو حالة معينة تديرها بنفسك."
    },
    {
      "q": "ما مدى دقة وظيفة التعرف على النباتات؟",
      "a": "الدقة تعتمد على جودة الصورة وطريقة تصوير النبات. يتم تدريب نظام التعرف استنادًا إلى قاعدة بيانات تحتوي على أكثر من 700 نوع من النباتات."
    },
    {
      "q": "هل يتم حفظ الصور المرسلة للتعرف على النباتات؟",
      "a": "لا. الصور يتم معالجتها من خلال الخادم فقط لغرض التعرف عليها ولا يتم تخزينها بشكل دائم."
    },
    {
      "q": "هل يمكنني تتبع العديد من النباتات في وقت واحد؟",
      "a": "نعم. حاليًا لا يوجد حد لعدد النباتات أو أجهزة القياس التي يمكن إضافتها. يمكن ربط كل نبات بجهاز قياس واحد."
    },
    {
      "q": "هل يمكنني إضافة ملاحظات أو تدوين يوميات للنباتات؟",
      "a": "نعم. يمكنك إضافة ملاحظات للنباتات وللمهام المنتهية، مما يخلق يوميات للعناية بالنبات."
    },
    {
      "q": "كيف تعمل التذكيرات والمهام؟",
      "a": "ينشئ المستخدم تذكيرًا بفاصل زمني محدد. بناءً على ذلك، يتم إنشاء المهام تلقائيًا. بعد وضع علامة على المهمة على أنها منجزة، يتم جدولة المهمة التالية وفقًا للفاصل الزمني. اعتمادًا على الإعدادات، يمكنك تلقي إشعارات عبر البريد الإلكتروني أو الإشعارات الفورية للمهام ليوم اليوم أو المهام المتأخرة ليوم واحد."
    },
    {
      "q": "ما هي أنواع المهام التي يدعمها Flovers؟",
      "a": "الأنواع المدعومة من المهام تشمل الري، الرش، التسميد، إعادة الزرع، والعناية العامة."
    },
    {
      "q": "ماذا يحدث إذا نسيت تنفيذ مهمة؟",
      "a": "إذا لم يتم تنفيذ المهمة، يمكن للتطبيق إرسال تذكير بعد 24 ساعة. خلافًا لذلك، ستظل المهمة مُعلمة بأنها متأخرة حتى يتم تنفيذها."
    },
    {
      "q": "هل يمكنني إيقاف أو تعديل التذكيرات؟",
      "a": "يمكنك تعديل أو حذف التذكيرات في أي وقت. حاليًا، لا توجد إمكانية لإيقافها مؤقتًا."
    },
    {
      "q": "هل تضمن التذكيرات أن تبقى نباتاتي صحية؟",
      "a": "لا. يوفر Flovers التذكيرات والإرشادات، لكن قرارات العناية ونتائجها تعتمد على المستخدم."
    },
    {
      "q": "ما هي أجهزة الاستشعار والأجهزة التي يمكنني توصيلها بـ Flovers؟",
      "a": "يدعم Flovers أجهزة الاستشعار التي تقيس درجة حرارة الهواء، رطوبة الهواء، مستوى الضوء، ورطوبة التربة. توجد التكوينات المقترحة للأجهزة في وثائق التطبيق."
    },
    {
      "q": "كم مرة يتم تحديث بيانات أجهزة الاستشعار؟",
      "a": "يمكن إرسال القراءات حتى كل 5 دقائق. لتسجيل البيانات، يتم حالياً حفظها بفواصل زمنية تبلغ ساعة."
    },
    {
      "q": "ماذا يحدث إذا توقف جهاز القياس الخاص بي عن العمل؟",
      "a": "لا يقوم التطبيق بإعلامك بعدم وجود قراءات. ومع ذلك، قد يتم إرسال إشعار إذا انخفض مستوى رطوبة التربة تحت العتبة المحددة."
    },
    {
      "q": "هل يتم تخزين بيانات أجهزة الاستشعار في السحابة؟",
      "a": "نعم. يتم تخزين بيانات أجهزة الاستشعار على خادم VPS في السحابة."
    },
    {
      "q": "هل يمكن لأشخاص آخرين رؤية قراءاتي من أجهزة الاستشعار؟",
      "a": "حاليًا لا. قد يتم إضافة خيارات المشاركة في المستقبل. يمكن للمستخدم أيضًا تنزيل البيانات عبر واجهة برمجة التطبيقات (API) لدمجها مع أجهزة أخرى مثل أنظمة الري التلقائي."
    },
    {
      "q": "ما هي وظيفة رموز QR في Flovers؟",
      "a": "يمكن للمستخدم إنشاء وطباعة رموز QR ووضعها على الأواني. كل رمز يوجه إلى حالة معينة من النبات. بعد مسح الرمز باستخدام التطبيق، يتم نقلك مباشرة إلى تفاصيل النبات."
    },
    {
      "q": "هل مشاركة رمز QR أو الرابط الخاص بالنبات آمنة؟",
      "a": "بشكل عام، نعم. تفاصيل النبات مرئية فقط للمستخدم المسجل الذي يمتلكه."
    },
    {
      "q": "هل يمكنني جعل نباتاتي عامة أو مشاركتها مع أصدقائي؟",
      "a": "ليس في الوقت الحالي. قد تظهر ميزات المشاركة العامة في المستقبل."
    },
    {
      "q": "لماذا لا أتلقى إشعارات؟",
      "a": "تأكد من تمكين الإشعارات الفورية في كل من إعدادات النظام لجهازك وإعدادات التطبيق المتاحة في شاشة الملف الشخصي."
    },
    {
      "q": "كيف يمكنني الاتصال بالدعم الفني أو الإبلاغ عن مشكلة؟",
      "a": "يمكنك استخدام نموذج الاتصال على موقع Flovers أو النموذج المتاح في التطبيق على شاشة الملف الشخصي."
    }
  ]
}
