{
  "privacy": {
    "title": "سياسة الخصوصية",
    "lastUpdated": "آخر تحديث: {{date}}",
    "section1": {
      "title": "§ 1. الأحكام العامة",
      "p1": "مدير البيانات الشخصية المعالجة فيما يتعلق باستخدام موقع فلوفرز الإلكتروني وتطبيق فلوفرز للهاتف المحمول هو مارسين جانوفسكي Copy Paste IT Solutions، ومقره في شارع العقيد فرانشيسكو نولو 30/115، 31-543 كراكوف، بولندا، البريد الإلكتروني: info@flovers.app، ويشار إليه فيما بعد بـ «المدير».",
      "p2": "يتم معالجة البيانات الشخصية وفقًا للتنظيم العام لحماية البيانات (GDPR) الصادر عن البرلمان الأوروبي والمجلس الأوروبي (الاتحاد الأوروبي) 2016/679 بتاريخ 27 أبريل 2016.",
      "p3": "تتعلق سياسة الخصوصية هذه بموقع فلوفرز الإلكتروني، وتطبيق فلوفرز للهاتف المحمول (أندرويد، وفي المستقبل iOS)، والبنية التحتية الخلفية المرتبطة بتشغيلها."
    },
    "section2": {
      "title": "§ 2. نطاق وأهداف معالجة البيانات الشخصية",
      "intro": "يتم معالجة البيانات الشخصية من قبل المدير للأغراض التالية:",
      "list": [
        "إنشاء وإدارة حساب المستخدم في التطبيق",
        "تحقق من هوية المستخدم وتنفيذ عملية تسجيل الدخول",
        "إرسال الرسائل النظامية، بما في ذلك رسائل التحقق والبريد الإلكتروني لإعادة تعيين كلمة المرور",
        "معالجة الاستفسارات المقدمة من خلال نموذج الاتصال",
        "ضمان تشغيل التطبيق والموقع بشكل صحيح",
        "تنفيذ التذكيرات، المهام والإشعارات المتعلقة بالعناية بالنباتات",
        "ضمان أمان النظام وتسجيل السجلات التقنية"
      ],
      "legalBasis": "الأساس القانوني لمعالجة البيانات هو المادة 6 الفقرة 1 الحرف ب من اللائحة العامة لحماية البيانات (تنفيذ العقد)، المادة 6 الفقرة 1 الحرف ج (الالتزام القانوني) والمادة 6 الفقرة 1 الحرف ف (المصلحة المشروعة للمدير)."
    },
    "section3": {
      "title": "§ 3. نوع البيانات المعالجة",
      "intro": "اعتمادًا على كيفية استخدام التطبيق أو الموقع، قد يقوم المدير بمعالجة البيانات التالية:",
      "list": [
        "عنوان البريد الإلكتروني للمستخدم",
        "كلمة المرور المشفرة للمستخدم",
        "معلومات حول الملف الشخصي وتفضيلات المستخدم",
        "البيانات التقنية للجهاز (نوع الجهاز، نظام التشغيل، إصدار التطبيق)",
        "عنوان IP",
        "البيانات المتعلقة باتجاه الجهاز (على سبيل المثال، من أجل تحسين تعرض النباتات للضوء)",
        "البيانات المدخلة من قبل المستخدم المتعلقة بالنباتات، القياسات وأجهزة الاستشعار IoT"
      ],
      "note": "يتم معالجة الصور الملتقطة من قبل المستخدم عادة محليًا على الجهاز، ما لم يقرر المستخدم استخدامها في الوظائف التي تتطلب المعالجة على الخادم."
    },
    "section4": {
      "title": "§ 4. حسابات المستخدمين والأمان",
      "p1": "ينشئ مستخدمو تطبيق فلوفرز حسابات فردية محمية بكلمات مرور.",
      "p2": "يتم تخزين كلمات المرور في شكل مشفر (محسوب).",
      "p3": "يتطلب حساب المستخدم التحقق من عنوان البريد الإلكتروني.",
      "p4": "يمكن للمستخدم تغيير كلمة المرور في أي وقت أو استخدام إجراء إعادة تعيين كلمة المرور."
    },
    "section5": {
      "title": "§ 5. الإشعارات والتواصل",
      "p1": "يرسل المدير فقط الرسائل التي لها طابع تجاري، لا سيما تلك المتعلقة بتسجيل الدخول، تحقق الحساب وإعادة تعيين كلمة المرور.",
      "p2": "قد يستخدم التطبيق إشعارات الدفع (مثل عبر Firebase) لتذكير المستخدمين بالمهام المتعلقة بالعناية بالنباتات.",
      "p3": "يحتفظ المدير بالحق في تقديم نشرة إخبارية في المستقبل، شريطة أن يتم إرسال الرسائل التسويقية فقط بعد الحصول على موافقة منفصلة من المستخدم."
    },
    "section6": {
      "title": "§ 6. ملفات تعريف الارتباط والتقنيات المماثلة",
      "p1": "قد يستخدم الموقع الإلكتروني لفلوفرز ملفات تعريف الارتباط الضرورية لتشغيل الموقع بشكل صحيح.",
      "p2": "تستخدم ملفات تعريف الارتباط فقط للأغراض الفنية والوظيفية.",
      "p3": "لا يستخدم الموقع أدوات تحليلية أو تسويقية من أطراف ثالثة."
    },
    "section7": {
      "title": "§ 7. مستلمي البيانات ومكان المعالجة",
      "p1": "تتم معالجة البيانات الشخصية على الخوادم الموجودة داخل الاتحاد الأوروبي.",
      "p2": "يتم الحفاظ على البنية التحتية للخوادم من قبل Hetzner Online GmbH.",
      "p3": "قد يستخدم المدير خدمات Firebase لتوفير إشعارات الدفع.",
      "p4": "لا يقوم المدير بنقل البيانات الشخصية إلى دول ثالثة خارج الاتحاد الأوروبي."
    },
    "section8": {
      "title": "§ 8. مدة الاحتفاظ بالبيانات",
      "p1": "تظل البيانات الشخصية محفوظة طوال فترة وجود حساب المستخدم.",
      "p2": "بعد حذف الحساب، يتم حذف البيانات بشكل دائم أو إخفاؤها، ما لم ينص القانون على خلاف ذلك."
    },
    "section9": {
      "title": "§ 9. حقوق الأشخاص المعنيين بالبيانات",
      "intro": "يحق لكل شخص معني بالبيانات ما يلي:",
      "list": [
        "الوصول إلى بياناته",
        "تصحيح بياناته",
        "حذف البيانات",
        "تقييد المعالجة",
        "الاعتراض",
        "سحب الموافقة في أي وقت"
      ],
      "p2": "لتنفيذ هذه الحقوق، يجب الاتصال بالمدير عبر البريد الإلكتروني: info@flovers.app.",
      "p3": "يحق للشخص المعني بالبيانات أيضًا تقديم شكوى إلى رئيس مكتب حماية البيانات الشخصية."
    },
    "section10": {
      "title": "§ 10. الأحكام الختامية",
      "p1": "يتخذ المدير التدابير الفنية والتنظيمية المناسبة لحماية البيانات الشخصية.",
      "p2": "يحتفظ المدير بالحق في تحديث سياسة الخصوصية هذه.",
      "p3": "النسخة الحالية من سياسة الخصوصية متاحة دائمًا على موقع فلوفرز الإلكتروني وفي التطبيق المحمول."
    }
  }
}
