{
  "terms": {
    "title": "الشروط والأحكام",
    "lastUpdated": "آخر تحديث: {{date}}",
    "section1": {
      "title": "§ 1. الأحكام العامة",
      "p1": "تحدد هذه الشروط والأحكام قواعد استخدام خدمة فلوفرز على الإنترنت وتطبيق فلوفرز للهاتف المحمول (أندرويد، وفي المستقبل iOS)، بالإضافة إلى شروط تقديم الخدمات الإلكترونية من قبل مزود الخدمة.",
      "p2": "مزود الخدمة هو مارسين يانوفسكي Copy Paste IT Solutions، شارع العقيد فرانشيسكو نولو 30/115، 31-543 كراكوف، بولندا، البريد الإلكتروني: info@flovers.app (المشار إليه فيما بعد: «مزود الخدمة»).",
      "p3": "باستخدام الخدمة (بما في ذلك من خلال تسجيل الحساب، تسجيل الدخول، استخدام وظائف التطبيق أو الخدمة)، يوافق المستخدم على الشروط والأحكام ويلتزم بالامتثال لها.",
      "p4": "في المسائل غير المنظمة من قبل هذه الشروط، تنطبق بشكل خاص: قانون تقديم الخدمات الإلكترونية، القانون المدني، قانون حقوق المستهلك وأي لوائح أخرى سارية في القانون البولندي وقانون الاتحاد الأوروبي."
    },
    "section2": {
      "title": "§ 2. التعريفات",
      "items": [
        "«الخدمة» – الخدمات المقدمة إلكترونيًا من قبل مزود الخدمة في إطار فلوفرز، بما في ذلك التطبيق المحمول، الخدمة على الإنترنت والبنية التحتية الخلفية المرتبطة بها.",
        "«التطبيق» – تطبيق فلوفرز للهاتف المحمول المتاح للأجهزة المحمولة (أندرويد؛ وفي المستقبل iOS).",
        "«الخدمة» – الموقع الإلكتروني لفلوفرز مع الوثائق والمعلومات.",
        "«المستخدم» – الشخص الذي يستخدم الخدمة؛ في حالة التسجيل – الشخص الذي أنشأ الحساب.",
        "«الحساب» – الملف الشخصي للمستخدم في نظام مزود الخدمة، محمي بكلمة مرور.",
        "«الجهاز» – الجهاز الذي يستخدمه المستخدم للوصول إلى الخدمة (على سبيل المثال الهاتف، الجهاز اللوحي) وأي جهاز قياس (مثل Arduino) إذا كان ذلك مناسبًا والذي يرسل القراءات إلى الخدمة.",
        "«تعريف النبات» – البطاقة/السجل الخاص بالنبات الذي أنشأه مزود الخدمة والذي يحتوي على خصائصه وتفضيلاته والتوصيات (مثل الري، الرش، التسميد)، وقد يتضمن عناصر يتم إنشاؤها تلقائيًا (مثل المحتوى باستخدام الذكاء الاصطناعي).",
        "«مثيل النبات» – النبات الذي يحدده المستخدم في حسابه (نسخته الخاصة)، ويمكن ربطه بتعريف النبات.",
        "«القراءات / بيانات القياس» – البيانات من أجهزة الاستشعار (مثل درجة حرارة الهواء، رطوبة الهواء، رطوبة التربة، مستوى الضوء) المرتبطة بمثيل النبات.",
        "«التذكير» – تعريف العمل الدوري (مثل الري، الرش، إعادة الزراعة، العناية، التسميد)، والذي يتم بناء عليه إنشاء المهام.",
        "«المهمة» – عنصر في قائمة المهام التي يتم إنشاؤها بناءً على التذكير؛ يمكن للمستخدم تحديدها على أنها منجزة وإضافة ملاحظات.",
        "«محتوى المستخدم» – البيانات التي يدخلها المستخدم أو يحتفظ بها في الخدمة (مثل مثيلات النباتات، الملاحظات، تاريخ المهام، سجل النباتات، الارتباطات مع الأجهزة، بيانات القياس).",
        "«التعرف على النباتات» – ميزة تعتمد على تحليل الصورة التي يقدمها المستخدم لإرجاع نتيجة التعرف من قبل نظام مزود الخدمة.",
        "«الشروط والأحكام» – شروط الاستخدام هذه لفلوفرز."
      ]
    },
    "section3": {
      "title": "§ 3. نطاق الخدمة والوظائف",
      "intro": "قد تشمل الخدمة بشكل خاص:",
      "list": [
        "تسجيل الحساب وإدارته (تسجيل الدخول، تأكيد البريد الإلكتروني، إعادة تعيين كلمة المرور، إرسال رابط التفعيل مرة أخرى)",
        "مكتبة تعريفات النباتات والإرشادات المرتبطة بها",
        "إنشاء مثيلات النباتات وإدارة السجل/التاريخ (الملاحظات، تاريخ المهام)",
        "التذكيرات والمهام المتعلقة برعاية النباتات (مثل الري، الرش، التسميد، إعادة الزراعة)",
        "التعرف على النباتات بناءً على الصورة التي يرسلها المستخدم",
        "التكامل مع الأجهزة القياسية وتخزين وعرض بيانات القياس",
        "إنشاء ومسح رموز الاستجابة السريعة (QR) التي توجه إلى موارد المستخدم (مثل مثيل النبات)",
        "الوثائق والقسم الخاص بالأسئلة الشائعة"
      ],
      "p1": "تتوفر الخدمة حاليًا في نسخة مجانية (بيتا). قد يقدم مزود الخدمة خططًا مدفوعة أو حدودًا للخطة المجانية أو إعلانات أو اشتراكات في المستقبل – وسيتم إخطار المستخدمين بذلك في الخدمة و/أو في الموقع الإلكتروني.",
      "p2": "يمكن لمزود الخدمة تغيير الوظائف والواجهة وطريقة عمل الخدمة، بما في ذلك إضافة أو إزالة الوظائف، طالما أن ذلك لا ينتهك القوانين الإلزامية."
    },
    "section4": {
      "title": "§ 4. المتطلبات الفنية",
      "items": [
        "جهاز مع الوصول إلى الإنترنت.",
        "متصفح ويب حديث (للموقع الإلكتروني) أو نظام أندرويد متوافق (للتطبيق).",
        "عنوان بريد إلكتروني فعال (للتسجيل وإدارة الحساب).",
        "تمكين دعم JavaScript وملفات تعريف الارتباط في المتصفح (للموقع الإلكتروني)، إذا كان ذلك مطلوبًا لتشغيل الخدمة بشكل صحيح."
      ]
    },
    "section5": {
      "title": "§ 5. الحساب والأمان",
      "p1": "لاستخدام معظم وظائف الخدمة، يتطلب إنشاء حساب.",
      "p2": "يجب على المستخدم تقديم بيانات صحيحة والحفاظ على سرية بيانات الدخول.",
      "p3": "المستخدم مسؤول عن الأنشطة التي تتم من خلال حسابه، ما لم تكن ناتجة عن أسباب تتعلق بمزود الخدمة.",
      "p4": "يمكن لمزود الخدمة حظر الوصول إلى الحساب أو الخدمة مؤقتًا في حال اكتشاف انتهاكات أو تهديدات للأمان أو مخالفات للشروط."
    },
    "section6": {
      "title": "§ 6. محتوى المستخدم والحقوق",
      "p1": "يحتفظ المستخدم بحقوقه في محتوى المستخدم ضمن الحدود التي يمنحها له القانون.",
      "p2": "يمنح المستخدم مزود الخدمة ترخيصًا غير حصري، مجاني، قابل للإلغاء (عن طريق حذف الحساب أو المحتوى)، قابل للتحويل بالقدر اللازم لتقديم الخدمة، لتخزين، وتسجيل، ونسخ، وعرض ومعالجة محتوى المستخدم فقط بهدف تقديم وصيانة الخدمة.",
      "p3": "في إطار التعرف على النباتات، يمكن للمستخدم إرسال صورة إلى نظام مزود الخدمة. يعلن مزود الخدمة أن الصور التي تُستخدم للتعرف لا يتم تخزينها لفترة أطول من اللازم لإتمام عملية التعرف، ما لم يختار المستخدم بشكل صريح ميزة تتطلب حفظها.",
      "p4": "يصرح المستخدم بأنه يمتلك الحقوق في المحتوى الذي يقدمه إلى الخدمة وأنه لا ينتهك حقوق الأطراف الثالثة."
    },
    "section7": {
      "title": "§ 7. قواعد الاستخدام والمحظورات",
      "intro": "يجب على المستخدم استخدام الخدمة بما يتوافق مع القانون، والأخلاقيات، واحترام حقوق الآخرين. يحظر بشكل خاص:",
      "list": [
        "محاولة تجاوز المصادقة أو الأمان أو القيود التقنية",
        "الإساءة لاستخدام واجهات البرمجة أو نقاط النهاية أو آليات التكامل (بما في ذلك المتعلقة بالأجهزة القياسية) بطريقة قد تعطل الخدمة",
        "إدخال محتوى غير قانوني أو مسيء أو ينتهك حقوق الأشخاص الآخرين أو حقوق الملكية الفكرية",
        "إرسال رسائل غير مرغوب فيها أو محتوى ترويجي/جماهيري من خلال ميزات الاتصال أو الدعم",
        "أعمال تؤدي إلى الوصول غير المصرح به إلى بيانات المستخدمين الآخرين"
      ],
      "p1": "يمكن لمزود الخدمة تقييد الوصول إلى الخدمة أو الحساب في حال انتهاك هذه القواعد."
    },
    "section8": {
      "title": "§ 8. رموز QR، الروابط و«المفاتيح السرية»",
      "p1": "قد تتيح الخدمة إنشاء رموز QR أو روابط (على سبيل المثال، لمثيل النبات). يكون المستخدم مسؤولاً عن تخزينها ومشاركتها.",
      "p2": "إذا قام المستخدم بمشاركة الروابط أو المعرفات أو المفاتيح مع أطراف ثالثة (على سبيل المثال للوصول إلى بيانات القياس)، يمكن لتلك الأطراف الوصول إلى المعلومات المحددة وفقًا للأذونات الممنوحة. يتحمل المستخدم مخاطر هذه المشاركة."
    },
    "section9": {
      "title": "§ 9. المدفوعات والخطط (معلومات للمستقبل)",
      "p1": "في تاريخ نشر هذه الشروط، تُقدم الخدمة مجانًا بنموذج بيتا.",
      "p2": "قد يقدم مزود الخدمة خططًا مدفوعة أو اشتراكات قابلة للتجديد أو إعلانات أو حدود (مثل عدد النباتات) في المستقبل. قد يتم تقديم الخطط المدفوعة من خلال Google Play أو متجر Apple App Store.",
      "p3": "إذا تم تقديم الاشتراكات، فقد تكون قابلة للتجديد التلقائي. قد تعتمد شروط الدفع والفوترة والردود على سياسات المتجر (Google/Apple) والمعلومات المقدمة في الخدمة عند الشراء."
    },
    "section10": {
      "title": "§ 10. المسؤولية والتحفظات",
      "p1": "تتمثل الخدمة في تقديم معلومات ودعم في رعاية النباتات. لا يضمن مزود الخدمة تحقيق نتائج محددة (مثل نمو النباتات، تجنب أمراض النباتات، تجنب أخطاء العناية). القرارات المتعلقة برعاية النباتات يتخذها المستخدم على مسؤوليته الشخصية.",
      "p2": "يوفر مزود الخدمة الخدمة بنموذج «كما هو» (وفقًا لأفضل الجهود). قد تحدث انقطاعات فنية أو قيود تتعلق بالصيانة أو التطوير أو الأعطال.",
      "p3": "لا يتحمل مزود الخدمة مسؤولية الأضرار الناجمة عن: الاستخدام غير السليم للخدمة، البيانات الخاطئة المدخلة من قبل المستخدم، الأجهزة القياسية التي لا تعمل بشكل صحيح من جانب المستخدم، انقطاع الإنترنت أو الظروف الأخرى الخارجة عن إرادة مزود الخدمة، ضمن الحدود المسموح بها قانونًا.",
      "p4": "لا تستثني أو تحد من الأحكام الواردة في هذا البند حقوق المستهلك الناشئة عن القوانين الإلزامية."
    },
    "section11": {
      "title": "§ 11. الشكاوى والتواصل",
      "p1": "يمكن للمستخدم تقديم شكاوى بشأن الخدمة عبر البريد الإلكتروني إلى العنوان: info@flovers.app.",
      "p2": "يجب أن يصف المستخدم المشكلة في الشكوى، ويحدد التاريخ والظروف التي حدثت فيها، وإذا أمكن، إرفاق معلومات تساعد في التعرف على القضية (مثل لقطات الشاشة).",
      "p3": "سيقدم مزود الخدمة ردًا في أسرع وقت ممكن، في غضون 14 يومًا على الأكثر."
    },
    "section12": {
      "title": "§ 12. إنهاء العقد، حذف الحساب",
      "p1": "يمكن للمستخدم حذف الحساب في أي وقت من خلال التطبيق، مما يؤدي إلى الحذف الدائم للحساب والبيانات المرتبطة به في نظام مزود الخدمة (دون وضع «مخفي»).",
      "p2": "يمكن لمزود الخدمة تعليق أو إنهاء تقديم الخدمة للمستخدم في حال انتهاك الشروط، أو القيام بأنشطة غير قانونية أو أنشطة تهدد أمن الخدمة.",
      "p3": "يمكن لمزود الخدمة إنهاء تقديم الخدمة (كليًا أو جزئيًا) لأسباب مهمة (مثل أسباب فنية أو قانونية)، مع إخطار المستخدمين بذلك مسبقًا إذا كان ذلك ممكنًا."
    },
    "section13": {
      "title": "§ 13. الملكية الفكرية",
      "p1": "البرمجيات، المظهر، الشعارات، اسم فلوفرز، الوثائق والمحتويات التي يوفرها مزود الخدمة في إطار الخدمة تخضع للحماية القانونية، بما في ذلك حقوق الطبع والنشر، وهي مملوكة لمزود الخدمة أو الكيانات المعنية.",
      "p2": "يحظر نسخ أو تعديل أو توزيع أو استخدام عناصر الخدمة دون إذن من مزود الخدمة، باستثناء الاستخدام المسموح به بموجب قوانين حقوق الطبع والنشر."
    },
    "section14": {
      "title": "§ 14. عمر المستخدم",
      "p1": "الخدمة مخصصة للأشخاص الذين بلغوا سن 16 عامًا.",
      "p2": "إذا لم يبلغ المستخدم 16 عامًا، فلا ينبغي له إنشاء حساب أو استخدام الخدمة."
    },
    "section15": {
      "title": "§ 15. الوثائق ذات الصلة",
      "intro": "ترتبط الخدمة بالوثائق والمعلومات التالية:",
      "list": [
        "سياسة الخصوصية",
        "سياسة ملفات تعريف الارتباط",
        "الوثائق والأسئلة الشائعة"
      ]
    },
    "section16": {
      "title": "§ 16. القانون المعمول به وتسوية النزاعات",
      "p1": "تخضع هذه الشروط للقانون البولندي، مع مراعاة القوانين الملزمة لحماية المستهلك.",
      "p2": "يجب تسوية النزاعات أولاً وديًا (على سبيل المثال، من خلال الاتصال عبر البريد الإلكتروني ومحاولة التوصل إلى تفاهم).",
      "p3": "يمكن للمستهلك الاستفادة من طرق تسوية النزاعات البديلة ومن منصة تسوية النزاعات عبر الإنترنت (ODR) المتاحة على الرابط: https://ec.europa.eu/consumers/odr/.",
      "p4": "تحدد الولاية القضائية في النزاعات مع المستهلكين وفقًا للقوانين المعمول بها."
    },
    "section17": {
      "title": "§ 17. تغييرات في الشروط والأحكام",
      "p1": "يمكن لمزود الخدمة تعديل هذه الشروط لأسباب مهمة (مثل التغييرات القانونية، تطوير الخدمة، التغييرات التكنولوجية).",
      "p2": "سيتم إخطار المستخدمين بالتغييرات في الشروط في الموقع الإلكتروني و/أو التطبيق. يعني الاستمرار في استخدام الخدمة بعد سريان التغييرات قبول الشروط والأحكام المعدلة."
    }
  }
}
