{
  "docs_scanner": {
    "title": "QR Scanner",
    "sections": [
      {
        "heading": "Wozu dient der Scanner",
        "body": [
          "Die Scanner-Ansicht ermöglicht das Scannen von QR-Codes, die zuvor für Pflanzen in Flovers generiert wurden.",
          "Das häufigste Szenario ist das Drucken eines QR-Codes und das Anbringen auf dem Blumentopf, um später schnell die richtige Pflanze in der App zu öffnen.",
          "Das Scannen von QR-Codes dient hauptsächlich der bequemen und schnellen Navigation – ohne manuelles Suchen in der Liste."
        ]
      },
      {
        "heading": "Erforderlicher Kamerazugriff",
        "body": [
          "Um die QR-Scanner-Funktion zu nutzen, erfordert die Flovers-App die Zustimmung zum Kamerazugriff auf dem Telefon.",
          "Die Kamera wird ausschließlich zum Scannen von QR-Codes in Echtzeit verwendet und dient nicht zum Aufnehmen von Videos oder Fotos außerhalb dieses Prozesses.",
          "Wenn der Kamerazugriff abgelehnt wird, funktioniert die Scanner-Funktion nicht, bis die entsprechenden Berechtigungen in den Systemeinstellungen des Geräts erteilt werden."
        ]
      },
      {
        "heading": "Was der QR-Code in Flovers enthält",
        "body": [
          "Der QR-Code in Flovers enthält eine Referenz zu Flovers sowie eine ID für die spezifische Pflanzeninstanz im Benutzerkonto.",
          "Nach erfolgreichem Scannen des Codes erkennt die App ihn und leitet zur angegebenen Pflanze weiter.",
          "QR-Codes sind hauptsächlich für die Arbeit mit eigenen Pflanzen im Konto vorgesehen."
        ]
      },
      {
        "heading": "Was passiert nach dem erfolgreichen Scannen",
        "body": [
          "Nach erfolgreichem Scannen des QR-Codes in der Scanner-Ansicht wird der Benutzer automatisch zur Pflanzen-Detailansicht (Plant Details) weitergeleitet.",
          "In der Pflanzen-Detailansicht sind Informationen zur Pflanze, verbundene Aufgaben und die neuesten Messwerte verfügbar (falls die Pflanze mit einem Gerät verbunden ist).",
          "Dadurch ist der Scanner der schnellste Weg, um zur vollständigen Ansicht einer Pflanze zu gelangen."
        ]
      },
      {
        "heading": "Wo man den QR-Code der Pflanze einsehen kann",
        "body": [
          "Die Vorschau des QR-Codes ist in der Pflanzenliste in der Pflanzenansicht (Plants) verfügbar – einfach das Dropdown-Menü für die ausgewählte Pflanze öffnen und die Option für den QR-Code auswählen.",
          "Der QR-Code kann auch direkt in der Pflanzen-Detailansicht (Plant Details) angezeigt werden.",
          "An beiden Orten wird der gleiche QR-Code angezeigt, der der jeweiligen Pflanze zugeordnet ist."
        ]
      },
      {
        "heading": "QR-Code speichern oder senden",
        "body": [
          "Sowohl aus der Pflanzenansicht (Plants) als auch aus der Pflanzen-Detailansicht (Plant Details) kann der QR-Code auf dem Telefon gespeichert werden.",
          "Es ist auch möglich, den QR-Code an die eigene E-Mail-Adresse zu senden – z. B. zum späteren Drucken oder zur Sicherung einer Kopie.",
          "Achten Sie beim Drucken darauf, dass der Code gut lesbar ist (guter Kontrast, keine Falten, keine Lichtreflexionen)."
        ]
      },
      {
        "heading": "Fehlerbehebung beim Scannen",
        "body": [
          "Wenn das Scannen nicht funktioniert, versuchen Sie, das Licht zu verbessern und stellen Sie sicher, dass der Code flach und vollständig im Kamerabild sichtbar ist.",
          "Wenn der Code beschädigt oder unscharf ist, speichern Sie ihn erneut aus der App oder senden Sie ihn per E-Mail und drucken Sie eine neue Kopie.",
          "Wenn der Code die falsche Pflanze öffnet, stellen Sie sicher, dass beim Speichern oder Exportieren die richtige Pflanze ausgewählt wurde."
        ]
      }
    ]
  }
}
