{
  "docs_scanner": {
    "title": "QR 스캐너",
    "sections": [
      {
        "heading": "스캐너의 용도",
        "body": [
          "스캐너 뷰는 Flovers에서 이전에 생성된 식물의 QR 코드를 스캔할 수 있습니다.",
          "가장 일반적인 시나리오는 QR 코드를 인쇄하여 화분에 부착하고, 나중에 애플리케이션에서 올바른 식물을 빠르게 열 수 있도록 하는 것입니다.",
          "QR 스캔은 주로 편리하고 빠른 탐색을 위한 것입니다 — 목록에서 수동으로 검색할 필요 없이."
        ]
      },
      {
        "heading": "카메라 접근 권한 필요",
        "body": [
          "QR 스캐너 기능을 사용하려면 Flovers 애플리케이션이 전화기의 카메라 접근 권한을 요구합니다.",
          "카메라는 QR 코드를 실시간으로 스캔하는 데만 사용되며, 비디오 촬영이나 사진 촬영에는 사용되지 않습니다.",
          "카메라 접근이 거부되면, 시스템 설정에서 적절한 권한을 부여할 때까지 스캐너 기능은 작동하지 않습니다."
        ]
      },
      {
        "heading": "Flovers의 QR 코드에 포함된 내용",
        "body": [
          "Flovers의 QR 코드에는 Flovers에 대한 참조와 사용자 계정 내 특정 식물 인스턴스의 ID가 포함됩니다.",
          "QR 코드를 올바르게 스캔하면 애플리케이션이 이를 인식하고 해당 식물로 리디렉션합니다.",
          "QR 코드는 주로 계정에 저장된 개인 식물과 작업하는 데 사용됩니다."
        ]
      },
      {
        "heading": "올바르게 스캔한 후 발생하는 일",
        "body": [
          "QR 코드를 스캔하면 사용자 자동으로 식물 상세 보기(Plant Details)로 리디렉션됩니다.",
          "식물 상세 보기에서는 식물에 대한 정보, 관련 작업 및 최신 읽기 값(식물이 장치에 연결되어 있는 경우)을 확인할 수 있습니다.",
          "따라서 스캐너는 해당 식물의 전체 뷰로 이동하는 가장 빠른 방법입니다."
        ]
      },
      {
        "heading": "식물의 QR 코드 확인 방법",
        "body": [
          "QR 코드 미리 보기는 식물 목록에서 식물 보기(Plants)로 확인할 수 있습니다 — 선택한 식물에 대한 드롭다운 메뉴를 열고 QR 코드 옵션을 선택하면 됩니다.",
          "QR 코드는 식물 상세 보기(Plant Details)에서도 직접 표시할 수 있습니다.",
          "두 곳 모두 동일한 QR 코드가 표시되며 해당 식물에 할당됩니다."
        ]
      },
      {
        "heading": "QR 코드 저장 또는 전송",
        "body": [
          "식물 보기(Plants)와 식물 상세 보기(Plant Details)에서 모두 QR 코드를 전화기에 저장할 수 있습니다.",
          "QR 코드를 자신의 이메일로 전송할 수도 있습니다 — 예를 들어, 나중에 인쇄하거나 백업 복사본을 보관할 수 있습니다.",
          "인쇄 시 QR 코드가 잘 읽히도록 주의하세요 (좋은 대비, 접힘 없이, 반사광 없이)."
        ]
      },
      {
        "heading": "스캔 문제 해결",
        "body": [
          "스캔이 작동하지 않으면 조명을 개선하고, 코드가 평평하고 카메라 뷰에 완전히 보이는지 확인하세요.",
          "코드가 손상되었거나 흐릿하면 애플리케이션에서 다시 저장하거나 이메일로 전송하여 새 복사본을 인쇄하세요.",
          "QR 코드가 잘못된 식물을 열 경우, 저장 또는 내보내기 시 올바른 식물이 선택되었는지 확인하세요."
        ]
      }
    ]
  }
}
