{
  "docs_home": {
    "title": "홈",
    "sections": [
      {
        "heading": "홈 화면의 목적",
        "body": [
          "홈은 로그인 후 표시되는 기본 화면입니다.",
          "일상적인 작업에 집중합니다: 알림에 기반하여 생성된 작업을 표시하여 오늘 해야 할 일이나 이미 미뤄진 일을 빠르게 확인할 수 있습니다.",
          "작업이 없으면 예정된 작업이 없다는 메시지와 함께 추가 단계(예: 알림 만들기)를 제안하는 정보 카드가 표시됩니다."
        ]
      },
      {
        "heading": "작업 목록 (알림에 의해 생성된 카드들)",
        "body": [
          "각 카드는 알림 정의(예: 물주기, 분무, 비료주기, 화분갈이 또는 관리)에 따라 생성된 개별 작업을 나타냅니다.",
          "작업은 알림에 설정된 주기 규칙에 따라 필요할 때 자동으로 나타납니다.",
          "카드는 일반적으로 작업 유형, 식물 이름, 위치 및 기한 상태(예: 오늘 해야 할 일 또는 미뤄진 일)를 포함합니다."
        ]
      },
      {
        "heading": "작업 카드 메뉴 (개별 작업에 대한 액션)",
        "body": [
          "각 작업에는 해당 작업에 대한 액션을 포함하는 컨텍스트 메뉴(세 개의 점으로 된 메뉴)가 있습니다.",
          "완료로 표시: 작업을 완료하고 필요에 따라 메모를 추가할 수 있습니다. 이는 관리 기록을 만드는 데 도움이 됩니다.",
          "알림 편집: 작업과 관련된 알림을 열어 주기 설정을 변경합니다.",
          "식물로 이동: 작업에 할당된 식물의 세부 정보 화면으로 이동합니다.",
          "작업 기록 보기: 해당 식물 또는 알림에 대해 이전에 완료된 작업들을 보여주는 작업 기록을 엽니다."
        ]
      },
      {
        "heading": "FAB 버튼 (빠른 액션)",
        "body": [
          "홈 화면에는 작업을 빠르게 처리할 수 있는 FAB 버튼이 있어 빠른 작업 세트를 펼칠 수 있습니다.",
          "미뤄진 작업 표시: 미뤄진 작업만 표시하는 빠른 필터를 적용합니다.",
          "오늘 해야 할 일 표시: 오늘 예정된 작업만 표시하는 빠른 필터를 적용합니다.",
          "정렬: 작업 목록의 순서를 변경합니다.",
          "필터링: 선택한 기준에 따라 작업 목록을 좁힙니다.",
          "기록: 작업 기록 보기 화면으로 이동합니다. 이 화면은 별도로 문서화됩니다."
        ]
      },
      {
        "heading": "정렬 옵션",
        "body": [
          "정렬을 통해 작업 목록을 작업 스타일에 맞게 조정할 수 있습니다.",
          "사용 가능한 정렬 옵션은: 실행 날짜 (기한), 식물 이름, 위치입니다."
        ]
      },
      {
        "heading": "필터 옵션",
        "body": [
          "필터는 특정 작업 그룹에 집중할 수 있도록 도와줍니다.",
          "작업은 다음 기준으로 필터링할 수 있습니다: 식물 이름, 위치, 작업 유형, 실행 날짜 범위.",
          "필터를 조합하여 예를 들어 특정 위치의 물주기 작업만 표시할 수 있습니다."
        ]
      },
      {
        "heading": "작업 일괄 종료 (bulk)",
        "body": [
          "작업 일괄 종료는 빠른 보기(미뤄진 작업 보기 또는 오늘 해야 할 일 보기)에서 사용할 수 있습니다.",
          "이 필터 중 하나가 활성화되면, FAB 버튼은 일시적으로 '보이는 작업을 완료로 표시'와 같은 추가 작업을 표시합니다.",
          "이 작업은 수동으로 각 카드를 선택하지 않고 현재 표시된 모든 작업을 한 번에 종료합니다.",
          "작업 일괄 종료는 여러 식물에 대해 동일한 관리 작업을 수행하는 경우에 유용하도록 설계되었습니다.",
          "선택한 워크플로에 따라, 일괄 작업을 완료한 후에 작업에 메모를 추가하는 것이 여전히 가능할 수 있습니다."
        ]
      },
      {
        "heading": "홈 화면에서의 탐색",
        "body": [
          "홈 화면에서는 카드에서 액션을 수행하거나 FAB 단축키를 사용하여 앱의 다른 부분으로 빠르게 이동할 수 있습니다.",
          "개별 작업 화면에서 식물 세부 정보나 작업 기록으로 바로 이동할 수 있습니다.",
          "FAB에서 작업 기록을 열거나 정렬 및 필터를 사용하여 작업 목록을 좁힐 수 있습니다."
        ]
      }
    ]
  }
}
