{
  "docs_plant_details": {
    "title": "식물 세부 사항",
    "sections": [
      {
        "heading": "이 뷰의 목적",
        "body": [
          "식물 세부 사항 뷰는 사용자가 생성한 개별 식물을 보기 및 관리하는 중심 지점입니다.",
          "이 뷰는 식물 정보, 할당된 알림, 작업, 센서 데이터(있는 경우), 그리고 이 식물과 관련된 빠른 작업들을 연결합니다."
        ]
      },
      {
        "heading": "식물 정보",
        "body": [
          "화면 상단에는 식물 이미지, 이름, 선택적인 식물 정의 이름 및 할당된 위치가 표시됩니다.",
          "아래에는 식물 생성 시 제공된 상세한 매개변수들이 표시되며, 여기에는 구매 날짜, 메모, 조명 조건, 방향, 창문에서의 거리, 화분 유형 및 토양 종류가 포함됩니다.",
          "이 정보들은 알림, 데이터 및 관리 결정을 더 잘 해석하는 데 도움이 됩니다."
        ]
      },
      {
        "heading": "식물 수준 작업 (점 3개 메뉴)",
        "body": [
          "식물 제목과 연결된 점 3개 메뉴는 식물 자체와 관련된 추가 작업을 제공합니다.",
          "사용할 수 있는 옵션으로는 식물 정의 보기(식물이 정의와 연결된 경우), 식물 데이터 편집, 이미지 변경 및 해당 식물에 대한 필터링된 알림 보기 등이 있습니다.",
          "이미지 변경을 통해 기본 이미지를 교체하거나, 휴대폰에서 자신의 사진을 추가하거나 이미지를 제거할 수 있습니다."
        ]
      },
      {
        "heading": "식물 정의",
        "body": [
          "식물이 Flovers 데이터베이스의 식물 정의와 연결된 경우, 사용자는 해당 정의를 표시하는 전용 뷰를 열 수 있습니다.",
          "이 뷰는 식물에 대한 설명, 관리 선호도, 특성, 난이도, 온도 범위, 습도, 독성 및 성장 특성 등의 품종 정보를 표시합니다.",
          "식물 정의는 일반적인 지침을 제공하며, 사용자의 실제 조건에 맞게 해석되어야 합니다."
        ]
      },
      {
        "heading": "알림 및 작업",
        "body": [
          "알림 섹션은 해당 식물에 할당된 모든 활성 알림을 표시합니다.",
          "각 알림에는 작업을 종료하거나, 알림을 편집하거나, 작업 기록을 볼 수 있는 점 3개 메뉴가 있습니다.",
          "작업을 종료할 때 사용자는 식물 관리 기록의 일환으로 메모를 추가할 수 있습니다."
        ]
      },
      {
        "heading": "최신 데이터",
        "body": [
          "식물이 측정 장치와 연결된 경우, 이 뷰는 센서에서의 최신 데이터를 표시합니다.",
          "지원되는 데이터는 공기 온도, 공기 습도, 빛의 양 및 토양 습도를 포함합니다.",
          "이 섹션은 마지막 측정 값을 시간 정보와 함께 표시합니다.",
          "데이터 타일을 누르면 사용자는 데이터 기록 보기로 이동하며, 이곳에서는 온도, 습도, 빛 및 토양 습도에 대한 상세한 차트와 요약(일일/주간/월간)을 볼 수 있습니다(장치가 식물과 연결된 경우)."
        ]
      },
      {
        "heading": "QR 코드 및 빠른 액세스",
        "body": [
          "각 식물에는 화면 하단에 표시된 고유한 QR 코드가 있습니다.",
          "이 코드를 스캐너 뷰에서 스캔하면 식물 세부 사항 뷰로 바로 이동합니다.",
          "QR 코드는 장치에 저장하거나 이메일로 보낼 수 있으며, 이를 인쇄하여 화분에 붙일 수 있습니다."
        ]
      },
      {
        "heading": "중요한 정보",
        "body": [
          "사용자가 추가한 사진은 오직 사용자의 장치에만 저장되며 Flovers 백엔드에는 저장되지 않습니다.",
          "식물의 기본 이미지는 Flovers 백엔드에서 제공되며 AI를 사용해 생성될 수 있습니다.",
          "센서 데이터 및 제안된 작업은 정보 제공 목적이며, 사용자의 자체 평가와 결합하여 해석되어야 합니다."
        ]
      }
    ]
  }
}
