{
  "docs_readings": {
    "title": "읽기",
    "sections": [
      {
        "heading": "이 뷰의 목적",
        "body": [
          "읽기 뷰는 식물과 연결된 IoT 장치를 탐색하고 관리할 수 있게 해줍니다.",
          "각 장치는 공기 온도, 공기 습도, 빛의 수준 및 토양 습도와 같은 측정을 Flovers에 전송할 수 있습니다.",
          "이 기능은 자체 장치(예: Arduino 또는 ESP 기반)를 구축하여 식물 조건을 모니터링하는 사용자에게 제공됩니다."
        ]
      },
      {
        "heading": "장치 타일 및 최근 읽기",
        "body": [
          "화면에는 각 타일이 하나의 연결된 장치를 나타내는 타일 목록이 표시됩니다.",
          "각 타일은 식물 이름, 위치 및 센서에서 받은 최신 읽기를 표시합니다.",
          "데이터가 아직 수신되지 않은 경우, 값 대신 대체 기호가 표시됩니다."
        ]
      },
      {
        "heading": "타일 상호작용",
        "body": [
          "타일 영역을 클릭하면 사용자가 해당 장치의 읽기 기록 뷰로 직접 이동합니다.",
          "특정 매개변수(예: 습도 또는 온도) 아이콘을 클릭하면 선택된 매개변수와 함께 읽기 기록이 열립니다.",
          "이 기능은 자세한 차트에 빠르게 접근할 수 있게 해줍니다."
        ]
      },
      {
        "heading": "장치 작업(3점 메뉴)",
        "body": [
          "각 장치 타일에는 추가 작업이 포함된 3점 메뉴가 있습니다.",
          "사용 가능한 옵션은 읽기 기록, 식물 세부 사항, 장치 편집 및 장치 삭제입니다.",
          "장치 삭제는 영구적이며 식물과의 연결을 제거합니다."
        ]
      },
      {
        "heading": "읽기 기록",
        "body": [
          "읽기 기록 뷰는 수집된 데이터 측정의 세부 차트를 표시합니다.",
          "데이터는 일간, 주간 또는 월간으로 표시될 수 있습니다.",
          "차트는 공기 온도, 공기 습도, 빛의 수준 및 토양 습도에 대해 제공됩니다(장치에 따라 다름)."
        ]
      },
      {
        "heading": "FAB 메뉴",
        "body": [
          "FAB 버튼은 장치 관리와 관련된 작업을 제공합니다.",
          "사용 가능한 옵션은 장치 연결, 장치 설정, 정렬 및 필터링입니다.",
          "정렬은 식물 이름, 위치 또는 마지막 읽기 시간에 따라 수행할 수 있습니다.",
          "필터링은 식물 이름, 위치 및 장치 상태(활성, 비활성)를 포함합니다."
        ]
      },
      {
        "heading": "장치 연결",
        "body": [
          "장치 연결 옵션은 새로운 측정 장치를 추가하고 이를 식물에 할당하는 데 사용됩니다.",
          "설정 중에는 타일에 표시될 매개변수와 선택적인 경고(예: 낮은 토양 습도 수준)가 선택됩니다.",
          "각 장치는 고유한 장치 ID와 장치 비밀 키를 받습니다."
        ]
      },
      {
        "heading": "장치 인증 및 데이터 흐름",
        "body": [
          "장치는 장치 ID와 비밀 키를 사용하여 인증합니다.",
          "읽기를 기록하는 데 사용자 인증이 필요하지 않으며, 접근은 오직 장치 데이터에 의해 제어됩니다.",
          "이 방식은 IoT 통합 및 통신을 단순화합니다."
        ]
      },
      {
        "heading": "장치 설정 및 문서",
        "body": [
          "장치 설정 옵션은 하드웨어 통합에 관한 기술 지침을 제공합니다.",
          "API 엔드포인트(읽기 전송을 위한 POST, 읽기 가져오기를 위한 GET), 샘플 페이로드 및 설정에 관한 정보가 포함됩니다.",
          "사용자는 전체 문서를 다운로드할 수 있으며, 여기에 샘플 코드, 연결도(Fritzing), 권장 센서 등이 포함됩니다."
        ]
      },
      {
        "heading": "중요 정보",
        "body": [
          "장치의 안정성, 센서 캘리브레이션 및 물리적 설치는 사용자 책임입니다.",
          "센서의 읽기는 정보적 성격을 가지며 식물 관찰과 함께 해석해야 합니다.",
          "Flovers는 외부 장치나 사용자 제작 장치에서 나오는 데이터의 정확성을 보장하지 않습니다."
        ]
      }
    ]
  }
}
