{
  "docs_task_history": {
    "title": "작업 기록",
    "sections": [
      {
        "heading": "작업 기록 보기의 목적",
        "body": [
          "작업 기록은 완료된(종료된) 작업을 검토하고 관리하는 데 사용됩니다.",
          "완료된 작업이 무엇인지, 언제 수행되었는지, 어떤 식물에 대한 작업이었는지 분석하는 데 도움이 됩니다.",
          "이 보기에서는 활성 필터(예: 선택된 식물의 기록)로 열거나 모든 완료된 작업을 표시할 수 있습니다."
        ]
      },
      {
        "heading": "완료된 작업의 타일",
        "body": [
          "각 타일은 개별 완료된 작업을 나타내며, 작업 유형(예: 물주기, 분무, 비료 주기), 식물 이름, 위치 및 수행 날짜 등을 포함합니다.",
          "완료된 작업에는 작업을 완료로 표시할 때 추가된 메모가 포함될 수 있습니다.",
          "메모는 타일을 펼친 후에만 표시됩니다."
        ]
      },
      {
        "heading": "메모 미리보기: 펼치기 및 접기",
        "body": [
          "완료된 작업의 메모를 보려면 타일을 클릭하여 펼칠 수 있습니다.",
          "또한 세 개의 점이 있는 메뉴를 사용하여 펼치기/접기 작업을 수행할 수 있습니다(현재 상태에 따라 다름).",
          "이렇게 하면 목록이 읽기 쉬우면서도 간결하게 유지되고, 세부 사항은 필요할 때 볼 수 있습니다."
        ]
      },
      {
        "heading": "타일 메뉴 (세 개의 점)",
        "body": [
          "각 완료된 작업 타일에는 해당 작업에 대한 작업 기록에서의 이 항목에 대한 동작을 제공하는 컨텍스트 메뉴가 있습니다.",
          "펼치기/접기: 타일 안의 메모 섹션을 표시하거나 숨깁니다.",
          "알림 편집: 작업과 연결된 알림으로 이동하여 주기 설정 또는 다른 매개변수를 변경합니다.",
          "식물로 이동: 작업과 연결된 식물 세부 보기로 이동합니다.",
          "작업 삭제: 선택된 완료된 작업을 사용자 계정에서 영구적으로 삭제합니다."
        ]
      },
      {
        "heading": "FAB 작업 (부동 작업 버튼)",
        "body": [
          "작업 기록 보기에는 전체 목록에서 작업을 처리하는 FAB 버튼이 있습니다.",
          "정렬: 완료된 작업의 표시 순서를 변경합니다.",
          "필터: 선택된 기준에 맞춰 작업 기록 목록을 좁힙니다.",
          "삭제: 기준을 기준으로 여러 작업을 한 번에 삭제할 수 있습니다(예: 선택된 식물의 작업, 위치별 작업, 작업 유형별 작업 또는 특정 날짜 이전의 작업)."
        ]
      },
      {
        "heading": "정렬 옵션",
        "body": [
          "정렬은 작업 기록을 당신의 작업 방식에 가장 잘 맞는 순서로 볼 수 있게 도와줍니다.",
          "사용 가능한 정렬 옵션은: 수행 날짜, 식물 이름, 위치입니다."
        ]
      },
      {
        "heading": "필터 옵션",
        "body": [
          "필터는 완료된 작업의 선택된 부분에 집중할 수 있게 해줍니다.",
          "식물 이름, 위치, 작업 유형, 수행 날짜 범위로 필터링할 수 있습니다.",
          "필터는 조합할 수 있으며, 예를 들어 특정 위치에서 특정 월에 수행된 비료 작업만 표시할 수 있습니다."
        ]
      },
      {
        "heading": "일괄 삭제 (삭제 작업)",
        "body": [
          "일괄 삭제는 선택된 기준에 맞춰 여러 완료된 작업을 한 번에 영구적으로 삭제할 수 있게 합니다.",
          "일반적인 시나리오는: 하나의 식물 기록을 지우기, 위치별 작업 삭제, 특정 작업 유형만 삭제, 지정된 날짜보다 오래된 작업 삭제입니다.",
          "일괄 삭제는 영구적이며 되돌릴 수 없습니다."
        ]
      },
      {
        "heading": "작업 기록과 홈의 차이점",
        "body": [
          "홈은 현재 작업(오늘의 작업 및 지연된 작업)과 해당 작업을 수행하는 데 중점을 둡니다.",
          "작업 기록은 완료된 작업에 중점을 두며, 작업 기록을 검토하고 정렬하고 필터링하고 삭제하는 기능을 지원합니다.",
          "이 두 보기는 일상적인 작업을 수행하는 것(홈)과 장기적인 관리 기록을 분석하는 것(작업 기록)을 모두 지원합니다."
        ]
      }
    ]
  }
}
