{
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "Last updated: {{date}}",

    "section1": {
      "title": "§ 1. General provisions",
      "p1": "These Terms of Service define the rules for using the Flovers website and the Flovers mobile application (Android and, in the future, iOS), as well as the conditions for providing electronic services by the Provider.",
      "p2": "The Service is operated by Marcin Janowski Copy Paste IT Solutions Kraków, with its registered address at ul. płk. Francesco Nullo 30/115, 31-543 Kraków, Poland, e-mail: info@flovers.app, hereinafter referred to as the “Provider”.",
      "p3": "By using the Service, including by creating an Account, logging in, or using any functionality of the application or website, the User accepts these Terms and undertakes to comply with them.",
      "p4": "In matters not regulated by these Terms, the applicable provisions of Polish law shall apply, in particular the Act on Providing Services by Electronic Means, the Civil Code, the Act on Consumer Rights, and relevant provisions of European Union law."
    },

    "section2": {
      "title": "§ 2. Definitions",
      "items": [
        "Service – electronic services provided by the Provider under the Flovers brand, including the mobile application, website, and backend infrastructure",
        "Application – the Flovers mobile application available for Android devices (and iOS in the future)",
        "Website – the Flovers website together with documentation and informational content",
        "User – a person using the Service; in the case of registration, a person who has created an Account",
        "Account – an individual user account within the Provider’s system, protected by a password",
        "Device – a device used by the User to access the Service (e.g. phone, tablet) and, where applicable, a measurement device (e.g. Arduino) sending sensor data",
        "Plant Definition – a plant profile created by the Provider containing general characteristics, preferences, and care recommendations, which may include automatically generated content",
        "Plant Instance – a plant created by the User within their Account, representing their own specimen, optionally linked to a Plant Definition",
        "Sensor Data – data from sensors such as air temperature, air humidity, soil moisture, or light level, assigned to a Plant Instance",
        "Reminder – a definition of a recurring plant-care activity (e.g. watering, misting, fertilising, repotting) used to generate Tasks",
        "Task – a specific action generated from a Reminder, which may be marked as completed and annotated by the User",
        "User Content – all data and content created, uploaded, or maintained by the User within the Service",
        "Plant Recognition – a feature that analyses a photo provided by the User and returns a recognition result generated by the Provider’s system",
        "Terms – these Terms of Service"
      ]
    },

    "section3": {
      "title": "§ 3. Scope of the Service and functionalities",
      "intro": "The Service may include, in particular:",
      "list": [
        "registration and management of an Account (login, e-mail confirmation, password reset, re-sending activation links)",
        "access to a library of Plant Definitions with care guidance",
        "creation of Plant Instances and maintenance of plant diaries and history",
        "Reminders and Tasks related to plant care (e.g. watering, misting, fertilising, repotting)",
        "Plant Recognition based on photos provided by the User",
        "integration with measurement devices and storage and presentation of Sensor Data",
        "generation and scanning of QR codes linking to User resources (e.g. Plant Instances)",
        "access to documentation and FAQ"
      ],
      "p1": "The Service is currently provided as a free beta version. The Provider may introduce paid plans, limitations for the free version, advertisements, or subscriptions in the future, of which Users will be informed in advance.",
      "p2": "The Provider may modify, expand, limit, or discontinue selected functionalities of the Service, provided that such changes do not violate mandatory provisions of law."
    },

    "section4": {
      "title": "§ 4. Technical requirements",
      "items": [
        "A device with access to the Internet",
        "A current web browser (for the Website) or a compatible Android system (for the Application)",
        "An active e-mail address required for registration and Account management",
        "Enabled JavaScript and cookies in the web browser, if required for proper operation of the Website"
      ]
    },

    "section5": {
      "title": "§ 5. Account and security",
      "p1": "Use of most Service functionalities requires creating an Account.",
      "p2": "The User is obliged to provide accurate information and to keep their login credentials confidential.",
      "p3": "The User is responsible for all actions performed using their Account, unless such actions result from circumstances attributable to the Provider.",
      "p4": "The Provider may temporarily block or restrict access to an Account or the Service in the event of detected abuse, security threats, or violations of these Terms."
    },

    "section6": {
      "title": "§ 6. User Content and licence",
      "p1": "The User retains any rights they may have to their User Content under applicable law.",
      "p2": "By providing User Content, the User grants the Provider a non-exclusive, free-of-charge, revocable licence (revoked by deleting the Account or content), transferable to the extent necessary to provide the Service, to store, reproduce, display, and process such content solely for the operation and maintenance of the Service.",
      "p3": "Photos used for Plant Recognition are processed only for recognition purposes and are not stored longer than necessary, unless the User explicitly uses a feature requiring their storage.",
      "p4": "The User declares that they hold the necessary rights to the content they provide and that such content does not infringe the rights of third parties."
    },

    "section7": {
      "title": "§ 7. Rules of use and prohibited actions",
      "intro": "The User undertakes to use the Service in accordance with the law, good practices, and respect for the rights of others. In particular, it is prohibited to:",
      "list": [
        "attempt to bypass authentication, security measures, or technical limitations",
        "abuse APIs, endpoints, or integration mechanisms, including those related to measurement devices",
        "provide unlawful, offensive, misleading, or infringing content",
        "send spam or mass promotional content via contact or support features",
        "attempt to gain unauthorised access to data of other Users"
      ],
      "p1": "The Provider may restrict access to the Service or an Account in the event of violations of the above rules."
    },

    "section8": {
      "title": "§ 8. QR codes, links, and access keys",
      "p1": "The Service may allow generating QR codes or links (e.g. to Plant Instances). The User is responsible for their storage and distribution.",
      "p2": "If the User shares links, identifiers, or access keys with third parties, those parties may gain access to the indicated data within the scope of the granted access. The User bears the risk associated with such sharing."
    },

    "section9": {
      "title": "§ 9. Payments and plans (future information)",
      "p1": "As of the publication date of these Terms, the Service is provided free of charge as a beta version.",
      "p2": "The Provider may introduce paid plans, renewable subscriptions, advertisements, or usage limits (e.g. number of plants). Paid plans may be offered via Google Play or Apple App Store.",
      "p3": "If subscriptions are introduced, they may be automatically renewed. Payment terms, billing, and refunds may be governed by the policies of the relevant application store and information provided at the time of purchase."
    },

    "section10": {
      "title": "§ 10. Liability and disclaimers",
      "p1": "The Service is intended to support plant care and has an informational and utility character. The Provider does not guarantee specific outcomes such as plant growth, health, or prevention of care errors.",
      "p2": "The Service is provided on an \"as is\" and best-effort basis. Temporary downtime or limited availability may occur due to maintenance, development, or failures.",
      "p3": "The Provider is not liable for damages resulting from improper use of the Service, incorrect User-provided data, malfunctioning User devices, Internet connectivity issues, or other circumstances beyond the Provider’s control, to the extent permitted by law.",
      "p4": "Nothing in this section limits or excludes consumer rights granted by mandatory provisions of law."
    },

    "section11": {
      "title": "§ 11. Complaints and contact",
      "p1": "Users may submit complaints regarding the operation of the Service by e-mail to: info@flovers.app.",
      "p2": "Complaints should describe the issue, date, and circumstances, and include additional information if possible.",
      "p3": "The Provider will respond without undue delay, where possible no later than within 14 days."
    },

    "section12": {
      "title": "§ 12. Termination and account deletion",
      "p1": "The User may delete their Account at any time from within the Application, resulting in permanent deletion of the Account and associated data.",
      "p2": "The Provider may suspend or terminate access to the Service in the event of violations of these Terms, unlawful actions, or threats to Service security.",
      "p3": "The Provider may discontinue the Service or parts thereof for valid reasons, informing Users in advance where possible."
    },

    "section13": {
      "title": "§ 13. Intellectual property",
      "p1": "Software, design, logos, the Flovers name, documentation, and content provided by the Provider are protected by law and belong to the Provider or authorised entities.",
      "p2": "Copying, modifying, distributing, or using elements of the Service without the Provider’s consent is prohibited, except where permitted by law."
    },

    "section14": {
      "title": "§ 14. User age",
      "p1": "The Service is intended for persons aged 16 years or older.",
      "p2": "Users under the age of 16 must not create an Account or use the Service."
    },

    "section15": {
      "title": "§ 15. Related documents",
      "intro": "The following documents are related to the Service:",
      "list": [
        "Privacy Policy",
        "Cookie Policy",
        "Documentation and FAQ"
      ]
    },

    "section16": {
      "title": "§ 16. Applicable law and dispute resolution",
      "p1": "These Terms are governed by Polish law, subject to mandatory consumer protection provisions.",
      "p2": "Disputes should be resolved amicably in the first instance, in particular by contacting the Provider.",
      "p3": "Consumers may use out-of-court dispute resolution mechanisms and the EU ODR platform available at: https://ec.europa.eu/consumers/odr/.",
      "p4": "Court jurisdiction in consumer disputes is determined in accordance with applicable law."
    },

    "section17": {
      "title": "§ 17. Amendments to the Terms",
      "p1": "The Provider may amend these Terms for valid reasons such as legal changes, Service development, or technological changes.",
      "p2": "Users will be informed of amendments via the Website and/or Application. Continued use of the Service constitutes acceptance of the updated Terms."
    }
  }
}