{
  "docs_create_plant_wizard": {
    "title": "植物追加ウィザード",
    "sections": [
      {
        "heading": "このプロセスの目的",
        "body": [
          "植物追加ウィザードは、あなたのアカウントに新しい植物インスタンスを作成するための9つのステップで構成されるプロセスです。",
          "（任意で）Floversデータベースから植物定義を関連付け、コンテキスト（場所、照度）を収集し、育成好みに基づいてリマインダーを生成することもできます。",
          "このウィザードは新しい植物を作成するためにのみ使用されます。既存の植物の編集は別のビュー/プロセスで行います。"
        ]
      },
      {
        "heading": "ステップ 01 — 植物定義の選択（任意）",
        "body": [
          "検索ボックスを使用して植物定義（組み込み種別プロファイル）を検索できます。",
          "ボックスの下には、人気のある観葉植物のリストがあり、ショートカットとして利用できます。",
          "任意で植物認識を使用できます：スキャンを実行し、写真を撮るかギャラリーから選択すると、システムが最も一致する3つの結果を返します。",
          "提案を受け入れると、選択した植物定義が作成される植物に適用されます。"
        ]
      },
      {
        "heading": "ステップ 02 — 定義のプレビュー",
        "body": [
          "植物定義が選択された場合、このステップでその詳細（画像と基本的な特徴や好み）が表示されます。",
          "これは確認ステップで、次に進む前に正しいプロファイルを確認することができます。"
        ]
      },
      {
        "heading": "ステップ 03 — ロケーションの選択（必須）",
        "body": [
          "植物があるロケーション（例：キッチン、リビングルーム、バルコニー）を選択します。",
          "この段階で新しいロケーションを追加することもできます。",
          "ロケーションの選択は次のステップに進むために必須です。"
        ]
      },
      {
        "heading": "ステップ 04 — 照度（任意の測定）",
        "body": [
          "このステップでは照度のコンテキストを記録できます：方向、光のレベル、窓からの距離。",
          "方向は、アプリにコンパス/センサーの権限が与えられていれば、電話のコンパスで測定できます。",
          "光のレベルは、デバイスに適切なセンサーがあり、必要な権限が与えられていれば測定できます。",
          "照度の値は任意で、手動で入力するか省略できます。"
        ]
      },
      {
        "heading": "ステップ 05 — 鉢と土壌（任意）",
        "body": [
          "容器（例：プラスチック、セラミック）の種類と土壌/基盤の種類を指定します。",
          "これらのフィールドは任意ですが、定期的なタスクを有効にしている場合、より適切なインターバルを推奨するのに役立ちます。"
        ]
      },
      {
        "heading": "ステップ 06 — 自動タスク（植物定義がある場合、任意）",
        "body": [
          "植物が植物定義と関連付けられている場合、Floversはデータベースからの好みに基づいてリマインダー/タスクを自動的に作成できます。",
          "メインのチェックボックスをオンにして自動生成を有効にし、その後作成するタスクの種類を選択します（例：水やり、霧吹き、 fertilizing、植え替え、ケア）。",
          "推奨されるインターバルは植物定義に基づいており、照度と鉢/土壌のデータが利用可能な場合は調整されます。",
          "このステップを省略し、後で手動でリマインダーを作成することもできます。"
        ]
      },
      {
        "heading": "ステップ 07 — 自分の写真の追加（任意）",
        "body": [
          "自分の電話から植物の写真を追加できます。",
          "このステップは任意で、アプリのフローによっては後で追加することも可能です。"
        ]
      },
      {
        "heading": "ステップ 08 — 最終データ（名前必須）",
        "body": [
          "植物の表示名を設定します（必須）。",
          "任意でメモや購入日を追加できます。",
          "これらの情報は植物の詳細に表示され、育成履歴をわかりやすく管理するのに役立ちます。"
        ]
      },
      {
        "heading": "ステップ 09 — サマリーと確認",
        "body": [
          "植物が正しく追加されると、ウィザードは確認/サマリー画面を表示します。",
          "ここから植物のリストに進むか、新しく作成した植物を開くことができます — アプリのナビゲーションによります。"
        ]
      },
      {
        "heading": "注意事項と権限",
        "body": [
          "植物認識にはカメラと/またはギャラリーのアクセスが必要です。これは、写真の提供方法によります。",
          "照度測定にはセンサー（例：コンパス）への権限が必要で、デバイスにセンサーが搭載されている必要があります。",
          "植物定義との関連付けは任意です — このステップを省略しても植物を作成でき、リマインダーは後で手動で追加できます。"
        ]
      }
    ]
  }
}
