{
  "docs_readings": {
    "title": "読み取り",
    "sections": [
      {
        "heading": "このビューの目的",
        "body": [
          "読み取りビューでは、植物に関連付けられたIoTデバイスを表示および管理することができます。",
          "各デバイスは、温度、湿度、光レベル、土壌の湿度などの測定値をFloversに送信できます。",
          "この機能は、植物の条件を監視するために自分のデバイス（例えば、ArduinoやESPをベースにしたもの）を構築しているユーザー向けです。"
        ]
      },
      {
        "heading": "デバイスタイルと最新の読み取り",
        "body": [
          "画面には、各タイルが1つの関連デバイスを表すタイルのリストが表示されます。",
          "各タイルは植物の名前、場所、およびセンサーからの最新の読み取りを表示します。",
          "データがまだ受信されていない場合は、値の代わりにプレースホルダーが表示されます。"
        ]
      },
      {
        "heading": "タイルとのインタラクション",
        "body": [
          "タイルのエリアをクリックすると、そのデバイスの読み取り履歴ビューに直接移動します。",
          "特定のパラメータ（例：湿度または温度）のアイコンをクリックすると、そのパラメータを選択した読み取り履歴が表示されます。",
          "これにより、詳細なグラフに迅速にアクセスできます。"
        ]
      },
      {
        "heading": "デバイスアクション（3点メニュー）",
        "body": [
          "各デバイスタイルには、追加のアクションを含む3点メニューがあります。",
          "利用可能なオプションは、読み取り履歴、植物の詳細、デバイスの編集、およびデバイスの削除です。",
          "デバイスの削除は永続的で、植物との関連が削除されます。"
        ]
      },
      {
        "heading": "読み取り履歴",
        "body": [
          "読み取り履歴ビューでは、収集したデータの詳細なグラフを表示します。",
          "データは、日次、週次、月次で表示できます。",
          "グラフは、温度、湿度、光レベル、および土壌の湿度（デバイスに依存）に対して利用可能です。"
        ]
      },
      {
        "heading": "FABメニュー",
        "body": [
          "FABボタンは、デバイス管理に関連するアクションを提供します。",
          "利用可能なオプションは、デバイスの接続、デバイス設定、並べ替え、およびフィルターです。",
          "並べ替えは、植物名、場所、または最終読み取り時刻によって行うことができます。",
          "フィルタリングには、植物名、場所、およびデバイスのステータス（アクティブ、非アクティブ）が含まれます。"
        ]
      },
      {
        "heading": "デバイスの接続",
        "body": [
          "デバイス接続オプションは、新しい測定デバイスを追加し、植物に割り当てるために使用されます。",
          "設定中に、タイルに表示されるパラメータとオプションのアラート（例：低土壌湿度レベル）が選択されます。",
          "各デバイスには一意のデバイスIDとデバイスシークレットキーが割り当てられます。"
        ]
      },
      {
        "heading": "デバイスの認証とデータフロー",
        "body": [
          "デバイスは、デバイスIDとシークレットキーを使用して認証されます。",
          "読み取りを保存するためにユーザー認証は必要ありません。アクセスはデバイスデータによってのみ制御されます。",
          "このアプローチは、IoTの統合と通信を簡素化します。"
        ]
      },
      {
        "heading": "デバイス設定とドキュメント",
        "body": [
          "デバイス設定オプションは、ハードウェアの統合に関する技術的な指示を提供します。",
          "APIエンドポイント（読み取りの送信用POST、取得用GET）、サンプルペイロード、設定などの情報が含まれます。",
          "ユーザーは、完全なドキュメントをダウンロードでき、サンプルコード、接続図（Fritzing）、推奨センサーが含まれています。"
        ]
      },
      {
        "heading": "重要な情報",
        "body": [
          "デバイスの安定性、センサーのキャリブレーション、および物理的な取り付けはユーザーの責任です。",
          "センサーからの読み取りは情報提供目的であり、植物の観察と一緒に解釈する必要があります。",
          "Floversは、外部デバイスまたは自作デバイスからのデータの正確性を保証しません。"
        ]
      }
    ]
  }
}
