{
  "docs_plant_details": {
    "title": "植物の詳細",
    "sections": [
      {
        "heading": "このビューの目的",
        "body": [
          "植物の詳細ビューは、ユーザーが作成した個々の植物を表示および管理するための中心的な場所です。",
          "このビューは、植物に関する情報、関連するリマインダー、タスク、センサーからの読み取り（利用可能な場合）、および植物に関連するクイックアクションを統合しています。"
        ]
      },
      {
        "heading": "植物情報",
        "body": [
          "画面の上部には植物の画像、その名前、オプションで植物の定義名、および割り当てられた場所が表示されます。",
          "以下には、植物作成時に入力された詳細なパラメーターが表示されます。これには購入日、メモ、照明条件、方位、窓からの距離、鉢の種類、土壌の種類が含まれます。",
          "これらの情報は、リマインダー、読み取り結果、およびケアに関する意思決定をよりよく解釈するのに役立ちます。"
        ]
      },
      {
        "heading": "植物レベルでのアクション（3点メニュー）",
        "body": [
          "植物のヘッダーに関連する3点メニューは、その植物に関する追加のアクションを提供します。",
          "利用可能なオプションには、植物の定義の表示（植物が定義に関連付けられている場合）、植物データの編集、画像の変更、およびその植物にフィルタリングされたリマインダーへの移動が含まれます。",
          "画像の変更により、デフォルトの画像を置き換えたり、電話から独自の写真を追加したり、画像を削除したりできます。"
        ]
      },
      {
        "heading": "植物の定義",
        "body": [
          "植物がFloversの植物定義と関連付けられている場合、ユーザーは専用の定義ビューを開くことができます。",
          "このビューでは、植物の説明、ケアの好み、特徴、難易度、温度範囲、湿度、毒性、および成長特性など、種に関する情報が表示されます。",
          "植物の定義は一般的なガイドラインを提供し、ユーザーの実際の環境を考慮して解釈されるべきです。"
        ]
      },
      {
        "heading": "リマインダーとタスク",
        "body": [
          "リマインダーセクションでは、特定の植物に割り当てられたすべてのアクティブなリマインダーが表示されます。",
          "各リマインダーには独自の3点メニューがあり、タスクを完了、リマインダーを編集、またはタスク履歴を表示することができます。",
          "タスクを完了するとき、ユーザーはメモを追加でき、それが植物のケア履歴の一部となります。"
        ]
      },
      {
        "heading": "最新の読み取り",
        "body": [
          "植物が計測デバイスに関連付けられている場合、このビューでは最新のセンサー読み取りが表示されます。",
          "サポートされる読み取りには、気温、湿度、光のレベル、土壌の湿度が含まれます。",
          "セクションでは、測定時刻とともに最新の値が表示されます。",
          "読み取りタイルをタップすると、ユーザーは「読み取り履歴」ビューに移動し、温度、湿度、光、および土壌湿度の詳細なグラフと概要（日次/週次/月次）を見ることができます（デバイスが植物に関連付けられている場合）。"
        ]
      },
      {
        "heading": "QRコードとクイックアクセス",
        "body": [
          "各植物には、画面の下部に表示されるユニークなQRコードがあります。",
          "このコードをスキャナーのビューでスキャンすると、植物の詳細ビューに直接移動します。",
          "QRコードはデバイスに保存したり、メールで送信したりすることができ、それを印刷して鉢に貼り付けることができます。"
        ]
      },
      {
        "heading": "重要な情報",
        "body": [
          "ユーザーが追加した写真は、ユーザーのデバイスにのみ保存され、Floversのバックエンドには保存されません。",
          "植物のデフォルト画像はFloversのバックエンドから提供され、AIを使用して生成される場合があります。",
          "センサーからの読み取りと提案されたアクションは情報提供の目的であり、ユーザー自身の評価と組み合わせて使用するべきです。"
        ]
      }
    ]
  }
}
