{
  "docs_task_history": {
    "title": "タスク履歴",
    "sections": [
      {
        "heading": "タスク履歴ビューの目的",
        "body": [
          "タスク履歴は、実行された（完了した）タスクを表示および管理するためのものです。",
          "何がいつ行われ、どの植物に対して行動が取られたかを分析するのに役立ちます。",
          "ビューは、アクティブなフィルタ（例：選択した植物の履歴）で開くことができ、またはすべての完了したタスクを表示することもできます。"
        ]
      },
      {
        "heading": "完了したタスクのタイル",
        "body": [
          "各タイルは個別の完了したタスクを表し、タスクの種類（例：水やり、スプレー、肥料）、植物の名前、場所、実行日などを含みます。",
          "完了したタスクには、タスクを完了したときに追加されたメモが含まれていることがあります。",
          "メモはタイルを展開した後に表示されます。"
        ]
      },
      {
        "heading": "メモのプレビュー：展開と折りたたみ",
        "body": [
          "完了したタスクのメモを見るには、タイルをタップして展開できます。",
          "また、メニューから「展開/折りたたみ」アクションを選択して状態に応じた操作を行うこともできます。",
          "これにより、リストは読みやすくコンパクトに保たれ、詳細は必要に応じて表示されます。"
        ]
      },
      {
        "heading": "タイルメニュー（三点リーダー）",
        "body": [
          "各完了したタスクのタイルには、その履歴項目に関連するコンテキストメニューがあります。",
          "展開/折りたたみ：タイル内のメモセクションを表示または非表示にします。",
          "リマインダーの編集：タスクに関連付けられたリマインダーを開き、繰り返し設定や他のパラメータを変更します。",
          "植物に移動：タスクに関連付けられた植物の詳細ビューに移動します。",
          "タスクを削除：選択した完了したタスクをユーザーアカウントから完全に削除します。"
        ]
      },
      {
        "heading": "FABアクション（フローティングアクションボタン）",
        "body": [
          "タスク履歴ビューには、リスト全体で作業を行うためのFABボタンがあります。",
          "並べ替え：完了したタスクの表示順序を変更します。",
          "フィルタ：履歴リストを選択した基準で絞り込みます。",
          "削除：基準に基づいて複数のタスクを一括で削除します（例：選択した植物のタスク、場所ごとのタスク、タスクの種類、または指定した日付以前のタスク）。"
        ]
      },
      {
        "heading": "並べ替えオプション",
        "body": [
          "並べ替えは、作業スタイルに最適な順番で履歴を確認するのに役立ちます。",
          "利用可能な並べ替えオプションは：実行日、植物名、場所です。"
        ]
      },
      {
        "heading": "フィルタリングオプション",
        "body": [
          "フィルタを使用すると、完了したタスクのサブセットに集中できます。",
          "フィルタは、植物名、場所、タスクの種類、実行日範囲で絞り込むことができます。",
          "フィルタを組み合わせて、特定の場所で特定の月に行われた施肥タスクを表示することができます。"
        ]
      },
      {
        "heading": "一括削除（削除アクション）",
        "body": [
          "一括削除は、選択した基準に基づいて複数の完了したタスクを一度に永続的に削除する機能です。",
          "一般的なシナリオは、1つの植物の履歴をクリアする、場所ごとのタスクを削除する、特定のタスクタイプだけを削除する、または指定した日付より前のタスクを削除することです。",
          "一括削除は永続的であり、取り消すことはできません。"
        ]
      },
      {
        "heading": "タスク履歴とホームの違い",
        "body": [
          "ホームは現在のタスク（今日のタスクや遅れているタスク）とその実行に焦点を当てています。",
          "タスク履歴は完了したタスクに焦点を当て、履歴の表示、並べ替え、フィルタリング、削除をサポートします。",
          "これらのビューを組み合わせることで、日常的な作業（ホーム）と長期的なケア履歴の分析（タスク履歴）を両方実行できます。"
        ]
      }
    ]
  }
}
