{
  "docs_overview": {
    "title": "概要",
    "sections": [
      {
        "heading": "Floversとは？",
        "body": [
          "Floversは植物のケアアシスタントで、日常のタスクを整理し、ケアの履歴を追跡し、独自のIoTデバイスからのデータを監視します。",
          "アプリはリマインダーやタスクを植物のプロフィール（あなたの植物）や植物の定義（組み込みの種別プロフィールと推奨事項）と結びつけます。",
          "Floversはあなたの決定をサポートしますが、それを置き換えるものではありません。ケアの効果は条件やヒントの使い方に依存します。",
          "サービスにはモバイルアプリ（Android、将来的にはiOS）、バックエンドAPI、ウェブサイト（ドキュメントおよび法的情報）が含まれています。"
        ]
      },
      {
        "heading": "主要な概念（アプリの構造はどのように機能するか）",
        "body": [
          "植物の定義：一般的な特徴と推奨事項（光、水やり/霧吹き、肥料など）を含む組み込みの種別プロフィール。",
          "植物インスタンス：あなた自身の植物（あなたの個体）で、オプションで植物の定義と関連付けて、より良いデフォルトのヒントを得ることができます。",
          "リマインダー：サイクルルール（例：X日ごとに水やり）に基づいて自動的にタスクが作成されます。",
          "タスク：リマインダーから生成された具体的なアクション。完了としてマークし、メモを追加してケアの履歴を構築できます。"
        ]
      },
      {
        "heading": "主な機能の概要",
        "body": [
          "ユーザーアカウント：登録、ログイン、メール確認、パスワードリセット、およびプロフィール設定の管理。",
          "植物の管理：植物の追加、ロケーションによるグループ化、メモ、アクティビティ履歴の表示。",
          "リマインダーとタスク：サイクルルーチン（例えば水やり、霧吹き、肥料、植え替え、ケアなど）を作成し、実行。",
          "IoTデータ：独自のデバイスを接続し、温度、湿度、土壌湿度、光の強度などのデータを記録。"
        ]
      },
      {
        "heading": "植物認識（写真に基づく）",
        "body": [
          "Floversは写真から植物を認識して、植物の定義を簡単に一致させ、デフォルト設定を改善します。",
          "認識はサーバーサイドで行われ、独自のMLシステムを使用して、700種類以上の植物を訓練したものです。",
          "認識に送信された写真は、認識プロセスの実行のみに使用され、永続的に保存されることはありません。",
          "結果は、写真の品質、照明、焦点、植物の視認性、他の種との類似性に依存します。"
        ]
      },
      {
        "heading": "IoTデバイスとセンサーからのデータ",
        "body": [
          "Floversは、自分自身または外部（例：Arduino）のデバイスをサポートし、あなたのアカウントに関連する読み取りデータを送信します。",
          "サポートされる読み取りデータ：気温、湿度、土壌湿度、光のレベル。",
          "データはバックエンドに保存され、アプリケーションで現在の値や履歴（毎日/週/毎月のサマリー）として表示されます。",
          "ペアリングと使用に関する管理はあなたの手にあり、デバイスの安定性、キャリブレーション、設置はあなたの責任です。"
        ]
      },
      {
        "heading": "QRコードとクイックアクセス",
        "body": [
          "あなたは、植物のインスタンスへのリンクを含むQRコードを生成できます。",
          "典型的なシナリオは、鉢植えにQRコードを印刷して貼り付け、スキャンして植物の詳細にすばやくアクセスすることです。",
          "QRコードは利便性のために使用されます；アクセスのインディケーターとして扱い、メタデータを公開する可能性がある場合は公開しないでください。",
          "現在、植物の詳細は主にログインした所有者が閲覧できるようになっています。"
        ]
      },
      {
        "heading": "通知とリマインダー",
        "body": [
          "Floversは、タスクに関するプッシュ通知（Firebaseを通じて）を送信できます。今日のタスクや遅延タスクなど、設定に応じて送信されます。",
          "通知設定はプロフィールで確認できます；プッシュ通知をオフにしても、リマインダーとタスクはアプリに残ります。",
          "メールメッセージは現在、主にアカウント関連の操作（アクティベーションやパスワードリセット）に使用されています。",
          "通知はサポートのためのものであり、Floversは植物の健康やリマインダーによる損失防止を保証するものではありません。"
        ]
      },
      {
        "heading": "プライバシー、セキュリティ、およびあなたのデータ",
        "body": [
          "Floversはアカウントデータとサービス提供に必要なデータ（植物、リマインダー、タスク、メモ、読み取りデータ）を保存します。",
          "パスワードはハッシュ化して保存され、アカウントのアクティベーションにはメール確認が必要です。",
          "データはEU内で処理されることを前提としています；ホスティングはHetzner（EU）で計画されており、プッシュ通知はFirebaseが処理します。",
          "詳細は、ウェブサイトおよびアプリ内のプライバシーポリシーと利用規約に記載されています。"
        ]
      },
      {
        "heading": "制限と重要な免責事項",
        "body": [
          "Floversは計画とモニタリングのツールであり、専門的なアドバイザリーシステムではなく、園芸知識の代わりにはなりません。",
          "センサーの読み取りは不正確な場合があります（キャリブレーション、設置、条件）；重要な場合は自分で確認してください。",
          "ケアの推奨事項は一般的であり、あなたの条件（土壌、鉢、光、湿度、季節）に合わない可能性があります。",
          "何かがおかしいと感じたら、自分の判断に従ってください—ルーチンを調整し、信頼できる情報源を活用してください。"
        ]
      },
      {
        "heading": "次はどうするか？",
        "body": [
          "始める場合は、ログイン＆登録に進んでから、Create Plant Wizardで最初の植物インスタンスを作成してください。",
          "その後、リマインダーを設定し、タスクを実行して、ルーチンを維持し、ケアの履歴を構築します。",
          "デバイスを持っている場合は、Readingsを開き、設定して、Readings Historyでトレンドを観察してください。",
          "FAQを利用して迅速な回答を得たり、利用規約/プライバシーポリシーを参照して正式な問題を解決してください。"
        ]
      }
    ]
  }
}
