{
  "docs_reminders": {
    "title": "リマインダー",
    "sections": [
      {
        "heading": "このビューの目的",
        "body": [
          "リマインダービューは、植物のケアスケジュールを管理するためのものです。",
          "リマインダーは、実行する内容（タスクの種類）、繰り返し頻度（インターバル）、および関連する植物を指定します。それに基づいて、Floversは自動的にタスクを生成します。"
        ]
      },
      {
        "heading": "2つのビュー：リマインダーリストとカレンダービュー",
        "body": [
          "この画面には2つのモードがあります：リマインダーリストとカレンダービュー。",
          "これらの間を左右にスワイプするか、FABメニューからビューを変更することで切り替えることができます。",
          "両方のビューは同じデータを表示しますが、表示方法が異なります。素早くルールを確認したい場合や、時間を追って計画を見る場合に適しています。"
        ]
      },
      {
        "heading": "リマインダーリストビュー",
        "body": [
          "リストビューでは、各タイルがユーザーによって作成された1つのリマインダーを表します。",
          "タイルには、タスクの種類（アイコンと名前）、植物の名前、場所（指定されている場合）、頻度情報、および次の実行期限が表示されます。",
          "これがアカウント上でアクティブなすべての周期的なルールを確認する最速の方法です。"
        ]
      },
      {
        "heading": "リマインダータイルでのアクション（編集 / 削除）",
        "body": [
          "各リマインダーには2つのアクションがあります：編集と削除。",
          "編集により、インターバル、タスクの種類、関連する植物、その他の設定（リマインダーの種類によって異なる）を変更できます。",
          "リマインダーの削除は永続的で、将来的にはそのルールに基づくタスクが生成されなくなります。"
        ]
      },
      {
        "heading": "カレンダービュー",
        "body": [
          "カレンダービューでは、リマインダーが特定の日に予定されたアイテムとして表示されます。",
          "詳細を見るには、カレンダーの日をクリックしてください。その日の予定されたアイテムがカレンダーの下に表示されます。",
          "カレンダーは、予定されたタスクの種類を示すために色分けされたマーカーやアイコンを使用し、仕事の分布を評価しやすくします。"
        ]
      },
      {
        "heading": "FABメニュー",
        "body": [
          "FABボタンは、リマインダーとビューの変更に関連する迅速なアクションを提供します。",
          "利用可能なオプションは、リマインダーの追加、ビューの変更（リスト/カレンダー）、並べ替え、フィルタリングです。",
          "並べ替えは、期限（due date）、植物名、または場所で行うことができます。",
          "フィルタリングには、植物名、場所、タスクの種類、日付範囲（due date range）が含まれます。"
        ]
      },
      {
        "heading": "リマインダーがタスクを生成する方法（一般的なロジック）",
        "body": [
          "リマインダーは周期的なルールです（例：7日ごとに水やり）。",
          "リマインダーに基づいて、Floversはタスクを生成し、ホーム画面に実行するアイテムとして表示します。",
          "タスクが完了すると、次のタスクはリマインダーのインターバルに従って計画されます（これにより、ルーチンが自動的に継続されます）。"
        ]
      },
      {
        "heading": "メモと実用的なヒント",
        "body": [
          "リマインダーは定期的な作業を維持するのに役立ちますが、植物の健康を保証するわけではありません。実際の環境条件により、インターバルを調整する必要がある場合があります。",
          "条件が変わった場合（季節、光、土壌、鉢の大きさなど）、リマインダーの更新を検討してください。",
          "完了したタスクとメモを管理したい場合は、タスク履歴ビューを使用してください（別途説明）。"
        ]
      }
    ]
  }
}
