{
  "docs_home": {
    "title": "ホーム",
    "sections": [
      {
        "heading": "ホームビューの目的",
        "body": [
          "ホームは、正しくログイン後に表示されるメイン画面です。",
          "日常的な活動に焦点を当て、リマインダーに基づいて生成されたタスクを表示することで、今日対応が必要なことや遅れているタスクをすぐに確認できます。",
          "実行するタスクがない場合、予定されたタスクがないことを知らせる情報タイルと、次のステップに関する提案（例えば、リマインダーの作成）が表示されます。"
        ]
      },
      {
        "heading": "タスクリスト（リマインダーから生成されたタイル）",
        "body": [
          "各タイルは、リマインダーの定義に基づいて生成された個々のタスクを表します（例えば、水やり、霧吹き、施肥、植え替え、または手入れ）。",
          "タスクは、リマインダーで設定された周期ルールに従って、必要になると自動的に表示されます。",
          "タイルには通常、タスクの種類、植物の名前、場所、期限のステータス（例えば、今日または遅れている）が含まれます。"
        ]
      },
      {
        "heading": "タスクタイルメニュー（個別タスクのアクション）",
        "body": [
          "各タスクには、特定のタスクに関連するアクションを含むコンテキストメニュー（三点リーダー）があります。",
          "完了としてマーク: タスクを完了し、オプションでメモを追加することができ、手入れの履歴を構築するのに役立ちます。",
          "リマインダーを編集: タスクに関連するリマインダーを開き、周期設定を変更できます。",
          "植物の詳細へ移動: タスクに割り当てられた植物の詳細ビューに移動します。",
          "履歴を表示: 同じ植物やリマインダーに関連する以前の完了したタスクを表示する履歴を開きます。"
        ]
      },
      {
        "heading": "FABボタン（クイックアクション）",
        "body": [
          "ホーム画面にはFABボタンがあり、タスクに関連するクイックアクションを展開できます。",
          "遅れているタスクを表示: 遅れているタスクのみを表示するクイックフィルターを適用します。",
          "今日のタスクを表示: 今日予定されているタスクのみを表示するクイックフィルターを適用します。",
          "並べ替え: タスクリストの表示順を変更します。",
          "フィルター: 選択した基準でタスクリストを絞り込みます。",
          "履歴: タスク履歴ビューに移動します。この履歴は別途記録されます。"
        ]
      },
      {
        "heading": "並べ替えオプション",
        "body": [
          "並べ替えにより、タスクリストを作業スタイルに合わせて調整できます。",
          "利用可能な並べ替えオプションは、実行日（期限）、植物の名前、場所です。"
        ]
      },
      {
        "heading": "フィルターオプション",
        "body": [
          "フィルターは、選択したタスクグループに集中するのに役立ちます。",
          "タスクは、植物の名前、場所、タスクの種類、実行日範囲でフィルタリングできます。",
          "フィルターは組み合わせることができ、例えば、特定の場所にある植物の水やりタスクのみを表示することができます。"
        ]
      },
      {
        "heading": "タスクの一括完了（バルク）",
        "body": [
          "タスクの一括完了は、ショートカットビュー（遅れているタスクの表示や今日のタスクの表示）を使用している際に利用できます。",
          "これらのフィルターのいずれかがアクティブな場合、FABボタンは「表示中のタスクをすべて完了としてマーク」という追加アクションを一時的に表示します。",
          "このアクションは、現在表示されているすべてのタスクを一度に完了としてマークし、個別のタイルを手動で選択する必要がありません。",
          "一括完了は、複数の植物に対して同じ手入れ作業を同時に行うシナリオを想定して設計されています。",
          "選択したフローによっては、一括アクション後に完了したタスクにメモを追加することができる場合もあります。"
        ]
      },
      {
        "heading": "ホーム画面からのナビゲーション",
        "body": [
          "ホーム画面では、タイルやFABショートカットを使ってアプリの他の部分に素早く移動できます。",
          "個別タスクから、植物の詳細またはタスク履歴に直接移動できます。",
          "FABからは、タスク履歴を開いたり、並べ替えやフィルターでタスクリストを絞り込んだりできます。"
        ]
      }
    ]
  }
}
