{
  "title": "よくある質問",
  "items": [
    {
      "q": "Floversとは何ですか？また、どのように使うことができますか？",
      "a": "Floversは、植物の手入れをサポートするアプリケーションで、タスクの管理やセンサーからのデータに基づいて植物のパラメーターを監視します。日々の育成に役立つリマインダーやヒント、情報を提供します。"
    },
    {
      "q": "Floversは無料ですか？",
      "a": "はい。現在、Floversは無料で利用できます。"
    },
    {
      "q": "Floversはどのプラットフォームに対応していますか？",
      "a": "Floversは現在Androidで利用可能です。将来的にはiOSにも対応予定です。"
    },
    {
      "q": "Floversを使用するにはアカウントが必要ですか？",
      "a": "はい。アカウントの作成は、アプリケーションを使用するために必要です。"
    },
    {
      "q": "Floversは複数の言語に対応していますか？",
      "a": "はい。Floversは、英語、ポーランド語、ドイツ語、イタリア語、フランス語、スペイン語、ポルトガル語、アラビア語、ヒンディー語、中国語、日本語、韓国語など、多くの言語に対応しています。"
    },
    {
      "q": "アカウントはどのように作成できますか？",
      "a": "アプリ内で直接登録できます。登録後、メールでアカウントの確認が必要です。必要に応じて、アクティベーションメールを再送できます。"
    },
    {
      "q": "アクティベーションメールが届かない場合はどうすればよいですか？",
      "a": "アプリ内でアクティベーションメールの再送をリクエストできます。"
    },
    {
      "q": "パスワードをリセットするにはどうすればよいですか？",
      "a": "アプリ内でパスワードリセットのためのメールをリクエストできます。ログインしている場合は、アカウント設定から直接パスワードを変更することもできます。"
    },
    {
      "q": "アカウントに関連付けられたメールアドレスを変更できますか？",
      "a": "はい。ログイン後、アプリ内のプロフィール画面からメールアドレスを変更できます。"
    },
    {
      "q": "アカウントとデータを削除するにはどうすればよいですか？",
      "a": "アカウントは、プロフィール画面から永久に削除できます。この操作は取り消せませんし、関連するすべてのデータも削除されます。"
    },
    {
      "q": "植物の定義と自分の植物の違いは何ですか？",
      "a": "植物の定義は、Floversのデータベースに組み込まれた記録で、その種に関する一般的な情報（好ましい環境、特性、画像、光や土壌の要求、推奨される水や霧吹きの間隔など）を含みます。自分の植物は、ユーザーが管理する特定のインスタンスです。"
    },
    {
      "q": "植物認識機能の精度はどのくらいですか？",
      "a": "精度は、写真の品質と植物の撮影方法によります。認識システムは、700種類以上の植物を基にトレーニングされています。"
    },
    {
      "q": "植物認識用にアップロードした写真は保存されますか？",
      "a": "いいえ。写真は認識のためにバックエンドで処理され、保存されることはありません。"
    },
    {
      "q": "複数の植物を同時に追跡できますか？",
      "a": "はい。現在、追加できる植物や計測デバイスの数に制限はありません。各植物は1つの計測デバイスに関連付けられます。"
    },
    {
      "q": "植物にメモを追加したり、植物の記録を取ったりできますか？",
      "a": "はい。植物や完了したタスクにメモを追加し、育成日記を作成できます。"
    },
    {
      "q": "リマインダーやタスクはどのように機能しますか？",
      "a": "ユーザーは、指定された間隔でリマインダーを作成します。それに基づいてタスクが自動的に作成されます。タスクが完了としてマークされると、次のタスクが間隔に従ってスケジュールされます。設定に応じて、今日のタスクや1日遅れたタスクの通知がメールまたはプッシュ通知で届きます。"
    },
    {
      "q": "どのような手入れタスクがサポートされていますか？",
      "a": "サポートされているタスクには、灌漑、霧吹き、施肥、植え替え、一般的な手入れなどがあります。"
    },
    {
      "q": "タスクを忘れた場合、どうなりますか？",
      "a": "タスクが実行されない場合、アプリケーションは24時間後にリマインダーを送信することがあります。それ以外の場合、タスクは実行されるまで遅延としてマークされます。"
    },
    {
      "q": "リマインダーをオフにしたり、編集したりできますか？",
      "a": "リマインダーはいつでも編集または削除できます。ただし、一時的に停止することはできません。"
    },
    {
      "q": "リマインダーがあっても、植物が健康になることは保証されますか？",
      "a": "いいえ。Floversはリマインダーやヒントを提供しますが、育成に関する決定やその効果はユーザーに依存します。"
    },
    {
      "q": "Floversに接続できるセンサーやデバイスは何ですか？",
      "a": "Floversは、空気温度、湿度、光レベル、土壌湿度を測定するセンサーをサポートしています。推奨されるデバイス設定は、アプリケーションのドキュメントに記載されています。"
    },
    {
      "q": "センサーからのデータはどのくらいの頻度で更新されますか？",
      "a": "読み取り値は、最大で5分ごとに送信されることがあります。記録のため、データは現在、1時間ごとに保存されています。"
    },
    {
      "q": "計測デバイスが故障した場合、どうなりますか？",
      "a": "アプリケーションは、読み取り値がないことを通知しません。ただし、土壌の湿度が特定の閾値を下回ると通知が送信されることがあります。"
    },
    {
      "q": "センサーのデータはクラウドに保存されますか？",
      "a": "はい。センサーのデータは、クラウドのVPSサーバーに保存されます。"
    },
    {
      "q": "他の人が私のセンサーの読み取り値を見ることはできますか？",
      "a": "現在はできません。将来的には共有オプションが導入される可能性があります。また、ユーザーはAPIを通じてデータを取得し、他のデバイス（自動灌漑など）と統合することができます。"
    },
    {
      "q": "FloversのQRコードは何に使われますか？",
      "a": "ユーザーはQRコードを生成して印刷し、鉢に貼ることができます。各コードは特定の植物インスタンスにリンクされています。コードをアプリ内でスキャンすると、ユーザーはその植物の詳細に即座に移動します。"
    },
    {
      "q": "QRコードや植物へのリンクを共有することは安全ですか？",
      "a": "基本的には安全です。植物の詳細は、その植物の所有者であるログインユーザーにのみ表示されます。"
    },
    {
      "q": "自分の植物を公開したり、友達と共有したりできますか？",
      "a": "現在はできません。公開共有機能は将来的に導入される可能性があります。"
    },
    {
      "q": "通知が届かないのはなぜですか？",
      "a": "プッシュ通知がデバイスのシステム設定とアプリ内の設定で有効になっていることを確認してください。"
    },
    {
      "q": "サポートに連絡したり、問題を報告するにはどうすればよいですか？",
      "a": "Floversのウェブサイトにある問い合わせフォームや、アプリのプロフィール画面から利用できる問い合わせフォームを通じて連絡できます。"
    }
  ]
}
