{
  "terms": {
    "title": "利用規約",
    "lastUpdated": "最終更新日: {{date}}",
    "section1": {
      "title": "§ 1. 一般条項",
      "p1": "本規約は、Floversのウェブサイトおよびモバイルアプリ（Android、将来的にはiOS）の利用に関する規定、ならびにサービス提供者による電子的なサービス提供条件を定めたものです。",
      "p2": "サービス提供者は、Marcin Janowski Copy Paste IT Solutions（住所：ul. płk. Francesco Nullo 30/115, 31-543 Kraków, ポーランド、メールアドレス：info@flovers.app、以下「サービス提供者」とします）。",
      "p3": "サービスを利用すること（アカウント登録、ログイン、アプリやサービスの機能の使用を含む）により、ユーザーは本規約を承諾し、それに従うことを約束します。",
      "p4": "本規約に定めのない事項については、特に以下の法律が適用されます：電子商取引に関する法律、民法、消費者保護法、およびその他のポーランド及びEU法の規定。"
    },
    "section2": {
      "title": "§ 2. 定義",
      "items": [
        "「サービス」 – サービス提供者がFloversにおいて提供する電子的なサービスであり、モバイルアプリ、ウェブサイト、および関連するバックエンドインフラストラクチャを含みます。",
        "「アプリ」 – モバイルデバイス用のFloversアプリ（Android; 将来的にはiOS）を指します。",
        "「サービス」 – Floversのウェブサイトおよびそのドキュメントや情報を指します。",
        "「ユーザー」 – サービスを利用する者。登録した場合、アカウントを作成した者。",
        "「アカウント」 – サービス提供者のシステム内のユーザーの個別プロフィール、パスワードで保護されています。",
        "「デバイス」 – ユーザーがサービスを利用するためのデバイス（例：スマートフォン、タブレット）、および場合によっては、サービスにデータを送信する測定機器（例：Arduino）。",
        "「植物の定義」 – サービス提供者によって作成された植物カード/レコードで、特性、好み、推奨事項（例：水やり、霧吹き、肥料）を含み、AIによって自動生成される要素を含む場合もあります。",
        "「植物インスタンス」 – ユーザーがアカウントに定義した植物（そのユーザー自身の個体）で、植物の定義と関連付けられる場合があります。",
        "「測定データ」 – 植物インスタンスに関連するセンサーからのデータ（例：気温、湿度、土壌湿度、光の強さ）。",
        "「リマインダー」 – 循環的な作業の定義（例：水やり、霧吹き、植え替え、手入れ、肥料）で、タスクが作成されます。",
        "「タスク」 – リマインダーに基づいて作成される作業リストの項目；ユーザーはそれを完了としてマークしたり、メモを追加することができます。",
        "「ユーザーコンテンツ」 – ユーザーがサービスに入力または保持するデータ（例：植物インスタンス、メモ、タスク履歴、植物の記録、デバイスとの関連、測定データ）。",
        "「植物認識」 – ユーザーが提供した画像を分析し、サービス提供者のシステムによって認識結果が返される機能。",
        "「規約」 – 本利用規約。"
      ]
    },
    "section3": {
      "title": "§ 3. サービスの範囲と機能",
      "intro": "サービスは特に以下を含む場合があります：",
      "list": [
        "アカウントの登録と管理（ログイン、メール確認、パスワードリセット、アクティベーションリンクの再送信）",
        "植物の定義ライブラリおよび関連するガイドライン",
        "植物インスタンスの作成と記録の管理（メモ、タスク履歴）",
        "植物の手入れに関するリマインダーとタスク（例：水やり、霧吹き、肥料、植え替え）",
        "ユーザーが送信した画像に基づく植物認識",
        "測定機器との統合および測定データの記録・表示",
        "ユーザーリソースへのQRコードやリンクの生成およびスキャン（例：植物インスタンス）",
        "ドキュメントおよびFAQセクション"
      ],
      "p1": "サービスは現在、無料版（ベータ版）として提供されています。サービス提供者は今後、有料プラン、無料プランの制限、広告、またはサブスクリプションを導入する可能性があり、その場合はユーザーにサービス内またはウェブサイトで通知します。",
      "p2": "サービス提供者は、機能、インターフェース、サービスの運用方法を変更することがあり、その際には法的義務を遵守します。"
    },
    "section4": {
      "title": "§ 4. 技術的要求事項",
      "items": [
        "インターネット接続があるデバイス。",
        "最新のウェブブラウザ（サービス用）または対応するAndroidシステム（アプリ用）。",
        "有効なメールアドレス（アカウント登録および管理用）。",
        "ブラウザでJavaScriptとCookieが有効になっていること（サービス用）、これがサービスの正常な動作に必要な場合。"
      ]
    },
    "section5": {
      "title": "§ 5. アカウントとセキュリティ",
      "p1": "サービスの大部分の機能を使用するには、アカウントを作成する必要があります。",
      "p2": "ユーザーは、正確な情報を提供し、ログインデータの機密性を保持する責任があります。",
      "p3": "ユーザーは、自身のアカウントを使用して行ったすべての行動に責任を負いますが、それがサービス提供者側の原因による場合は責任を負いません。",
      "p4": "サービス提供者は、不正利用、安全違反、または規約違反が発覚した場合、一時的にアカウントまたはサービスへのアクセスを制限することがあります。"
    },
    "section6": {
      "title": "§ 6. ユーザーコンテンツとライセンス",
      "p1": "ユーザーは、自身のユーザーコンテンツに対して、法律に基づき権利を保持します。",
      "p2": "ユーザーは、サービス提供者に対し、サービス提供に必要な範囲でユーザーコンテンツを保存、複製、表示、処理する非独占的、無償、取り消し可能なライセンスを付与します。",
      "p3": "植物認識のためにユーザーが画像をサービス提供者のシステムに送信する場合、認識プロセスに必要な範囲を超えて画像は保存されないことをサービス提供者は保証します。ユーザーが画像の保存機能を選択した場合を除きます。",
      "p4": "ユーザーは、サービスに提供するコンテンツに対して権利を所有し、それが第三者の権利を侵害していないことを保証します。"
    },
    "section7": {
      "title": "§ 7. 使用規則と禁止事項",
      "intro": "ユーザーは、サービスを法令、良識、および他者の権利を尊重して使用することを約束します。特に以下は禁止されています：",
      "list": [
        "認証、安全対策、または技術的制限を回避しようとする行為",
        "API、エンドポイント、または統合メカニズム（測定機器に関連するものを含む）を不正に利用し、サービスの運営を妨害する行為",
        "違法、侮辱的、個人の権利を侵害する、著作権や知的財産権を侵害するコンテンツの投稿",
        "連絡またはサポート機能を使用したスパムや宣伝・大量送信の行為",
        "他のユーザーのデータに不正にアクセスする行為"
      ],
      "p1": "サービス提供者は、上記の規則に違反した場合、サービスまたはアカウントへのアクセスを制限することがあります。"
    },
    "section8": {
      "title": "§ 8. QRコード、リンク、及び「秘密の鍵」",
      "p1": "サービスはQRコードやリンク（例：植物インスタンスへのリンク）の生成を可能にする場合があります。ユーザーはそれらの保管および共有の責任を負います。",
      "p2": "ユーザーが第三者にリンク、識別子、またはアクセスキー（例：測定データの読み取り）を提供した場合、その第三者は提供された権限に従って情報にアクセスできます。ユーザーはそのような提供に関連するリスクを負います。"
    },
    "section9": {
      "title": "§ 9. 支払いとプラン（将来の情報）",
      "p1": "本規約の公開時点で、サービスはベータ版として無料で提供されています。",
      "p2": "サービス提供者は今後、有料プラン、定期更新型サブスクリプション、広告、または制限（例：植物の数）を導入する可能性があり、その場合はGoogle PlayやApple App Storeを通じて提供されることがあります。",
      "p3": "サブスクリプションが導入される場合、自動更新の可能性があります。支払い条件、決済、返金に関する情報は、購入時にサービスで通知されるものに従います。"
    },
    "section10": {
      "title": "§ 10. 責任と免責事項",
      "p1": "本サービスは情報提供および植物の手入れ支援を目的としており、特定の結果（例：植物の成長、病気の予防、手入れの誤りの回避）を保証するものではありません。植物の手入れに関する決定は、ユーザーの責任で行います。",
      "p2": "サービス提供者は、最善を尽くしてサービスを提供しますが、技術的な中断や可用性制限が発生する場合があります。",
      "p3": "サービス提供者は、サービスの不正使用、ユーザーが提供した誤ったデータ、ユーザー側の測定機器の不具合、インターネット接続の中断などに起因する損害については、法律で許される範囲で責任を負いません。",
      "p4": "本条項は、消費者法に基づく消費者の権利を排除または制限するものではありません。"
    },
    "section11": {
      "title": "§ 11. 苦情と連絡先",
      "p1": "ユーザーはサービスに関する苦情を電子的に次のアドレスに送信できます：info@flovers.app。",
      "p2": "苦情には問題の詳細、発生日時および状況を記載し、可能であれば問題識別のための情報（例：スクリーンショット）を添付してください。",
      "p3": "サービス提供者は、遅滞なく、可能な限り14日以内に回答します。"
    },
    "section12": {
      "title": "§ 12. 契約の解除、アカウント削除",
      "p1": "ユーザーはアプリケーションからいつでもアカウントを削除できます。これにより、アカウントおよびサービス提供者のシステムに関連するデータが完全に削除されます（「隠しモード」はありません）。",
      "p2": "サービス提供者は、規約違反、違法行為、またはサービスのセキュリティを脅かす行為があった場合、ユーザーに対してサービスの提供を一時的に停止または終了することがあります。",
      "p3": "サービス提供者は、技術的または法的な理由など、重要な理由によりサービスの全部または一部を終了することがあります。その場合、可能であればユーザーに事前通知します。"
    },
    "section13": {
      "title": "§ 13. 知的財産権",
      "p1": "ソフトウェア、外観、ロゴ、Floversの名前、ドキュメント、およびサービス提供者によって提供されるコンテンツは、著作権を含む法的保護の対象であり、サービス提供者または権利を持つ者に帰属します。",
      "p2": "サービスの要素をコピー、変更、配布、または利用することは、サービス提供者の許可なしには禁じられており、法的に許可された使用を除きます。"
    },
    "section14": {
      "title": "§ 14. ユーザーの年齢",
      "p1": "サービスは16歳以上の方を対象としています。",
      "p2": "ユーザーが16歳未満の場合、アカウントを作成したり、サービスを利用することはできません。"
    },
    "section15": {
      "title": "§ 15. 関連文書",
      "intro": "サービスに関連する以下の文書および情報があります：",
      "list": [
        "プライバシーポリシー",
        "クッキーポリシー",
        "ドキュメントおよびFAQ"
      ]
    },
    "section16": {
      "title": "§ 16. 適用法および紛争解決",
      "p1": "本規約はポーランド法に基づきますが、消費者保護に関する強制的な法律の規定は除外されません。",
      "p2": "紛争はまず友好的に解決することを試みるべきです（例：メールによる連絡および意見交換）。",
      "p3": "消費者は、ADR（裁判外紛争解決）およびODR（オンライン紛争解決）プラットフォーム（https://ec.europa.eu/consumers/odr/）を利用することができます。",
      "p4": "消費者との紛争における裁判所の管轄は、一般法の規定に従って決定されます。"
    },
    "section17": {
      "title": "§ 17. 規約の変更",
      "p1": "サービス提供者は、重要な理由（例：法律改正、サービスの発展、技術的な変更）により規約を変更することがあります。",
      "p2": "規約の変更について、サービス提供者はサービス内またはアプリケーションで通知します。変更後もサービスを利用し続けることで、ユーザーは更新された規約に同意したことになります。"
    }
  }
}
